{"manufacturer": "Canada Goose", "name": "Sanford Parka - Men's", "price": "995", "category_hierarchy": ["Men", "Men/Jackets &amp; Vests", "Men/Jackets &amp; Vests/Down Coats &amp; Vests", "Men/Jackets &amp; Vests/Insulated Coats &amp; Vests", "Men/Jackets &amp; Vests/Parkas"], "sku": "cgo-3400m", "uid": "4002347941991", "review_score": "4.6667", "review_total": "3", "url": "https://www.altitude-sports.com/products/canada-goose-sanford-parka-mens-llll-cgo-3400m", "tech_specs": {"features": ["LENGTH: Mid-thigh", "ORIGIN: Made in Canada", "2-way adjustable down-filled hood adds warmth and element protection. Reflective webbing along the back adds visibility in low light. Brim has a shaping wire to stand up to harsh winds", "Overstuffed collar adds warmth and insulation while chin guard is lined with tricot fabric for added softness and comfort", "Interior backpack straps allow jacket to be carried hands-free over the shoulders", "Articulated sleeves and underarm gussets enhance fit and add range of motion", "Recessed rib-knit cuffs with thumbhole construction add comfort and lock in heat", "Back vents with hidden snap closures add range of motion when opened up", "Hem is longer in the back for added warmth, coverage and protection", "Placket with snap closures over 2-way zipper keeps the elements out. Unzip from the bottom for added range of motion or venting", "5 exterior pockets: secure zipper pocket underneath placket, 2 sets of double-stacked fleece-lined hand warmer pockets with 2-way zipper closures for ease of access", "3 interior pockets: drop-in pocket, 2 mesh drop-in pockets", "FILL: 625 Fill Power White Duck Down", "Whether you're working up a sweat hiking trails, embarking on an urban adventure, or exploring the coldest places on Earth, we've developed the Thermal Experience Index (TEI) to help you find the right Canada Goose jacket for your body, your activities, and lifestyle.", "Thermal Experience Index Rating: 3 (-10°C / -20°C): Fundamental warmth fashioned for everyday use.\n                            \n                    \n                \n                \n                \n\n\n\n\n    \n\n    \n\n    \n\n\n", "\n"]}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/CGO-3400M_7EBlack_995396b3-0035-4fb7-8131-4c0f42574da7.jpg?v=1621405740"]}