{"manufacturer": "Canada Goose", "name": "Berkley Coat - Women's", "price": "795", "category_hierarchy": ["Women", "Women/Jackets &amp; Vests", "Women/Jackets &amp; Vests/Down Coats &amp; Vests", "Women/Jackets &amp; Vests/Insulated Coats &amp; Vests", "Women/Jackets &amp; Vests/Winter Coats"], "sku": "cgo-2905l", "uid": "4468513636455", "review_score": "5", "review_total": "4", "url": "https://www.altitude-sports.com/products/canada-goose-berkley-coat-womens-llll-cgo-2905l", "tech_specs": {"features": ["FIT: Slim", "LENGTH: Mid-thigh", "ORIGIN: Made in Canada with domestic and imported materials.", "Strategically placed down-fill at the hood, collar and sleeves for lightweight warmth where you need it", "Removable, adjustable down-filled hood for essential warmth and element protection. Signature double-stripe reflective details at the back adds visibility in low light. When hood is removed, the exposed zipper folds into the collar", "Interior backpack straps allow jacket to be carried hands-free over the shoulders", "Recessed Power Stretch® cuffs lock in warmth", "Articulated sleeves and underarm gussets enhance fit and add range of motion", "Adjustable webbing at the waist customizes fit ", "Placket with hidden snap closures over 2-way zipper keeps the elements out. Unzip from the bottom for added range of motion or venting", "4 exterior pockets: 2 upper pockets and 2 reverse entry pockets. Both have snap closures and tricot fabric at knuckle side for softness and warmth", "1 interior pocket: security pocket with zipper closure", "Fill: 675 Fill Power White Goose Down", "Materials: Feather-Light - This soft to the touch, ultra-lightweight fabric is designed to withstand high winds, light rain and snow. Made from 100% Nylon with a DWR finish, stay dry and comfortable in unpredictable weather.", "Whether you're working up a sweat hiking trails, embarking on an urban adventure, or exploring the coldest places on Earth, we've developed the Thermal Experience Index (TEI) to help you find the right Canada Goose jacket for your body, your activities, and lifestyle.", "TEI2: 0°C / -15°C\n                            \n                    \n                \n                \n                \n\n\n\n\n    \n\n    \n\n    \n\n\n", "\n"]}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/CGO-2905L_7EBlack.jpg?v=1585376946"]}