{"manufacturer": "GSI Outdoors", "name": "Halulite Ketalist", "price": "46.99", "category_hierarchy": ["Gear", "Gear/Camp Kitchen", "Gear/Camp Kitchen/Pots &amp; Pans"], "sku": "gsi-50263", "uid": "2123293294695", "review_score": "4.8", "review_total": "3", "url": "https://www.altitude-sports.com/products/gsi-outdoors-halulite-ketalist-llll-gsi-50263", "tech_specs": {"features": ["Low-profile design provides the capacity of a 1 liter ultralight boiler and the easy-to-pour profile of a tea kettle", "Folding handle locks into place", "Unique bowl + mug solution with low center of gravity and Sip-It lid virtually eliminate spills while the insulating sleeve keeps drinks hot", "Clever folding foon design compacts to just 3.7” long, but extends and locks to become a 6.1” fork-spoon hybrid", "Convenient graduations molded into the pot make for easy measuring", "Stuff sack's nylon bottom panel and short sides help to keep soot and char off clothes and other gear", "Integrated nesting design allows fuel canisters to store within set (110 g)", "Halulite™: Say goodbye to scratches, burn circles and ounces. As light as Titanium, Halulite is a proprietary alloy that also conducts heat better and more evenly—so you can leave the extra fuel at home. Plus, every piece is Hard Anodized to create a surface that withstands scratches and abrasions like nothing else. It's ultra light without the sacrifices. Now that's smart.", "Infinity: A major leap forward in clean and green plastics, Infinity is an ultra-lightweight, completely recyclable, BPA-Free alternative to Polycarbonate resins. With exceptional clarity, jewel-like brilliance and 25% weight savings over Polycarbonate; its beauty is truly inspired. Furthermore, Infinity will not absorb food odors like other plastics and will not leach plasticizers or other chemicals into either food or beverage. It's even dishwasher safe and actually becomes more stain-resistant with every wash. Infinity: a final product which is far beyond the sum of its parts.", "Dimensions: 6.5\" x 6.1\" x 3.5\"", "Includes: 1.0 L Kettle, 14 fl. oz. Mug w/ Insulated Sleeve, 14 fl. oz. Bowl, Sip-It Top, Folding Foon, Stuff Sack", "Weight: 11.3 oz.", "Material: Hard Anodized Aluminum, Clear Polypropylene, Stainless Steel.\n                            \n                    \n                \n                \n                \n\n\n\n\n    \n\n\n", "\n"]}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/GSI-50263_7ENo_20Color.jpg?v=1553148720"]}