{"manufacturer": "Kahtoola", "name": "NANOspikes® Footwear Traction - Unisex", "price": "59.99", "category_hierarchy": ["Footwear", "Footwear/Care &amp; Accessories", "Footwear/Care &amp; Accessories/Crampons"], "sku": "kah-kt05", "uid": "4176280748135", "review_score": "4.78", "review_total": "31", "url": "https://www.altitude-sports.com/products/kahtoola-nanospikes-footwear-traction-unisex-llll-kah-kt05", "tech_specs": {"features": ["Spike Design:", "\nMade from tungsten carbide, each spike is extremely wear-resistant for use on pavement without affecting foot strike, and is held in place with a lightweight aluminum anchor, while a surrounding TPU cleat provides added traction and shock absorption", "\nReinforced Eyelets:", "\nReinforced using durable TPU inserts to ensure longevity, each patented eyelet allows the elastomer bands to be lighter and stronger, preventing tearing along the harness and at connection points", "\nTraction Plates:", "\nUpward-facing traction ensures NANOspikes® stay in place against footwear", "\nDual Compound:", "\nUsing TPU construction, a softer compound provides wear-resistance, flexibility and aides in snow release, while a harder compound near the spikes disperses force against the shoe’s sole", "\nToe Bale:", "\nHighly flexible with recessed connection points, the toe bale secures the foot’s position at the front of the shoe for added comfort, preventing the toe from pushing through the front of the elastomer harness", "\nRaised Heal Tab:", "\nAllows for easy pull-back and removal", "\nElastomer Harness:", "\nLow-profile, extremely durable and ergonomically shaped, the elastomer bands are constructed from TPE for a secure fit and remain stretchy down to -30°F"], "• Spike material": " tungsten carbide", "• Pack size": " 6 x 4 x 2.25 inches (54 in3)", "• Care Instructions": " Wash with lukewarm water and air-dry (do NOT dry with heat). Ensure the product is clean and dry before storage. Inspect before each use\n                            \n                    \n                \n                \n                \n\n\n\n\n    \n\n    \n\n    \n\n    \n\n    \n\n    \n\n    \n\n    \n\n\n"}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/KAH-KT05_7ECharcoal.jpg?v=1614239578"]}