{"manufacturer": "Nixon", "name": "Descender Watch - Men's", "price": "419.99", "category_hierarchy": ["Gear", "Gear/Watches &amp; Wristwear", "Gear/Watches &amp; Wristwear/Men", "Men"], "sku": "nix-a959-1320", "uid": "1430507061351", "review_score": "0", "review_total": "0", "url": "https://www.altitude-sports.com/products/nixon-mens-descender-watch-llll-nix-a959-1320", "tech_specs": {"features": [], "• Watch Movement": " Swiss made quartz 3 hand movement with date function and crown placement at 9 o’clock.", "• Watch Dial": " The dial features printed hour and seconds track on the concave ring, custom molded hands, and a date window at 9 o’clock.", "• Watch Case": " 45 mm, 300 meter/30 ATM custom stainless steel case with domed hardened mineral crystal and anti-glare treatment on the underside of the crystal, Unidirectional stainless steel bezel, contrast plated stainless steel bezel insert with color fill elapsed timer markings, custom screw bar lugs, triple gasket crown, and stainless steel screw down caseback.", "• Watch Band": " 23 mm custom solid stainless steel free-swing 3 link bracelet with a solid stainless steel double locking clasp with micro adjust.", "• Warranty": " Nixon offers a limited warranty on defects in materials and workmanship for a period of two (2) years after you have taken physical possession of the watch from nixon.com or an authorized Nixon dealer. We also want to make sure we get your watch fixed if you encounter any problems with it, so we guarantee that we will keep sufficient spare parts to repair or replace it for two (2) years. This means that if the materials in your watch aren't right or if the watch isn't put together correctly, we'll repair or replace it, at our discretion. But, this doesn't mean you can abuse your watch and expect us to fix it for free.\n                            \n                    \n                \n                \n                \n\n\n\n\n    \n\n\n"}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/NIX-A959-1320_7EAll_20Black_20-_20Multi.jpg?v=1577595973"]}