{"manufacturer": "Nixon", "name": "51-30 Chrono - Men's", "price": "519.99", "category_hierarchy": ["Gear", "Gear/Watches &amp; Wristwear", "Gear/Watches &amp; Wristwear/Men", "Men"], "sku": "nix-a083-000", "uid": "1428524859495", "review_score": "5", "review_total": "1", "url": "https://www.altitude-sports.com/products/nixon-mens-51-30-chrono-black-watch-llll-nix-a083-000", "tech_specs": {"features": [], "• Watch Movement": " Miyota Japanese quartz 6 hand chronograph with date and a 9-hour crown and pusher placement.", "• Watch Dial": " The dial is surrounded by a concave dial ring and includes bold printed indices, a printed seconds track, CD textured subdials and custom molded hands with luminous fill.", "• Watch Case": " 51 mm, 300 meter/30 ATM custom solid stainless steel, solid stainless steel or handmade acetate unidirectional rotating bezel with countdown timer, hardened mineral crystal, screw down crown and pushers, stainless steel screw down caseback and screw pin lugs.", "• Watch Band": " 25 mm custom solid stainless steel or handmade acetate 3-link bracelet with stainless steel double locking clasp with micro adjust.", "• Warranty": " Nixon offers a limited warranty on defects in materials and workmanship for a period of two (2) years after you have taken physical possession of the watch from nixon.com or an authorized Nixon dealer. We also want to make sure we get your watch fixed if you encounter any problems with it, so we guarantee that we will keep sufficient spare parts to repair or replace it for two (2) years. This means that if the materials in your watch aren't right or if the watch isn't put together correctly, we'll repair or replace it, at our discretion. But, this doesn't mean you can abuse your watch and expect us to fix it for free.\n                            \n                    \n                \n                \n                \n\n\n\n\n    \n\n\n"}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/NIX-A083-000_7EBlack.jpg?v=1567227910"]}