{"manufacturer": "Sweet Protection", "name": "Trailblazer MIPS Helmet", "price": "229.99", "category_hierarchy": ["Gear", "Gear/Helmets", "Gear/Helmets/Bike", "Gear/Helmets/MIPS"], "sku": "spn-845104", "uid": "4552090091623", "review_score": "5", "review_total": "4", "url": "https://www.altitude-sports.com/products/sweet-protection-trailblazer-mips-helmet-llll-spn-845104", "tech_specs": {"features": ["4-Piece Shell Construction: The unique four-piece in-mold shell structure utilises variable Polycarbonate outer shell thicknesses and geometrical shapes to optimize the protection performance.", "MIPS - Multi-directional Impact Protection System: The MIPS Brain Protection System is a helmet-integrated low-friction layer is designed to reduce rotational motion transferred to the brain from angled impacts to the head.", "In-Mold Constrcution: In-mold construction is a technique that directly fuses the shock absorbing EPS liner with the Polycarbonate shells to create a lightweight and strong structure.", "Occigrip Turn Dial: Makes the helmet easily adjustable with a low volume mechanism. The Occigrip construction provides a firm and comfortable fit and prevents the helmet from rolling on your head. Adjustable in both reach and height.", "DOV Ventilation: Digitally Optimised Ventilation is optimised through digital air flow simulation. This ensures the air flows well through vents and internal channels at different speeds.", "STACC Ventilation: Superficial Temporal Artery Cooling Channel is a front vent, an internal channel and an exhaust vent that cools down the temporal artery without exposing your temples which is the most vulnerable area of the head. Patent Pending.", "Shatter Resistant Visor: Made from Superlight ABS material. Removable. Mounting hardware including"], "• Weight": " 325g\n                            \n                    \n                \n                \n                \n\n\n\n\n    \n\n    \n\n\n"}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/SPN-845104_7EMatte_20Black.jpg?v=1619764668"]}