{"manufacturer": "Thule", "name": "Landmark 70L Travel Pack - Men's", "price": "299.95", "category_hierarchy": ["Gear", "Gear/Packs &amp; Bags", "Gear/Packs &amp; Bags/Hiking Packs", "Gear/Packs &amp; Bags/Hiking Packs/Men", "Gear/Packs &amp; Bags/Luggage &amp; Carry-On", "Men"], "sku": "thu-3203731", "uid": "4509412556903", "review_score": "0", "review_total": "0", "url": "https://www.altitude-sports.com/products/thule-landmark-70l-travel-pack-mens-llll-thu-3203731", "tech_specs": {"features": ["Protect and organize a phone, sunglasses, cords and small valuables in the SafeZone compartment", "Keep money and a passport safe from pickpockets in the covert CashStash compartment hidden under the SafeZone", "Navigate day trips with the removable 20L add-on daypack complete with 15\" MacBook® storage, a breathable backpanel and a covert CashStash pocket for money and personal items", "Enjoy a hands-free, balanced and secure carry by attaching the add-on daypack to the front of the shoulder straps", "Prevent wear and tear with a zippered cover to protect the backpanel, shoulder straps and hipbelt when bag is not being worn", "Deter theft with innovative LoopLocks by securing zipper pulls to the bag. Double zipper pulls can also be locked (TSA locks sold separately)", "Belongings are held securely in place and organized with internal compression straps and mesh storage pockets", "Securely store a water bottle and other small items in the zippered side pocket", "Designed as a checked piece of luggage to support longer travel excursions", "Easily move the sternum strap whistle from the main pack to the daypack for an added level of safety on any outing", "70L of combined packing space from the 50L main bag and 20L add-on daypack", "Material: 420D Dobby polyester, 600D polyester", "Volume: 70 L", "Dimensions: 49 x 33 x 63 cm", "Weight: 2.07 kg.\n                            \n                    \n                \n                \n                \n\n\n\n\n    \n\n    \n\n\n", "\n"]}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/THU-3203731_7EObsidian.jpg?v=1583399972"]}