{"manufacturer": "Adventure Medical Kits", "name": "Natrapel Lemon Eucalyptus Spray 74 ml", "price": "8.99", "category_hierarchy": ["Gear", "Gear/Health &amp; Safety", "Gear/Health &amp; Safety/First Aid Kits &amp; Supplies"], "sku": "amk-0007-6720", "uid": "10046216454", "review_score": "4.0526", "review_total": "12", "url": "https://www.altitude-sports.com/products/adventure-medical-kits-natrapel-lemon-eucalyptus-spray-75-ml-llll-amk-0007-6720", "tech_specs": {"features": ["DEET-Free Insect Repellent: Keep bugs at bay without relying on chemicals. Made using Lemon Eucalyptus tree leaves, Natrapel’s Oil of Lemon Eucalyptus insect repellent has a refreshing scent and non-oily feel.", "Repels Mosquitoes for up to 6 Hours: Protect yourself from the buzzing and biting of mosquitoes. Natrapel effectively repels mosquitoes for up to six hours, letting you enjoy the outdoors bug free.", "CDC-Recommended Active Ingredient: Choose the naturally-derived mosquito repellent guaranteed to effectively repel mosquitoes. Lemon Eucalyptus Oil is the only plant-based active ingredient recommended by the CDC.", "Protection from Disease-Carrying Mosquitoes: Step outside knowing you’re protected. This bug spray repels mosquitoes that may carry the Zika virus, Chikungunya virus, West Nile virus, Dengue virus, and Eastern Equine Encephalitis.", "Travel-Size Bottle: Take Natrapel with you for insect protection you can rely on everywhere you go. The portable 3.4 oz. bottle fits easily into your pack and is the maximum size allowed by the TSA for flights.", "Won’t Harm Gear: Apply Natrapel Lemon Eucalyptus without fear of damaging your gear. The plant-based formula won’t harm your camping gear, fishing line, tackle box, or synthetic materials.", "Size: 5\" x 1.2\" x 8.25\"", "Weight: 3.4 oz\n                            \n                    \n                \n                \n                \n\n\n\n\n    \n\n\n", "\n"]}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/AMK-0007-6720_7ENo_20Color.jpg?v=1551417235"]}