{"manufacturer": "Canada Goose", "name": "Armstrong Hoody - Men's", "price": "895", "category_hierarchy": ["Men", "Men/Jackets &amp; Vests", "Men/Jackets &amp; Vests/Down Coats &amp; Vests", "Men/Jackets &amp; Vests/Insulated Coats &amp; Vests"], "sku": "cgo-5076m", "uid": "4002348138599", "review_score": "4.8", "review_total": "6", "url": "https://www.altitude-sports.com/products/canada-goose-armstrong-hoody-mens-llll-cgo-5076m", "tech_specs": {"features": ["LENGTH: Hip", "ORIGIN: Made in Canada", "Packable into wearer's interior left pocket. When packed, it has a carrying loop for easy travel.", "Down-filled hood is adjustable 2-ways and adds warmth and element protection. Signature double-stripe reflective details at back for added visibility in low light", "Elbows, tops of shoulders, pocket details and cuffs are reinforced with Cordura® fabric for added durability at high-abrasion areas", "Articulated sleeves and underarm gussets enhance fit and add range of motion", "Recessed Power Stretch® cuffs with thumbhole construction lock in heat and keep sleeves in place during active use.", "Down-filled placket with hidden snap closures over 2-way zipper keeps the elements out. Unzip from the bottom for added range of motion or venting", "2 exterior pockets: 2 fleece-lined handwarmer pockets with snap closures", "2 interior pockets: security pocket with zipper closure that doubles as a pack pocket, mesh drop-in pocket", "FILL: 750 Fill Power Hutterite White Duck Down", "Whether you're working up a sweat hiking trails, embarking on an urban adventure, or exploring the coldest places on Earth, we've developed the Thermal Experience Index (TEI) to help you find the right Canada Goose jacket for your body, your activities, and lifestyle.", "Thermal Experience Index Rating: 2 (0°C / -15°C): Ultimate in core warmth, comfort and versatility.", " Fit : Slim\n                            \n                    \n                \n                \n                \n\n\n\n\n    \n\n    \n\n    \n\n\n", "\n"]}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/CGO-5076M_7EBlack.jpg?v=1566971194"]}