{"manufacturer": "Danner", "name": "Danner Ridge Boots - Men's", "price": "524.99", "category_hierarchy": ["Footwear", "Footwear/Men", "Footwear/Men/Hiking Boots", "Footwear/Men/Waterproof Footwear", "Men"], "sku": "dnr-34120", "uid": "6155566973112", "review_score": "0", "review_total": "0", "url": "https://www.altitude-sports.com/products/danner-danner-ridge-boots-mens-llll-dnr-34120", "tech_specs": {"features": ["Full-Grain Leather & Waxed Canvas Upper: \nWaxed canvas quarter panels accent our full-grain leather for a strong and durable upper that has a more unique aesthetic.", "\nGORE-TEX (GTX): \n100% waterproof and breathable, GORE-TEX liners ensure that no water gets in, while allowing sweat and moisture to get out.", "\nRemovable OrthoLite Footbed: \nThree layers of varying density are combined for maximum cushioning and support. The entire footbed is made of open-cell polyurethane for better heat dissipation and air circulation.", "\nBi Fit Board: \nBy combining the shank, lasting board, and midsole into a single unified piece that is molded to match the shape and contours of our boots, we were able to reduce a significant amount of weight from the boot without sacrificing support.", "\nVibram® Kletterlift Outsole: \nSpecifically designed for comfort and durability; the heel provides superb shock absorption and the rubber compound guarantees great traction and stability on both wet and dry surfaces.", "\nStitchdown Construction: \nHandcrafted to provide a wider platform, our legendary stitchdown construction offers increased stability underfoot. Many of our stitchdown boots can be recrafted.", "\nHow It Fits: \nPortland made 503 last has a casual fit without compromising Danner's comfortable lace-to-toe construction. Fits true to size.", "\nRecraftable: \nExtend the life of your boot with our recrafting services. Please note we are unable to replace the liner on this style due to the more technical construction of our lightweight Bi-Fit board. This boot is eligible for a boot stretch, basic and resole packages."]}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/DNR-34120_7ESmores.jpg?v=1611818819"]}