{"manufacturer": "Danner", "name": "Arctic 600 Side-Zip Boots - Men's", "price": "299.99", "category_hierarchy": ["Footwear", "Footwear/Men", "Footwear/Men/Hiking Boots", "Footwear/Men/Insulated Boots &amp; Shoes", "Footwear/Men/Leather Boots &amp; Shoes", "Footwear/Men/Waterproof Footwear", "Footwear/Men/Winter Boots", "Men"], "sku": "dnr-67331", "uid": "4192260849767", "review_score": "4.625", "review_total": "10", "url": "https://www.altitude-sports.com/products/danner-arctic-600-side-zip-7-jet-black-200g-boots-mens-llll-dnr-67331", "tech_specs": {"features": ["Suede Upper: These uppers are made from rich, durable suede.", "Danner Dry: 100% waterproof barrier allows moisture to escape without letting water in, keeping your feet dry and comfortable all day long.", "Side Zip: Get in and out of your boots faster with this semi-locking side zipper. It locks itself closed when its zipped up, yet easily releases when you pull the zipper down.", "200G PrimaLoft® Insulation: PrimaLoft® Gold Insulation offers best-in-class insulation for repeated compression and durability, making it the go-to choice for insulated footwear.", "Removable OrthoLite Footbed: Three layers of varying density are combined for maximum cushioning and support. The entire footbed is made of open-cell polyurethane for better heat dissipation and air circulation.", "Vibram® SPE Midsole: This rubberized EVA midsole maintains the same cushioning properties as traditional EVA, but is more durable and won’t break down as easily. This technology enhances rebound, comfort and support.", "Vibram® Nisqually Arctic Grip Outsole: Utilizing flex lines, a split heel and specially formulated Arctic Grip compound, this outsole provides the most advanced traction in wet and icy conditions.", "Vibram® Arctic Grip: Specifically designed to perform on wet ice, Vibram® Arctic Grip is made entirely of rubber without any metal components or inserts. This special compound excels in cold, icy or snowy conditions when superior traction is needed most.", "How It Fits: Designed for versatility, the DPDX has a low profile for everyday wear. Whether on the trail or urban exploring, this last was built to offer enough room for comfort while maintaining a sleek profile. Ortholite footbed included."]}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/DNR-67331_7EJet_20Black_b2acde4b-cbcd-4fa4-8e98-ec380e7fa0a5.jpg?v=1610090912"]}