{"manufacturer": "Exped", "name": "Lite +1° Left Zip Sleeping Bag - Large - Unisex", "price": "649.99", "category_hierarchy": ["Gear", "Gear/Sleeping Bags", "Gear/Sleeping Bags/0 Celcius to Minus 20", "Gear/Sleeping Bags/0 Celcius to Minus 20/Men", "Gear/Sleeping Bags/0 Celcius to Minus 20/Women", "Men", "Women"], "sku": "exp-71994673", "uid": "6606114980024", "review_score": "0", "review_total": "0", "url": "https://www.altitude-sports.com/products/exped-lite-1-left-zip-sleeping-bag-large-unisex-llll-exp-71994673", "tech_specs": {"features": ["The large hood opening ensures a comfortable fit. When cinched tight on cold nights it seals accurately around mouth and nose. The inner lining doubles as the cinch cord guard preventing pressure on forehead and nose when the hood is closed. And the hood is large enough to hold a pillow", "Internal hidden pocket to secure small personal items or keep batteries warm", "Snap button closes the draft collar. No hoop and loop tabs that attach to hair etc", "Draft tube prevents cold spots along the zipper. Made of 3 separate baffles to hinder down shift within the tube. Includes anti snag panel", "The generous 3-D draft collar with elastic cord closure is simple to use, does not feel tight when used and can be opened easily when necessary", "Easy to handle flat cord lock", "Intuitive and ergonomically placed hood closure system for easy handling and accurate closure", "Hidden within the hood to prevent pressure on forehead and nose by the cords. Differing caps on upper and lower cord improve handling in the dark", "Side loops at foot end and center allow the sleeping bag to be secured during airing and drying. These can also be used to attach the sleeping bag to a mat using cords", "Bartack reinforcements where necessary for enhanced durability", "Zipper pullers feature glow-in-the-dark tabs", "Two-way zippers increase flexibility and allow the bag to be opened at the foot-end for temperature regulation", "Stay warm while using your arm. Close the snap button, open the self-locking zipper and slip your arm through the gap. The hood stays in place and keeps you cozy"]}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/EXP-71994673_7ENo_20Color.jpg?v=1617432221"]}