{"manufacturer": "GoPro", "name": "Karma Grip for HERO6 Black/HERO5 Black", "price": "399.99", "category_hierarchy": ["Gear", "Gear/Electronics", "Gear/Electronics/Camcorders &amp; Accessories"], "sku": "gpr-agimb-004", "uid": "72377958421", "review_score": "0", "review_total": "0", "url": "https://www.altitude-sports.com/products/gopro-karma-grip-for-hero6-black-hero5-black-llll-gpr-agimb-004", "tech_specs": {"features": ["Capture stabilized footage so smooth your ordinary shots will look extraordinary. Enjoy professional, cinema-quality video whether you’re hiking, biking or chasing your kids through the park. Compatible with most GoPro mounts, Karma Grip captures the amazing handheld, gear-mounted and body-worn perspectives only a GoPro can—now with pro-quality stabilization. Simple built-in camera controls let you power on and off, change modes, start and stop recording, and add HiLight Tags on the fly.1 Capture incredible … Karma Grip.", "Capture amazingly smooth shake-free video", "Compatible with most GoPro mounts", "Karma Drone compatible", "Built-in camera controls1", "Use with the optional Karma Grip Extension Cable2", "Offload footage without un-mounting your camera1", "Extra-long 1 hour and 45 minute battery life", "Charge your GoPro and Karma Grip at the same time1", "Recharge up to 70% faster3 using the optional GoPro Supercharger (International Dual-Port Charger)", "1 HERO5 Black, HERO5 Session, HERO4 Black and HERO4 Silver only. Camera control, camera charging and content offload are not supported for HERO Session.", "2 Coming early 2017.", "3 Compared to conventional 5V 1.5A chargers. Charging performance may vary based on charging conditions.", "Note: HERO5 Session, HERO4 Black, HERO4 Silver, and HERO Session require a camera-specific Karma Harness, sold separately.\n                            \n                    \n                \n                \n                \n\n\n\n\n    \n\n\n", "\n"]}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/GPR-AGIMB-004_7EBlack.jpg?v=1512555749"]}