{"manufacturer": "Polar", "name": "Vantage V2 HR Multisport Smartwatch", "price": "799.99", "category_hierarchy": ["Gear", "Gear/Watches &amp; Wristwear", "Gear/Watches &amp; Wristwear/GPS", "Gear/Watches &amp; Wristwear/Smart"], "sku": "plr-90082711", "uid": "6630897189048", "review_score": "0", "review_total": "0", "url": "https://www.altitude-sports.com/products/polar-vantage-v2-hr-multisport-smartwatch-llll-plr-90082711", "tech_specs": {"features": ["Advanced wrist-based heart rate: Polar Vantage V2 tracks heart rate with the Precision Prime™ sensor fusion technology", "Ultra-long Battery Life: Polar Vantage V2 gives you even up to 40 hours of continuous training time. The multiple power save options boost the battery life all the way up to 100 hours", "Integrated GPS: GPS, Glonass, Galileo and QZSS with assisted GPS for fast fix times. Integrated compass and barometric altitude", "Color Touch Display: 1.2” always-on sunlight-readable color touch display. Laminated Gorilla glass lens with anti-fingerprint coating", "Running Performance Test: The Running Performance Test helps you keep track of your progress and personalize your heart rate, speed and power zones", "Cycling Performance Test: The Cycling Performance Test allows you to personalize your power zones and tells you your personal functional threshold power. A power meter required", "Training Load Pro™: Training Load Pro™ helps you see how much you’ve been training lately and how your training sessions strain the different parts of your body", "Recovery Pro™: Recovery Pro™ tells you whether your body is ready for training and offers you recovery feedback right on your watch. A Polar heart rate sensor required", "Leg Recovery Test: The Leg Recovery Test tells you whether your legs are ready for high intensity training in just a couple of minutes without any specialist equipment-all you need is your watch", "Nightly Recharge™: The Nightly Recharge™ recovery measurement shows you how well you recover from the demands of your day during the night", "Route planning with Komoot: Plan your route on Komoot, import it to your Polar Vantage V2 and let the turn-by-turn guidance take care of navigation for you", "Music controls and other smartwatch features: Easily navigate around your playlist and adjust volume straight on your watch. You also get a weather forecast and push notifications to your watch screen", "Running Power: Get more comprehensive insight into the intensity of your running sessions", "Sleep Plus Stages™: Follow your sleep stages and get insights to your sleep quality", "FuelWise™ smart fueling assistant: Learn to refuel and maintain adequate energy levels during your long sessions", "Hill Splitter™: Hill Splitter™ offers you detailed data about your performance on the uphill and downhill sections of your session", "FitSpark™ training guide: Polar Vantage V2 and the FitSpark™ training guide offer you ready-made daily workouts that match your recovery, fitness level and training history", "Strava Live Segments: Make your runs and rides more exciting with Strava Live Segments. Get alerts about nearby segments, see real-time performance data during a segment and check your results right after you finish", "Free Running Programs: Get a personal and adaptive training plan that fits you and your goals", "Sport profiles: Polar Vantage V2 supports over 130 different sports. Add your favorite sports to your watch in Polar Flow and customize what you see on your watch during each sport", "Energy Sources: See how your body uses different energy sources during a training session. Polar Vantage V2 divides your energy usage into carbs, proteins and fats", "Swimming metrics: Polar Vantage V2 automatically detects your heart rate, swimming style, distance, pace, strokes and rest times. Distance and strokes get tracked also in open water swimming", "Serene™ breathing exercise: Relax your body and calm down your mind with the help of a guided breathing exercise", "Running Index: Get an estimate of your running VO2max and see how your running performance is developing"]}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/PLR-90082711_7EGreen.jpg?v=1618729649"]}