{"manufacturer": "Polar", "name": "M430 GPS Running Watch", "price": "279.99", "category_hierarchy": ["Gear", "Gear/Watches &amp; Wristwear", "Gear/Watches &amp; Wristwear/Fitness Trackers &amp; Heart Rate Monitors", "Gear/Watches &amp; Wristwear/GPS", "Gear/Watches &amp; Wristwear/Running &amp; Training"], "sku": "plr-90066337", "uid": "6630895878328", "review_score": "0", "review_total": "0", "url": "https://www.altitude-sports.com/products/polar-m430-gps-running-watch-llll-plr-90066337", "tech_specs": {"features": ["Running Program: Train for a running event with a personal and adaptive training plan in Polar Flow. Choose from four different targets, 5K, 10K, half marathon and marathon, and get a training plan that fits you and your goals", "Running Index: See how your running performance develops", "Fitness Test with wrist-based heart rate: A five-minute test that measures aerobic fitness from your resting heart rate, heart rate variability and your background information. Complete the test regularly to see the progress you’re making", "Training Benefit: Get motivating feedback immediately after training, describing the effect of the session", "Training Load: See how your training affects your body and compare the load of different sessions. Monitor your load continuously to recognize your personal limits and adjust training intensity and duration accordingly. Available on Polar Flow", "Recovery Status: See how long you’ll need to recover before your next training session. Available on Polar Flow", "Continuous Heart Rate: Get a comprehensive view on how your heart behaves during your day with 24/7 heart rate monitoring", "Activity Guide: See how active you’ve been during the day and get practical guidance for reaching your daily activity goal", "Activity Benefit: Get feedback on your daily, weekly and monthly activity. See how your active choices help you stay healthy", "Smart Calories: Keep track of the calories you’ve burned. You’ll be able to see the calories burned during each training session and for the whole day. The continuous heart rate measurement combined with 24/7 activity tracking make sure your calorie burn is measured accurately and reliably", "Sleep Plus: Sleeping well will help boost your recovery and performance. Polar Sleep Plus™ automatically detects the timing, amount, and quality of your sleep. You'll also receive feedback on your sleep so that you can make changes towards better sleep"]}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/PLR-90066337_7EBlack.jpg?v=1618729639"]}