{"manufacturer": "Peak Design", "name": "Everyday Backpack V2 30L", "price": "374.95", "category_hierarchy": ["Gear", "Gear/Packs &amp; Bags", "Gear/Packs &amp; Bags/Daypacks &amp; Backpacks", "Gear/Packs &amp; Bags/Laptop Bags &amp; Sleeves", "Gear/Packs &amp; Bags/School Bags &amp; Urban Backpacks"], "sku": "pkd-bedb-30", "uid": "4436289093735", "review_score": "5", "review_total": "1", "url": "https://www.altitude-sports.com/products/peak-design-everyday-backpack-v2-30l-llll-pkd-bedb-30", "tech_specs": {"features": ["Aesthetic improvements via cleaner seams and more rounded profile", "More internal pockets in top and sides of bag for increased organization", "Increased laptop, tablet, and document capacity - 20L now fits up to 15” laptops", "Adjustable height laptop sleeve", "New UltraZip external zippers, vastly more durable than conventional zips", "New external carry straps with improved Cord Hook connectors and more tie-down points", "New outer fabric is 100% recycled and Bluesign certified (all colors except Black)", "Updated MagLatch hardware - more ergonomic and sleek", "Widened top and side access points", "More volume in external side pockets for water bottles, tripods, etc.", "Revamped shoulder straps for increased comfort + magnetic strap holds", "HIPBELT ACCESSORY COMING SOON: A padded, stowable hipbelt accessory will soon be available for purchase for those who want added stability and comfort with heavy loads.", "INSTANT ACCESS", "Fast, secure, one-handed top access via MagLatch hardware", "Dual side access via #8 weatherproof zips", "Extra-durable UltraZip design", "EXPANDABLE: MagLatch hardware provides internal expansion. +3L on the 20L bag, +8L on the 30L bag", "CUSTOM ORGANIZATION: Brilliantly customizable and protective internal organization via 3 easy-to-configure FlexFold dividers", "POCKETS FOR DAYS", "Stretchy internal side and top pockets for cards, cords, and more", "Internal slip pockets for wallet, passport, and other important items", "Dual external side pockets stretch to fit water bottles, tripods, etc", "LAPTOP SLEEVE:", "Protective 15” laptop sleeve with pockets for tablets and documents", "Adjustable for easy access to smaller laptops", "EXTERNAL CARRY", "4 external carry straps for cinching down bulky items via our Cord Hook system", "Straps stow beneath a magnetic sleeve", "Quick-connecting, stowable sternum strap", "ULTIMATE COMFORT", "Vented, quick-drying mesh back padding for breathable comfort", "Shoulder straps pivot at axial points to optimize comfort with all body types", "Quick-connecting, stowable sternum strap", "TRAVEL-FRIENDLY:", "Luggage pass-through for easy and secure roller-top carry", "3 padded grab handles for upright or briefcase style hand carry", "Padded, stowable waist belt available (sold separately)", "DURABLE & WEATHERPROOF: Weatherproof, 100% recycled 400D nylon canvas shell is DWR impregnated, double PU-coated, and Bluesign certified (all colors except Black)\""]}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/PKD-BEDB-30_7ECharcoal.jpg?v=1604996128"]}