{"manufacturer": "Polar", "name": "Ignite Smartwatch", "price": "339.99", "category_hierarchy": ["Gear", "Gear/Watches &amp; Wristwear", "Gear/Watches &amp; Wristwear/GPS", "Gear/Watches &amp; Wristwear/Smart"], "sku": "plr-90071063", "uid": "6630896238776", "review_score": "5", "review_total": "1", "url": "https://www.altitude-sports.com/products/polar-ignite-smartwatch-llll-plr-90071063", "tech_specs": {"features": ["Integrated GPS: Track your speed, distance, route and altitude", "Advanced wrist-based heart rate: Polar Ignite tracks heart rate with the Precision Prime™ sensor fusion technology", "Nightly Recharge™: See how well you recover from your day during the night", "FitSpark™ daily training guide: Get ready-made daily workouts that match your recovery, readiness and training history", "Sleep Plus Stages™: Follow your sleep stages and get insights to your sleep quality", "Serene™ breathing exercise: Relax your body and calm down your mind with the help of a guided breathing exercise", "Phone notifications: Stay connected with notifications from your phone. Get alerts for incoming calls, messages, emails, calendar events and more", "Swimming metrics: Follow your progress in the pool-Polar Ignite automatically detects your heart rate, swimming style, distance, pace, strokes and rest times", "Sport profiles: Polar Ignite supports over 100 different sports. Add your favorite sports to your watch in Polar Flow", "Works with Polar Club: If your gym uses the Polar Club group heart rate system, you can use Polar Ignite to display your heart rate on the screen", "Smart Calories: Know exactly how many calories you’ve burned based on your weight, height, age, gender, your individual maximum heart rate(HR max)and how hard you’re training", "Continuous Heart Rate: Get a comprehensive view on how your heart behaves during your day. Continuous heart rate monitoring gives you even more accurate calorie burn and activity data and tells you the lowest and highest heart rate of your day", "Activity guide: Stay on the move every day. Polar Ignite gives you a personalized daily activity goal that motivates you to keep moving throughout the day. You’ll see how active you’ve been, and Polar Flow gives you practical tips on how to reach that 100%", "Fitness Test: Test your fitness level easily in just 5 minutes without breaking a sweat", "Running Index: Get an estimate of your running VO2max and see how your running performance is developing", "Running Program: Get a personal and adaptive training plan that fits you and your goals", "Training Benefit: Get motivating feedback immediately after training describing the effect of the session", "Training Load Pro: Quantify the strain of your training session and see how your training strains your body"]}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/PLR-90071063_7EWhite_20-_20Silver.jpg?v=1618729643"]}