{"manufacturer": "Polar", "name": "Unite Smartwatch", "price": "219.99", "category_hierarchy": ["Gear", "Gear/Watches &amp; Wristwear", "Gear/Watches &amp; Wristwear/GPS"], "sku": "plr-90081801", "uid": "6630896763064", "review_score": "0", "review_total": "0", "url": "https://www.altitude-sports.com/products/polar-unite-smartwatch-llll-plr-90081801", "tech_specs": {"features": ["Advanced wrist-based heart rate: Polar Unite tracks heart rate with the Precision Prime™ sensor fusion technology", "Sport profiles: Polar Unite supports over 100 different sports. Add your favorite sports to your watch in Polar Flow", "Nightly Recharge™: See how well you recover from your day during the night", "FitSpark™ daily training guide: Get ready-made daily workouts that match your recovery, readiness and training history", "Sleep Plus Stages™: Follow your sleep stages and get insights to your sleep quality", "Serene™ breathing exercise: Relax your body and calm down your mind with the help of a guided breathing exercise", "Connected GPS: Connect to your mobile phone to track your speed, distance and route", "Phone notifications: Stay connected with notifications from your phone. Get alerts for incoming calls, messages, emails, calendar events and more", "Watch face color themes: Choose the color of your watch face from multiple options and match with your wristband", "Continuous Heart Rate: Get a comprehensive view on how your heart behaves during your day. Continuous heart rate monitoring gives you even more accurate calorie burn and activity data and tells you the lowest and highest heart rate of your day", "Smart Calories: Know exactly how many calories you’ve burned based on your weight, height, age, gender, your individual maximum heart rate(HR max)and how hard you’re training", "Training Benefit: Get motivating feedback immediately after training describing the effect of the session", "Fitness Test: Test your fitness level easily in just 5 minutes without breaking a sweat", "Works with Polar Club: If your gym uses the Polar Club group heart rate system, you can use Polar Unite to display your heart rate on the screen", "Running Program: Get a personal and adaptive training plan that fits you and your goals"]}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/PLR-90081801_7EBlue.jpg?v=1618729648"]}