{"manufacturer": "Peak Design", "name": "Everyday Sling 10L", "price": "199.95", "category_hierarchy": ["Gear", "Gear/Packs &amp; Bags", "Gear/Packs &amp; Bags/Luggage &amp; Carry-On", "Gear/Packs &amp; Bags/Waistpacks"], "sku": "pkd-bsl-10", "uid": "2138069401703", "review_score": "4.875", "review_total": "8", "url": "https://www.altitude-sports.com/products/peak-design-everyday-sling-10l-llll-pkd-bsl-10", "tech_specs": {"features": ["FAST, LIGHT, AND DAMN GOOD LOOKING: Whether you’re a beginning photographer, a pro who just needs to carry essentials, or just somebody who prefers to pack light, the Everyday Sling is the ultimate minimalist on-the-go bag.", "INTELLIGENT INTERNAL ORGANIZATION", "FLEXFOLD™ DIVIDERS: 2 FlexFold Dividers allow for endless internal configuration, compartmentalizing, and gear stacking. Completely customize the inside of your sling to perfectly meet your carry needs.", "EXTERNAL CARRY STRAPS: External utility straps for tripod, umbrella, yoga mat, or other larger items.", "TABLET SLEEVE: Dedicated, protected tablet sleeve holds up to 11” tablets, and even some small laptops. See SPECS tab for max laptop dimensions.", "POCKETS GALORE: A network of small internal pockets organize and protect all your little stuff.", "DRONE CARRY: Perfectly sized to fit the DJI Mavic and DJI Spark, with controller and accessories, and give you plenty of room to spare.", "UNIQUE EXPANDING DESIGN", "EXPANDABLE SECONDARY COMPARTMENT: A hugely expandable secondary compartment holds jackets, snacks, and other everyday carry. When not in use, it cinches flat, with no baggy or loose fabric.", "PACKS FLAT: When the sling is empty, the two compression straps can cinch the bag flat so you can easily fit it in a suitcase.", "TRAVEL-READY", "CARRY-ON APPROVED: Approved for carry-on by all major airlines. Fits easily under airplane seats.", "LOVES YOUR LUGGAGE: A dual purpose briefcase and rolling luggage carry strap ensures you’ll always have an easy way to transport the sling.", "UNRIVALED ACCESSIBILITY", "LIGHTNING FAST STRAP: The sling’s strap features a quick adjuster handle that lets you loosen the strap and swivel the bag in front of you in one easy motion.", "DEDICATED CAPTURE ATTACHMENT: An external attachment point for the Capture Clip (sold separately) lets you rigidly carry your camera on the outside of your sling for instant access.", "BUILT TO PROTECT", "WEATHERPROOF SHELL: Weatherproof 400D nylon canvas shell with high-density padding is DWR impregnated and poly-coated twice on both sides. Premium weatherproof exterior zippers.", "PREMIUM MATERIALS & BUILD: Hypalon-reinforced and bar-tacked stress points. Soft, durable mixed-cotton twill interior for protection, durability and a luxurious feel. The Ash Sling replaces Hypalon touchpoints with natural NuBuck leather. All-custom anodized aluminum hardware."]}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/PKD-BSL-10_7EBlack.jpg?v=1608620480"]}