{"manufacturer": "Tacx", "name": "NEO 2T Smart Trainer", "price": "1999.99", "category_hierarchy": ["Gear", "Gear/Bike Accessories", "Gear/Bike Accessories/Training Bases"], "sku": "tcx-891029", "uid": "4738863759463", "review_score": "0", "review_total": "0", "url": "https://www.altitude-sports.com/products/tacx-neo-2t-smart-trainer-llll-tcx-891029", "tech_specs": {"features": ["Silent", "By redesigning the magnets, we significantly improved the stillness of the NEO 2T. The noise coming from internal air displacements is reduced as well as vibrations noticed at a low cadence, that were being transferred to the floor. Resulting in a more silent Smart trainer than ever thought possible. ", "Sprints", "Powerful climbs and sprints. The new motor of the NEO 2T improves the ride feel during a climb or acceleration. We were able to give the motor of the NEO 2T more power, resulting in the ability to generate higher resistance levels under specific conditions, like a sprint or at low speeds. ", "Pedal Stroke Analysis", "The NEO 2 was already equipped with a capacitive left and right detection sensor that accurately measures the exact position of both your legs. By adding standard ANT+ Cycling dynamics, you can now analyze your pedal stroke via the software of third parties.", "Accurate ", "The Tacx NEO 2T Smart measures your power with incredible precision, making sure that your data is accurate and reliable. This Smart trainer is the only trainer that doesn’t require calibration process. This Smart trainer measures your power accurately within 1%.", "Smooth Ride Feel", "The NEO 2T Smart is very responsive and reacts instantly to speed or incline changes. It also features Dynamic inertia which compensates for weight, speed and angle of inclination to ensure the most realistic and smooth ride feel possible. ", "Connection Indicators", "Intuitive LED lights indicate if you’re connected and powered.", "Foldable", "A foldable frame for easy transport and storage.", "Road Feel", "Feel the vibrating sensation of riding over cobble stones and gravel.", "Descent Simulation", "At the top of a hill or a mountain, there is always that exciting feeling of acceleration into a descent. Exactly that feeling is what this bike trainer gives you. The NEO 2T Smart accelerates in a descent. ", "Compatible with many Axles", "The rear axle of the NEO 2T Smart is redesigned in order to make it compatible with more bikes, without the need for adapters. It is directly compatible with all bikes, only for 135 x 10 and 135 x 12, you’ll need an additional adapter.", "Flexible", "The design of the NEO 2T Smart allows a few degrees of movement to the left and right while cycling. Its frame follows the natural course of your body, bringing you a certain freedom of movement that improves the cycling feeling. ", "Self Powered", "No mains power required. The NEO 2T Smart doesn’t require an external power source as it generates its own energy from your cycling movement. This direct drive trainer can easily be used anywhere you like. When connected to an external power source, the Descent simulation feature is enabled. "]}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/TCX-891029_7ENo_20Color.jpg?v=1621493478"]}