{"manufacturer": "Anon", "name": "Merak Wavecel Helmet - Unisex", "price": "379.99", "category_hierarchy": ["Gear", "Gear/Helmets", "Gear/Helmets/Ski &amp; Snowboard"], "sku": "ann-22733100", "uid": "6132486242488", "review_score": "5", "review_total": "1", "url": "https://www.altitude-sports.com/products/anon-merak-wavecel-helmet-unisex-llll-ann-22733100", "tech_specs": {"features": ["Weight: 480g", "WaveCel® behaves like a network of hundreds of interconnected shock absorbers connecting your head and the outer shell of the helmet. WaveCel® helps distribute the impact energy through its network of cells, reduces impact forces like the crumple zone of a car, and then helps divert rotational forces by flexing and gliding", "50/50 hybrid shell construction combines Endura®-shell and in-mold shell constructions for wear-and-tear resistant durability and featherweight performance", "Active ventilation with 8 vents, a total of 19 to let you easily fine-tune your temperature with open settings for maximum airflow, closed settings for locking in heat, and everything in between", "In-shell 360° BOA® Fit System features a fit dial just below the helmet shell that provides micro adjustments in a complete halo around the wearer's head", "Fidlock® snap helmet buckle uses magnets to allow you to open and close the buckle with one hand even when wearing gloves", "Polartec® Power Grid fleece on liner and ear pads is low pile, pill resistant, and moisture-wicking for maximum warmth", "Certification: CE 1077B & ASTM 2040", "Compatible with audio accessories", "Anon Warranty All Anon products are backed by a 1-year warranty from date of purchase. Anon helmets are also backed by a 2-year crash replacement policy.\n                            \n                    \n                \n                \n                \n\n\n\n\n    \n\n    \n\n    \n\n    \n\n    \n\n    \n\n    \n\n    \n\n    \n\n    \n\n    \n\n\n", "\n"]}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/ANN-22733100_7EBlush.jpg?v=1610787296"]}