{"manufacturer": "Big Agnes", "name": "Battle Mountain 3 Tent", "price": "1199.95", "category_hierarchy": ["Gear", "Gear/Tents &amp; Shelters", "Gear/Tents &amp; Shelters/3-Season Tents"], "sku": "bag-tmbm319", "uid": "6646872244408", "review_score": "0", "review_total": "0", "url": "https://www.altitude-sports.com/products/big-agnes-battle-mountain-3-tent-llll-bag-tmbm319", "tech_specs": {"features": ["Lightweight mountaineering shelter built with bomber basecamp materials made to withstand the most rugged of high-alpine adventures", "The golden yellow color of the Battle Mountain was requested by Chhiring Dorje Sherpa to honor the Tibetan Buddhism goddess of prosperity and good fortune, Miyo Losangma. She inhabits Mount Everest and is generous to those who show her gratitude. Her skin is golden yellow, so when Chhiring sets up this tents they will stand out as a tribute to her", "Durable polyester high-tenacity ripstop with exceptional tear strength, UV resistance, and stability during temperature and moisture fluctuations – making it ideal for high-altitude conditions", "Features two doors and two vestibules", "Two dual-zipper doors featuring windows with two closure options: mesh only for ventilation, or zip up the nylon layer for complete closure", "Featuring two vestibule-door options; one single-zip door, and one double-zip door designed to be set up as an awning using trekking poles", "Storm flaps on vestibule zipper", "Color-coded webbing and poles make set up easy", "DAC oversized twist clips easily attach to pole system even when wearing gloves", "High/low internal guy loops for extra stability in high winds", "Two fly vents for increased airflow and reduced condensation; fully closable in extreme weather", "Oversized 3-D bin pockets provide ample storage without encroaching on your livable space", "Velcro tabs connect fly to pole structure providing perfect pitch and extra stability", "Ready to pitch; with pre-cut guylines and tensioners attached to fly", "Heavy duty reflective guylines and reflective webbing", "To extend the life of your tent floor we recommend using a Big Agnes footprint - sold separately", "Multiple interior loops for attaching accessories and mtnGLO® Tent & Camp Lights."]}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/BAG-TMBM319_7EGold.jpg?v=1619681910"]}