{"manufacturer": "Canada Goose", "name": "Elmwood Parka - Women's", "price": "1295", "category_hierarchy": ["Women", "Women/Jackets &amp; Vests", "Women/Jackets &amp; Vests/Down Coats &amp; Vests", "Women/Jackets &amp; Vests/Insulated Coats &amp; Vests", "Women/Jackets &amp; Vests/Parkas", "Women/Jackets &amp; Vests/Urban Coats &amp; Vests", "Women/Jackets &amp; Vests/Winter Coats"], "sku": "cgo-3815l", "uid": "3988416036967", "review_score": "4.4286", "review_total": "5", "url": "https://www.altitude-sports.com/products/canada-goose-elmwood-parka-womens-llll-cgo-3815l", "tech_specs": {"features": ["LENGTH: Mid-calf", "ORIGIN: Made in Canada", "2-way adjustable down-filled hood adds warmth and element protection. Reflective webbing along the back adds visibility in low light. Brim has a shaping wire to stand up to harsh winds", "Interior backpack straps allow jacket to be carried hands-free over the shoulders", "Articulated sleeves and underarm gussets enhance fit and add range of motion", "Recessed rib-knit cuffs with thumbhole construction add comfort and lock in heat. Outer cuffs feature reflective detailing that can be hidden with single button adjustment when not needed", "Side vents with snap closures add range of motion when opened up", "Placket with webbing pull tabs and hidden snap closures over 2-way zipper keeps the elements out. Unzip from the bottom for added range of motion or venting", "4 exterior pockets: 2 sets of double-stacked fleece-lined hand warmer pockets with 2-way zipper closures for ease of access", "5 interior pockets: drop-in pocket, 2 mesh pockets designed to fit kidney warmers, 2 mesh drop-in pockets with snap closures", "FILL: 625 Fill Power White Duck Down", "Arctic Tech Extreme conditions: Our most proven textile designed to stay dry in extreme conditions and climates.", "Thermal Experience Index Rating: 4 (-15°C / -25°C)", "The Thermal Experience Index(TEI): Canada Goose' five-point system is designed to help you make the right selection from their expansive collections of Winter Apparel.", " Fit : Slim\n                            \n                    \n                \n                \n                \n\n\n\n\n    \n\n    \n\n    \n\n    \n\n    \n\n    \n\n    \n\n    \n\n    \n\n\n", "\n"]}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/CGO-3815L_7EBordeaux.jpg?v=1601188568"]}