{"manufacturer": "Canada Goose", "name": "Westmount Parka - Men's", "price": "1495", "category_hierarchy": ["Men", "Men/Jackets &amp; Vests", "Men/Jackets &amp; Vests/Down Coats &amp; Vests", "Men/Jackets &amp; Vests/Insulated Coats &amp; Vests", "Men/Jackets &amp; Vests/Parkas", "Men/Jackets &amp; Vests/Winter Coats"], "sku": "cgo-2004m", "uid": "6090937303224", "review_score": "0", "review_total": "0", "url": "https://www.altitude-sports.com/products/canada-goose-westmount-parka-mens-llll-cgo-2004m", "tech_specs": {"features": ["Removable down-filled hood is adjustable 2-ways and adds warmth and element protection. Reflective webbing along the back adds visibility in low light. Brim has a shaping wire and a removable fur ruff to stand up to harsh winds. Snaps allow brim to be secured back away from face for added visibility", "Interior down-filled collar provides essential warmth and insulation while sealing out cold winds and adding softness next-to-skin", "360° Reflectivity: Reflective webbing along the back of the hood adds visibility in low light. Outer cuffs feature reflective detailing that can be hidden with single button adjustment when not needed", "Interior backpack straps allow jacket to be carried hands-free over the shoulders", "Waist features interior drawcord to customize fit and retain warmth", "Chin guard is lined with tricot fabric for added softness and comfort", "Recessed rib-knit cuffs add comfort and lock in heat", "Articulated sleeves and underarm gussets enhance fit and add range of motion", "Webbing grab strap at upper back with 'Canada Goose' emblem patch", "Placket with hidden snap closures over 2-way zipper keeps the elements out. Unzip from the bottom for added range of motion or venting", "5 exterior pockets: 2 chest pockets with hidden snap closures, 2 tricot-lined chest pockets with hidden zipper closures, 2 fleece-lined hand warmer pockets with hidden snap closures, 1 utility pocket on left sleeve", "5 interior pockets: 1 drop-pocket, 2 mesh pockets designed to fit kidney warmers, 2 mesh drop-in pockets with snap tab closures", "Regular Fit", "Knee Length"]}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/CGO-2004M_7EGraphite.jpg?v=1606376120"]}