{"manufacturer": "Canada Goose", "name": "Salida Print Jacket - Women's", "price": "750", "category_hierarchy": ["Women", "Women/Jackets &amp; Vests", "Women/Jackets &amp; Vests/Insulated Coats &amp; Vests", "Women/Jackets &amp; Vests/Urban Coats &amp; Vests", "Women/Jackets &amp; Vests/Winter Coats"], "sku": "cgo-5608lp", "uid": "4475542175847", "review_score": "5", "review_total": "1", "url": "https://www.altitude-sports.com/products/canada-goose-salida-print-jacket-womens-llll-cgo-5608lp", "tech_specs": {"features": ["FIT: Slim", "LENGTH: Mid-thigh", "ORIGIN: Made in Portugal", "Fully seam-sealed construction keeps rain out", "Jacket is lightweight enough to roll up and easily stow into hood. Once stowed away, cinch drawcord to pack down even further for easy travel", "Hood has single adjustment point at back that cinches two ways at once. Extended brim construction with a head skirt underneath allows the hood to move with you and stay out of your line of sight. Signature double-stripe reflective details at brim and back add low light visibility", "Mesh venting underneath the back panel adds breathability and air flow while keeping rain out", "Articulated sleeves and underarm gussets enhance fit and add range of motion", "Scalloped cuffs provide extra coverage and adjust with hook-and-loop closures to seal out rain. Edges are reflective for added visibility in low light", "Fishtail hem with gusset adds coverage and protection while allowing for range of motion and features signature double-stripe reflective details at the sides", "Placket with hidden snap closures over 2-way zipper keeps the elements out. Unzip from the bottom for added range of motion and venting. Storm flap has reflective details and laser cut perforations at the top for added air flow", "2 exterior pockets: mesh-lined pockets with top flap and zipper closures", "1 interior pocket: mesh-lined secure zipper pocket", "Tri-Durance(Waterproof, Windproof & Breathable): This 3-layer fabric provides excellent protection from downpours and harsh winds. Built-in breathability keeps you dry and comfortable, while added stretch allows for range of motion during active pursuits.", "Whether you're working up a sweat hiking trails, embarking on an urban adventure, or exploring the coldest places on Earth, we've developed the Thermal Experience Index (TEI) to help you find the right Canada Goose jacket for your body, your activities, and lifestyle.", "TEI1: 5°C / -5°C\n                            \n                    \n                \n                \n                \n\n\n\n\n    \n\n\n", "\n"]}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/CGO-5608LP_7EPrint_20Camo.jpg?v=1604727201"]}