{"manufacturer": "Giro", "name": " Radix MIPS Helmet - Men's", "price": "129.99", "category_hierarchy": ["Gear", "Gear/Helmets", "Gear/Helmets/Bike", "Gear/Helmets/MIPS"], "sku": "gio-25525-radix-mips", "uid": "4559550185575", "review_score": "4.6667", "review_total": "9", "url": "https://www.altitude-sports.com/products/giro-radix-mips-helmet-mens-llll-gio-25525-radix-mips", "tech_specs": {"features": ["Integrated MIPS®: All Giro helmets are designed to reduce as much energy as possible while meeting and exceeding stringent safety standards. The goal of Giro's Integrated MIPS-equipped helmets is to reduce rotational forces. Giro believes that helmets equipped with this technology can reduce the amount of rotational force that may be transferred to rider's brain in certain impacts.", "Hardwell with in-mold Hardbody® lower wrap: The two-piece shell combines a tough outer hard shell with a polycarbonate lower shell permanently fused to the liner for durability without excess weight.", "P.O.V. Visor: Our P.O.V. visor features an adjustment mechanism that lets you move the visor up and down in indexed steps. These steps include three riding positions plus a high position for goggle storage above your brow. The design allows you to easily adjust your visor with one hand while riding.", "Roc Loc® 5 Fit System: The industry benchmark in comfort, stability, adjustability and weight savings. In addition to enhancing the fit and comfort of helmets, Roc Loc® 5 allows you to easily custom tune the fit tension and the fore-aft tilt of the helmet in seconds using a single hand. And it's lighter than comparable systems too, making it the ultimate in skull-hugging luxury.", "Wind Tunnel Ventilation: Giro helmets are developed utilizing our proprietary Wind Tunnel ventilation system. This elaborate design combines active vents in the helmet's shell with exhaust channels inside the helmet that thrust fresh, cool air over and around the rider's head while forcing heat and stale air out. It's the most effective cooling system available, and a difference you can feel every time you ride."]}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/GIO-25525-RADIX-MIPS_7EMatte_20Chalk.jpg?v=1623140571"]}