{"manufacturer": "Leatherman", "name": "Charge Plus Nylon Sheath - Box", "price": "185.95", "category_hierarchy": ["Gear", "Gear/Knives &amp; Tools", "Gear/Knives &amp; Tools/Multi-Tools"], "sku": "ltm-832516", "uid": "1421128400999", "review_score": "4.8", "review_total": "5", "url": "https://www.altitude-sports.com/products/leatherman-charge-plus-nylon-sheath-box-llll-ltm-832516", "tech_specs": {"features": ["All Locking Features : All locking features means that every tool and knife on the body of the handle, with the exception of the plier head, will lock into place. Note that the Crunch; however, does feature both all locking tools and plier head. The all locking design enables the user to operate individual tools safely and effectively. By locking them into place when fully open, the user can put pressure on the implement while safely completing the job, before manually unlocking the tool to stow it away.", "Lanyard Ring: This secure ring is for attaching the tool safely and securely to a lanyard. Often people who work near water or on scaffolding attach their tool to a lanyard on their person to avoid losing the tool if it's dropped.", "Replaceable Pocket Clip & Quick-release Lanyard Ring: An accessory set that includes a removable clip, which allows the user to wear their multi-tool attached to a pocket or belt loop, and a removable quick-release lanyard ring, which allows for attachment to a lanyard. Often people who work near water or on scaffolding attach their tool to a lanyard on their person to avoid losing the tool if it's dropped.", "Two Large Bit Drivers: Two separate stainless steel tools that each hold a Leatherman tool bit in place during use and allow the user to customize bit selection for every activity.", "Outside-accessible Features: This multi-tool features tools that are accessible while the tool is in its folded or closed position, mimicking the functionality of a pocket knife.", "One-hand Operable Features: Every feature on this tool can be opened and operated with one hand. This enables the user to keep the other hand free for situations that require multi-tasking or a free hand."]}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/LTM-832516_7EStainless_20-_20Nylon_20Black.jpg?v=1622189288"]}