{"manufacturer": "Spy", "name": "Marauder Goggle - Viper Purple Frame - Happy Bronze with Green Spectra Mirror - Happy LL Persimmon", "price": "229.99", "category_hierarchy": null, "sku": "spp-3100000000136", "uid": "6755445113016", "review_score": "0", "review_total": "0", "url": "https://www.altitude-sports.com/products/spy-marauder-goggle-viper-purple-frame-happy-bronze-with-green-spectra-mirror-happy-ll-persimmon-llll-spp-3100000000136", "tech_specs": {"features": ["\n", "Our patented Happy™ Lens Tech enhances color and contrast and is scientifically tuned to boost mood and alertness, providing a visual experience unlike anything else\n", "Anti-fog injected SIC™ (Superior Injected Curve) dual-lens maintains lens shape for optical clarity\n", "Deadbolt’s magnets securely guide the lens into place while the locking levers bolt it down. It’s a ride so secure you can plunder pow in peace\n", "Comes with a free premium bonus lens so you’re covered in any light conditions\n", "Anti-scratch coating provides enhanced impact protection\n", "100% UV protection shields your eyes against damaging high-altitude sunlight\n", "Custom built from flexible, durable polyurethane for seasons of use\n", "RISE™ ventilation system utilizes the Venturi effect to draw air through subframe vents above the goggle, creating a vacuum that pulls hot air from behind the lens\n", "Triple-layer Isotron™ face foam with moisture-wicking Dri-Force™ fleece provides comfort while drawing fog-causing sweat off your face\n", "Subtle notches in temples allow for seamless OTG (over the glasses) integration with RX eyeglasses\n", "Compatible with the most popular helmets on the planet\n", "Silicone-lined XL (45mm) strap prevents the goggle from slipping on your helmet or headwear.\n"], "• Frame Color ": " Matte Black\n", "• Lens Color ": " HD Plus Rose with Dark Blue Spectra Mirror - HD Plus LL Light Gray Green with Red Spectra Mirror.\n                            \n                    \n                \n                \n                \n\n\n\n\n    \n\n\n"}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/SPP-3100000000136_7ENo_20Color_f7a8937e-226c-4b7f-8530-0291b9ff06cb.jpg?v=1625558183"]}