{"manufacturer": "Thule", "name": "Urban Glide 2", "price": "599.95", "category_hierarchy": ["Gear", "Gear/Child Carriers &amp; Strollers", "Gear/Child Carriers &amp; Strollers/City Strollers"], "sku": "thu-10101924", "uid": "2126465171559", "review_score": "5", "review_total": "14", "url": "https://www.altitude-sports.com/products/thule-urban-glide-2-llll-thu-10101924", "tech_specs": {"features": ["Stroll with ease: Easy to maneuver wherever you go, thanks to its lightweight design, large 16\" rear wheels, and swivel front wheel.", "Efficient twist brake: The integrated twist hand brake offers improved security and braking control on hilly terrain and while running.", "Compact fold: One-handed, compact fold makes storing and transporting a breeze.", "Easy to maneuver, thanks to the swivel front wheel that locks into place for jogging, and to the 16” rear wheels", "One-handed, compact fold for easy storage and transportation", "Integrated twist hand brake provides speed control on hilly terrain", "Multi-position canopy with side-ventilation windows ensures your child is comfortable", "Reclining seat – convenient one-handed recline", "Suspension makes the ride smooth for both parent and child", "Ergonomic, adjustable handlebar for maximum parent comfort", "Plenty of room to bring everything you need thanks to large cargo basket with zip-top cover, rear mesh pocket, and two mesh compartments for snacks or toys", "Secure and comfortable seat with padded 5-point harness and integrated ventilation", "Peekaboo window with magnetic closure lets you check on your sleeping child without disturbing him or her", "Improved visibility thanks to reflective rims on all wheels and reflective edge on canopy", "Can be used from birth with Thule Bassinet or infant car seat adapter (sold separately - Bassinet not available in North America). Seat and canopy fabric can be removed to create a clean look", "Weight capacity: 34 kg", "Folded dimensions: 87 x 69 x 34 cm", "Weight: 11.4 kg", "Shoulder width: 31.5 cm", "Sitting height: 53 cm", "Door pass through: 69 cm", "Safety harness: 5-point", "Meets safety standards", "Children: 1\n                            \n                    \n                \n                \n                \n\n\n\n\n    \n\n    \n\n\n", "\n"]}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/THU-10101924_7EDark_20Shadow.jpg?v=1621498218"]}