{"manufacturer": "Thule", "name": "Sleek Stroller", "price": "1049.95", "category_hierarchy": ["Gear", "Gear/Child Carriers &amp; Strollers", "Gear/Child Carriers &amp; Strollers/City Strollers"], "sku": "thu-11000001", "uid": "1923201237095", "review_score": "0", "review_total": "0", "url": "https://www.altitude-sports.com/products/thule-sleek-llll-thu-11000001", "tech_specs": {"features": ["Freedom to move: Whether in single, double, or twin mode, Thule Sleek is easy to maneuver anywhere you go thanks to its compact size, front swivel wheels, and lightweight construction.", "Flexibility for any occasion: From infant to toddler, and from one to two kids, Thule Sleek converts to match the needs of your family. *Bassinet and Sibling seat sold separately", "A comfortable ride: The large, reclining seat and the ventilated canopy with extendable sun visor ensure the your child will enjoy every ride.", "Extendable ventilated canopy with peekaboo window and sun visor gives your child a pleasant ride in any weather and provides UV protection (UPF 50+)", "Comfortable large seating area, with generous sitting height and adjustable footwell", "Can be used from birth with Thule Sleek Bassinet or infant car seat adapter (sold separately)", "Reversible seat for parent- or forward-facing position", "Reclining seat in three positions for great comfort in both sleeping, resting, and upright position", "Bumper bar that rotates to the side for easy seating of your child", "Shock-absorbing 4-wheel suspension for a smooth ride on rougher terrain", "No-puncture foam-filled 11\" rear tires with reflective rims for a smooth ride on rougher terrain and improved visibility. Can be removed to reduce the folded size", "Swiveling 8\" front wheels with reflective rims that can be locked into fixed position for rides on rougher terrain. Can be removed to reduce the folded size", "Simple, compact fold with auto lock, with or without seat mounted", "Adjustable handlebar height for a perfect fit for every parent", "Dedicated hook for stable and accessible placement of the changing bag", "Large cargo basket with zip-top cover that allows you to bring everything you need", "Future-proof – can be expanded, for siblings or twins"]}, "img_urls": ["https://cdn.shopify.com/s/files/1/1230/9376/products/THU-11000001_7EGrey_20Melange_f1b53e9d-f4ef-4052-b4c4-26207032e49a.jpg?v=1617948803"]}