{"name": "Maglite AA Flashlight", "categories": ["Home", "All", "Camping and hiking", "Headlamps and lighting", "Flashlights", "AA Flashlight"], "description": "This high-quality palm-size flashlight has a focusable beam. A rotary on/off switch eliminates the possibility of mechanical failure and a potential point for water entry. Both the top and end are sealed with O-rings to protect it from rain and splashes.  Unscrew the top, and set the flashlight body upright in it to create a candle-type light that frees your hands and illuminates 360°.Anodized aluminum body is knurled for slip-resistant grip.2 AA batteries and spare bulb included.Bulb typically lasts through five sets of batteries. Spare is stored in the end cap to protect it from damage.", "product_code": "0102-665", "tech_specs": {"Weight": ["110g"], "Ideal for": ["Everyday use", "Travel", "Emergency preparedness"], "Body material": ["Metal"], "Light modes\n\nThe number of lighting levels/modes the light has (i.e., low, med, high, flash).": ["1 mode"], "Boost mode\n\nBriefly increases the light output to maximum brightness and distance.": ["No"], "Light source": ["Xenon bulb"], "Burn time - high": ["5.5 h"], "Beam pattern\n\nBeam pattern affects how much you can see within the area of light thrown from the headlamp. Wide beams are good for close-up; spot or focussed beams are good for long range visibility.": ["Spot"], "Rechargeability\n\nRechargeable lights give you hassle-free recharging with almost any power source. Replaceable batteries provide instant power, but you’ll need to bring extra batteries, recycle used ones and buy new ones.": ["Non-rechargeable"], "Red light mode": ["No"], "Regulated output\n\nOn regulated lights brightness is consistent, and does not decrease gradually as the batteries are drained.": ["No"], "Batteries": ["2 AA (included)"], "Pocket clip": ["No"], "Flash mode": ["No"], "Made in": ["USA"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8813005471774/0102665-BK000.jpg"]}