{"name": "MEC Fusion Neoprene Vest - Men's", "categories": ["Home", "All", "Watersports", "Watersports clothing", "Wetsuits and neoprene clothing", "Wetsuits", "Fusion Neoprene Vest"], "description": "A practical mix-and-match paddling piece. We’ve designed it to be paired with the Fusion Shorts or Capris for core insulation in warm water and warm weather, or with the Fusion Pants as a convenient alternative to a full Farmer John in cooler conditions.The Fusion series combines years of material development with exceptionally sophisticated patterning to produce neoprene that’s comfortable to wear while you're active, and warmer in the water if you swim.2mm, four-way super-stretch neoprene for maximum comfort and fit.Long in the back for good coverage when seated in a kayak or canoe.\n\nBody fit\n\n\n\nFit guide\n\nGarments, designed for specific activities have features that aren’t always adaptable to general use. For example, cycling clothing is longer in the back and arms. Activity aside, the fit of MEC clothing falls into these categories:\n\n\n\n\n\nOur next to skin fit that contours the body for no distractions\n\n\n\n\n\nOur close to body fit with a low profile silhouette for ease of movement\n\n\n\n\n\nOur standard, slightly off body fit for unrestricted comfort\n\n\n\n\n\nOur roomy, off body fit for maximum comfort and easy layering\n\n\nAll MEC men’s and boy’s pants are regular rise.", "product_code": "5021-527", "tech_specs": {"Weight": ["440g (Large)"], "Ideal for": ["Kayaking", "Canoeing", "Paddleboarding"], "Face fabric": ["2mm neoprene"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8806144737310/5021527-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8806144901150/5021527-BK000-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8806144737310/5021527-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8806144901150/5021527-BK000-ALT-BACK.jpg"]}