{"name": "MEC Drencher Pants - Women's", "categories": ["Home", "All", "Clothing", "Bottoms", "Pants", "Rain pants", "Drencher Pants"], "description": "Affordable pull-over pants for your daily commute. They’re slim enough not to flap in the wind, yet roomy enough to fit over your regular clothes. The fully waterproof construction makes them best suited to shorter, lower-intensity rides, where interior moisture build-up will be minimal.Very durable 100% nylon fabric with polyurethane coating for waterproofness.Fully seam-taped for maximum protection.DWR coating for improved comfort.Elasticized waist with drawcord.Small rise at waist back to keep you covered in the riding position.Subtly articulated knees for comfortable pedalling.Gusseted knee to ankle zipper for easier on and off.Velcro® ankle closures can cinch tight to stay out of the drive.Reflective strips on the leg and hip for visibility at night or in dull weather.\n\nRelaxed fit, Regular rise\n\n\n\nFit guide\n\nTechnical garments, designed for specific activities have features that aren’t always adaptable to general use. For example, cycling clothing is longer in the back and arms. Activity aside, the fit of MEC clothing falls into these categories:\n\n\n\n\n\nOur next to skin fit that contours the body for no distractions\n\n\n\n\n\nOur close to body fit with a low profile silhouette for ease of movement\n\n\n\n\n\nOur standard, slightly off body fit for unrestricted comfort\n\n\n\n\n\nOur roomy, off body fit for maximum comfort and easy layering\n\n\n\n\n        Sustainability\n\n\n\n\n\n\n.bluesign-cls-1,.bluesign-cls-2,.bluesign-cls-3{fill:none;}.bluesign-cls-2,.bluesign-cls-3{stroke:#333;stroke-width:1.79px;}.bluesign-cls-2{stroke-linejoin:round;}.bluesign-cls-3{stroke-miterlimit:10;}\n\nBluesign\n\n\n\n\n\n\n\n\n\n\n\n                      Bluesign® Approved Material", "product_code": "5024-813", "tech_specs": {"Weight": ["234g (Medium)"], "Ideal for": ["Cycle commuting", "Cycle touring"], "Type": ["Waterproof"], "Construction": ["Unlined"], "Face fabric": ["Nylon"], "Waterproofness\n\nWaterproof garments use waterproof-breathable technologies and are fully seam-taped. Water-resistant garments use waterproof-breathable technologies but their seams are not taped. Water-resistant garments repel water and protect against wind but are not made of waterproof fabric.": ["Waterproof with fully taped seams"], "Pockets": ["None"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["Windproof"], "Finished inseam\n\nThe finished inseam measurement of the garment.": ["29in. (M)"], "Durable water repellency\n\nUsually referred to as DWR. A treatment made to fabrics that causes water to bead and run off instead of soaking through.": ["Yes"], "Antimicrobial treatment\n\nA treatment that inhibits bacteria growth and reduces odour.": ["No"], "Additional feature(s)": ["Gusseted cuffs", "Reflective details"], "Product sustainability": ["Bluesign® Approved Material"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8804279353374/5024813-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8804278763550/5024813-BK000-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8804278927390/5024813-BK000-ALT-ZIP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8804279353374/5024813-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8804278763550/5024813-BK000-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8804278927390/5024813-BK000-ALT-ZIP.jpg"]}