{"name": "MEC T3 Long Johns - Men's", "categories": ["Home", "All", "Clothing", "Base layers and underwear", "Base layers", "Base layer bottoms", "T3 Long Johns"], "description": "Made for high exertion in cold settings, T3 base layers deliver warmth without inhibiting your mobility. When your're chugging up steep switchbacks, the lightweight Polartec Power Grid® offers excellent moisture management – the inner side rapidly wicks moisture away from the body, while the outer yarns disperse dampness for quick evaporation. On the inside, a voided grid construction traps air for greater warmth and increased breathability.Polygiene® silver ion treatment provides odour control.Gusseted crotch.Waistband logo is heat transferred, not sewn in, for increased comfort.\n\nSlim fit\n\n\n\nFit guide\n\nGarments, designed for specific activities have features that aren’t always adaptable to general use. For example, cycling clothing is longer in the back and arms. Activity aside, the fit of MEC clothing falls into these categories:\n\n\n\n\n\nOur next to skin fit that contours the body for no distractions\n\n\n\n\n\nOur close to body fit with a low profile silhouette for ease of movement\n\n\n\n\n\nOur standard, slightly off body fit for unrestricted comfort\n\n\n\n\n\nOur roomy, off body fit for maximum comfort and easy layering\n\n\nAll MEC men’s and boy’s pants are regular rise.", "product_code": "5026-606", "tech_specs": {"Weight": ["150g (Medium)"], "Ideal for": ["Snowsports", "Camping and hiking", "Alpine climbing and mountaineering", "Ice climbing"], "Type": ["Base layer"], "Fabric weight\n\nMeasured in grams per square metre (gsm). The larger the number, the heavier and thicker the garment.": ["138gsm"], "Fabric content": ["50% polyester", "42% recycled polyester", "8% spandex"], "Relief opening": ["Yes"], "Antimicrobial treatment\n\nA treatment that inhibits bacteria growth and reduces odour.": ["Yes"], "Additional feature(s)": ["Antimicrobial treatment"], "Made in": ["El Salvador"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9067040014366/5026606-ECP06.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8971969167390/5026606-ECP06-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9067040014366/5026606-ECP06.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8971969167390/5026606-ECP06-ALT-BACK.jpg"]}