{"name": "Gregory Denali 75 Backpack - Unisex", "categories": ["Home", "All", "Camping and hiking", "Packs", "Backpacking packs", "Expedition packs (75 - 100l)", "Denali 75 Backpack"], "description": "This alpine expedition bag lets you move impressive loads in comfort across technical terrain. When you arrive, strip it down for summit day. Based on Gregory’s category-defining original, this Denali has a new FusionFlex Pro suspension with dual stays and a canting harness that automatically adjusts to your specific shoulder angles. The removable belt has is precurved and lushly padded to keep your hips unbruised under the most demanding loads. There’s even a sled pull attachment for sieges that are super equipment-intensive.Removable components include hipbelt, frame stays, foam framesheet (doubles as a bivy pad), 2 Velcro ice axe keeper loops and lid. Stripped weights are: Small 1.7kg, Medium 1.8kg, and Large 1.9kg.Main body fabric is double-diamond ripstop nylon.Interior is oxford nylon in a contrast colour for better visibility of contents.Bottom panel is made from heavy oxford nylon for resistance to abrasion and punctures.Sewn-in frame sheet is light, reduces failure points and protects your back from sharp gear.Lightweight anti-barrelling crossstay provides stability.2 large foldaway side pockets for water bottles or pickets.Zippered side pocket for quick access to maps, food bars or a headlamp.Zippered front panel pocket.Hipbelt has sled pull attachment, gear loops, ice clippers and 2 zippered pockets.Gear loops and reinforced daisy chain on front of pack.Crampon patch is dual-layer, internally laminated TPU to prevent point stabs.2 adjustable ice axe loops hold leashless and mixed climbing tools.Rope strap under lid.Alternative webbing for use as a waist belt included, along with spare bucklesHydration reservoir sleeve and port.V-shaped compression straps don't interfere with side pockets.Crossover front compression straps cinch large loads and provide an alternate lashing point.", "product_code": "5037-337", "tech_specs": {"Weight": ["2.64kg (Small)", "2.72kg (Medium)", "2.81kg (Large)"], "Ideal for": ["Backpacking", "Alpine climbing and mountaineering"], "Main fabric": ["210-denier ripstop nylon"], "Secondary fabric": ["420-denier nylon"], "Access\n\nThe location of all access points into the main compartment of the pack.": ["Top", "Side"], "Hipbelt": ["Removable padded"], "Lid type\n\nSome pack lids can be adjusted to compensate for overloaded packs, or even removed, and some removeable lids have tuck-away hipbelts that allow youto use them as a waistpack.": ["Adjustable", "Removable"], "Volume": ["72L (Small)", "75L (Medium)", "78L (Large)"], "Length": ["88cm (Medium)"], "Width": ["34cm (Medium)"], "Depth": ["30cm (Medium)"], "Ventilated back panel": ["No"], "Adjustable shoulder harness\n\nAn adjustable harness lets you change the height of the shoulder straps to fit your specific back length.": ["Yes"], "Dynamic suspension\n\nThe hipbelt and/or shoulder straps of the pack are designed to move, pivot or flex to follow your body’s movements.  Each brand uses their own technology.": ["No"], "Carry-on sized\n\nSize restrictions vary among airlines. Just to be sure, check with your carrier for their specific restrictions.": ["No"], "Additional feature(s)": ["Compression straps", "Crampon patch", "Hipbelt pocket(s)", "Hydration compatible (reservoir sold separately)", "Ice axe/pole attachment", "Expandable collar"], "Made in": ["Philippines"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8814553530398/5037337-BK501.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8814554021918/5037337-BK501-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8814553530398/5037337-BK501.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8814554021918/5037337-BK501-ALT-BACK.jpg"]}