{"name": "Scarpa Phantom 6000 Boots - Unisex", "categories": ["Home", "All", "Climbing", "Mountaineering and ice climbing", "Mountaineering boots", "Phantom 6000 Boots"], "description": "Mountaineering performance for Alaska, Aconcagua, and the Canadian Rockies in winter. The Phantom 6000 are ready to go big.  Get a nimble, progressive fit with the quick-lace system using strong Dyneema cord. Keep your precious heat with the felt and 4mm-EVA inner boot. And get the streamlined performance of a leather boot with the multi-day versatility of a double boot.Gaiters are light and super tough Kevlar-reinforced Schoeller S-Tech Fabric.Gaiters feature Super Fabric with Outdry for weatherproof durability.Upper/shell is constructed from Cordura, EVA and cork for durable, lightweight warmth.Removable liner is made of Primaloft Micropile, EVA and cork to keep your feet toasty at altitude.Durable waterproof Flexseal® zipper closure eases access.Quick-lace system allows for easy tie-ins with cold or gloved fingers.Insole is made of carbon fibre and EVA for cushioned control.Microporous EVA midsoles are lightweight and absorb shock.Vibram Zero Gravity soles retain grip and sensitivity.Compatible with all crampon binding systems.", "product_code": "5048-926", "tech_specs": {"Weight": ["1.99kg (42)"], "Ideal for": ["Snow and ice climbing"], "Upper material": ["Synthetic"], "Closure": ["Lace-up", "Zipper"], "Rand\n\nRubber on the toe and around the boot improves durability. It can also increase grip while scrambling.": ["Full rand"], "Crampon compatibility\n\nRigid boots with defined toe and heel welts can use compatible step-in crampons or any other type of crampon. Rigid boots with a heel welt but no toe welt can use hybrid crampons or strap-on crampons. Semi-rigid boots can use strap-on crampons only.": ["Step-in"], "Insulated": ["Yes"], "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": ["Yes"], "Removable inner boot": ["Yes"], "Removable insole": ["Yes"], "Made in": ["Italy"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8851011371038/5048926-BK064.jpg"]}