{"name": "La Sportiva Olympus Mons Evo Boots - Unisex", "categories": ["Home", "All", "Climbing", "Mountaineering and ice climbing", "Mountaineering boots", "Olympus Mons Evo Boots"], "description": "One for the Himalaya, this superlight double boot features an insulated inner boot you can use for walking around base camp. The thermo-reflective outer boot layers on warmth, and a durable Cordura gaiter with Kevlar reinforcements lets you take it to extremely cold settings. Inside, a carbon fiber insole adds support, and closed-cell foam helps fend off the cold. EVA makes the midsole cushy, and TPU inserts ensure longevity. Reliable Vibram® PE rubber gives the sole plenty of traction, and the rubber rand protects the boot from wear-and-tear so you can tackle 8,000-meter peaks weekly.Gaiter is breathable Cordura, plus Kevlar anti-perforation fabric for durability and lightness.Outer boot is Cordura lined with dual-density PE micro-cellular insulating foam and thermo-reflective aluminum facing.Inner boot is slip lasted, outer boot is board lasted.Movable collar allows easy fitting and precision closure.Insulated removable footbed and Vibram rubber rand.Inner boot has water repellent, breathable upper with nylon external layer, dual-density micro-perforated foam, and structured polyester lining combined with warm fleece.Insole uses 5mm carbon fiber with 2.5mm insulating closed-cell foam topped with a reflective aluminum layer.Midsole is TPU and EVA.Sole is highly insulating Vibram PE with rubber toe inserts.Anti-abrasion rubber reinforcements, suitable for step-in crampons.", "product_code": "5048-920", "tech_specs": {"Weight": ["2.26kg (42)"], "Ideal for": ["Alpine climbing and mountaineering"], "Upper material": ["Synthetic"], "Closure": ["Lace-up"], "Rand\n\nRubber on the toe and around the boot improves durability. It can also increase grip while scrambling.": ["Full rand"], "Crampon compatibility\n\nRigid boots with defined toe and heel welts can use compatible step-in crampons or any other type of crampon. Rigid boots with a heel welt but no toe welt can use hybrid crampons or strap-on crampons. Semi-rigid boots can use strap-on crampons only.": ["Step-in"], "Insulated": ["Yes"], "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": ["Yes"], "Removable inner boot": ["Yes"], "Removable insole": ["Yes"], "Made in": ["Italy"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8808346746910/5048920-YLW02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8808346583070/5048920-YLW02-ALT-OPEN.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8808346746910/5048920-YLW02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8808346583070/5048920-YLW02-ALT-OPEN.jpg"]}