{"name": "Dynafit PDG Ski Boots - Unisex", "categories": ["Home", "All", "Ski and snowboard gear", "Backcountry skiing gear", "Backcountry ski boots", "PDG Ski Boots"], "description": "A performance boot ideal for skimo racing and high-intensity training. Closely related to  high-end race boots, the PDG is a slightly heavier yet equally agile iteration. The Grilamid shell features a stiff fibreglass cuff to help drive your skis. Rubber soles provide traction on non-snow surfaces, while the rock-solid ski/walk mechanism allows for easy changes from ski to walk mode. The 2 buckle system features an optional power strap for close contact on high-performance days. While the liner provides some moisture management and insulation, these boots lack shell coverings in the upper sections, so are susceptible to moisture when booting through big snow.Grilamid shell features a solid fibreglass cuff and Grilamid spoiler.2-buckle design features an optional power strap for increased contact between boot and leg.Ultra-Lock System 1.0 ski/walk mechanism switches from ski to walk cleanly and quickly.Evo Race 2.0 rubber soles are super grippy and lightweight.Dynafit Custom Light liners are thermomoldable for a customized fit and provide moderate insulation and moisture management.", "product_code": "5048-409", "tech_specs": {"Weight": ["1.66kg (27)"], "Ideal for": ["Ski mountaineering"], "Boot/binding compatibility\n\nThe boot and binding systems must match for best performance and safe use.": ["Tech"], "Buckles": ["2"], "Lower shell material": ["Grilamid"], "Shell cuff material": ["Grilamid", "Fibreglass"], "Sole type\n\nAlpine Touring: with tread; compatible with DIN touring bindings. Alpine Touring Tech (Tech): with tread; compatible with G3 Onyx and Dynafit. Downhill: without tread; compatible with freeride/downhill bindings.": ["Tech"], "Forward lean\n\nForward lean affects a skiers balance. Some boots have a set forward lean angle; some are adjustable. Less lean places your knees in a more upright (almost standing) position, whereas more lean positions your knees forward over the ball of your feet.": ["14-17º"], "Range of motion\n\nThe range of motion of the boot when in hike mode.": ["62º"], "Lace-up option": ["No"], "Thermoformable inner boot": ["Yes"], "Hike mode\n\nA mechanism that allows to release the boot cuff to switch to tour mode.": ["Yes"], "Made in": ["Italy"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8840311373854/5048409-WH030.jpg"]}