{"name": "MEC Gateway Tights - Women's", "categories": ["Home", "All", "Camping and hiking", "Hiking clothing", "Hiking pants", "Gateway Tights"], "description": "Move freely at the gym in these climbing tights. The fabric is woven instead of knit to resist abrasion better. Multiple drop-in pockets keep small items handy when you're at a hanging belay. Great for gym climbing, yoga or light hiking, these tights are your gateway to good times outside (or inside).Made of stretch woven nylon and spandex that's durable enough to stand up to the rigors of climbing and hiking.Wide yoga pants-style waistband is comfortable under a harness or hipbelt.Internal drawcord ensures they won't slip out of place.Drop-in stretch pockets on the hips and back of waistband give you space to store your phone, lip balm, keys and other small essentials.Gusseted crotch and stretchy fabric ensure plenty of room to move.7/8-style 25 in. inseam.\n\nBody fit, Regular rise\n\n\n\nFit guide\n\nTechnical garments, designed for specific activities have features that aren’t always adaptable to general use. For example, cycling clothing is longer in the back and arms. Activity aside, the fit of MEC clothing falls into these categories:\n\n\n\n\n\nOur next to skin fit that contours the body for no distractions\n\n\n\n\n\nOur close to body fit with a low profile silhouette for ease of movement\n\n\n\n\n\nOur standard, slightly off body fit for unrestricted comfort\n\n\n\n\n\nOur roomy, off body fit for maximum comfort and easy layering\n\n\n\n\n        Sustainability\n\n\n\n\n\n.st0{stroke:#333;stroke-width:.79;stroke-miterlimit:10}\n\n\n\n\n\n\n\n\n                      Recycled content", "product_code": "5050-803", "tech_specs": {"Ideal for": ["Camping and hiking", "Indoor climbing"], "Fabric weight\n\nMeasured in grams per square metre (gsm). The larger the number, the heavier and thicker the garment.": ["146gsm"], "Fabric content": ["81% nylon", "19% spandex"], "Secondary fabric": ["100% recycled polyester"], "Pockets": ["1 back", "2 side"], "Finished inseam\n\nThe finished inseam measurement of the garment.": ["25in. (all sizes)"], "Antimicrobial treatment\n\nA treatment that inhibits bacteria growth and reduces odour.": ["No"], "Additional feature(s)": ["Gusseted crotch"], "Product sustainability": ["Recycled content"], "Made in": ["El Salvador"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9038356480030/5050803-BK000.jpg"]}