{"name": "Black Diamond Half Dome Helmet - Women's", "categories": ["Home", "All", "Climbing", "Rock climbing", "Climbing helmets", "Half Dome Helmet"], "description": "Ponytailed or woolly-toqued, your head will fit inside this classic helmet. The shape and  adjustment range should give you a comfortable fit, even if most other helmets feel like a bucket or your head.Moulded EPS foam interior and polycarbonate shell exterior are extremely durable.Shell and suspension design is ponytail friendly for a comfortable fit.Ventilation ports help regulate temperature, expel moisture, and improve breathability.Tuck-away suspension system packs up inside the helmet for more compact stowage in packs or haul bags.Wheel adjuster provides precise adjustment for quick, fine-tuned fit.Headlamp clips slot directly into the mould of the helmet for secure attachment.Fits head circumferences 52-58 cm.", "product_code": "5052-303", "tech_specs": {"Ideal for": ["Snow and ice climbing", "Rock climbing"], "Construction\n\nMicroshell helmets are made of a thin polymer sheet over a foam liner; Hardshell helmets have a hard polymer outer shell and a foam liner; when the liner is being bonded to the outer shell during the manufacturing process, it is Molded in the shell.": ["Hardshell"], "Shell material": ["Polycarbonate"], "Fit system": ["Adjustable dial"], "Inner material": ["EPS (expanded polystyrene)"], "Vents": ["Yes"], "Headlamp compatible": ["Yes"], "Approved for\n\nMost helmets are tested and certified for a specific sport. Some helmets are approved for multi-sports, but only after passing the safety tests for both sports (i.e., snowsports and cycling).": ["Climbing"], "Safety rating\n\nCetification is established by a variety of governing bodies who set impact standards. Most helmets are certified or approved for a specific sport, except in the case of multi-sport helmets (i.e., a snowsports helmet might also be approved for cycling if it meets the cycling safety standards).": ["EN 12492"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8860806479902/5052303-ALU00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9128842362910/5052303-ALU00-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8860806479902/5052303-ALU00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9128842362910/5052303-ALU00-ALT-BACK.jpg"]}