{"name": "Patagonia Hi-Loft Down Sweater Hoody - Infants to Children", "categories": ["Home", "All", "Kids", "Baby (0-2 yrs)", "Baby clothing", "Baby outerwear", "Baby jackets", "Baby insulated jackets", "Hi-Loft Down Sweater Hoody"], "description": "An infant’s jacket that adults will eye with envy. Using duck down insulation, this lined jacket has a wind-proof shell treated with DWR (durable water repellency) finish for the ultimate in warmth and weather protection. Features like a quilted 3-panel hood, zipper wind flap, and spandex binding at the hood and cuffs work together to prevent heat from escaping. Compressible insulation packs up small, making it easy to travel with.Shell made of recycled polyester mini-ripstop for impressive durability. Lining made of polyester.Both shell and lining are treated with DWR.Insulated with highly compressible 600-fill-power traceable down.Down is third-party certified to be non-live plucked and supplied from a facility that does not practice force feeding.Quilted constructed keeps the down in place.Elasticized back hem cinches in close to keep heat in.2 zippered handwarmer pockets with reflective zipper pulls for visibility.Comfortable spandex binding around the hood and cuffs seals out the cold.Full-length wind flap keeps out chills.Zipper garage prevents any unfortunate skin-pinching incidents.Hand-me-down label.", "product_code": "5053-240", "tech_specs": {"Ideal for": ["Casual wear"], "Type": ["Insulated down"], "Technology": ["Traceable Down"], "Construction": ["Sewn-through"], "Face fabric": ["30-denier recycled polyester"], "Lining/backer": ["Polyester"], "Insulation": ["600 fill-power duck down"], "Down weight": ["84g"], "Waterproofness\n\nWaterproof garments use waterproof-breathable technologies and are fully seam-taped. Water-resistant garments use waterproof-breathable technologies but their seams are not taped. Water-resistant garments repel water and protect against wind but are not made of waterproof fabric.": ["Water-resistant"], "Pockets": ["2 handwarmer"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["Wind-resistant"], "Durable water repellency\n\nUsually referred to as DWR. A treatment made to fabrics that causes water to bead and run off instead of soaking through.": ["Yes"], "Hood": ["Insulated", "Standard"], "Additional feature(s)": ["Wind flap behind zipper"], "Made in": ["Bangladesh"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9042340708382/5053240-NNV89.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9042333958174/5053240-NNV89-ALT-OPEN.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9042333990942/5053240-NNV89-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9042340708382/5053240-NNV89.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9042333958174/5053240-NNV89-ALT-OPEN.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9042333990942/5053240-NNV89-ALT-BACK.jpg"]}