{"name": "Zamberlan 960 Guide Gore-Tex RR Hiking Boots - Men's", "categories": ["Home", "All", "Camping and hiking", "Hiking footwear", "Hiking boots", "960 Guide Gore-Tex RR Hiking Boots"], "description": "There’s no need to tread lightly. These off-trail boots are designed to haul heavy loads. Vibram® Star Trek outsole sticks where you strike and won’t give out during downhill braking. A ¾ rand gives you durability with elastic rubber and a beveled edge that doesn’t catch or peel – so they stand up to many backcountry miles. Built-in GORE-TEX® booties provide waterproofness with breathability.Uppers are nubuck leather, treated during tanning to ensure water resistance.Gore-Tex Performance Comfort membrane is thermo-sealed into a bootie then fixed to the upper and glued to the midsole.Removable footbeds have a quick drying top fabric that wicks away moisture, a layer of active carbon, a cushioning layer, and small holes that aid breathability.4mm PE insoles control flexibility and distribute load.Thermal moulded EVA midsoles include 2 densities of TPU inserts for stability and comfort.¾ rubber rand is edge beveled for greater durability.Vibram® Star Trek rubber outsoles excel in steep technical terrain for grip and braking.", "product_code": "5054-419", "tech_specs": {"Weight": ["1.68kg (42)"], "Ideal for": ["Backpacking"], "Upper material": ["Nubuck leather"], "Closure": ["Lace-up"], "Rand\n\nRubber on the toe and around the boot improves durability. It can also increase grip while scrambling.": ["Partial rand"], "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": ["Yes"], "Removable insole": ["Yes"], "Made in": ["Italy"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9085231661086/5054419-DBR00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9084926197790/5054419-DBR00-ALT-TOP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9084926230558/5054419-DBR00-ALT-SOLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9085231661086/5054419-DBR00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9084926197790/5054419-DBR00-ALT-TOP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9084926230558/5054419-DBR00-ALT-SOLE.jpg"]}