{"name": "Atomic Hawx Ultra XTD 130 Ski Boots - Men's", "categories": ["Home", "All", "Ski and snowboard gear", "Backcountry skiing gear", "Backcountry ski boots", "Hawx Ultra XTD 130 Ski Boots"], "description": "Great skiing power with natural movement for touring. The Hawx Ultra XTD 130 blends mobility with performance to give you a ski-able, 4-buckle boot that doesn’t feel like a boat anchor. They provide the support and stiffness you'd expect from a much heavier option. 54° range of motion when climbing ensures you get further with every stride. The ski/walk lock is designed with simplicity and durability in mind. Both the shell and liner can be heat moulded. Out of the box, the 98mm last fits in the narrow category but can accommodate wider feet when moulded.Shell and cuff are made of light and stiff Grilamid.98mm last has a somewhat narrow fit.Progressive shell is reinforced where needed without adding unnecessary weight.Breathable liner is thermo-mouldable and hand washable.Heat mouldable shell and liner ensures a perfect fit.Liner has preshaped zones around the ankle and heel for great downhill performance.2.0 ski/walk mechanism gives you 54-degree range of motion for climbing and 15-17 degrees of forward lean for skiing.Frictionless pivot uses polymer bushings to provide natural movement on ascents.4 aluminum buckles and a power strap provides a precise and secure fit.Rockered rubber walk to ride sole provide grip and wide binding compatibility.Compatible with tech bindings, WTR bindings, and touring bindings.", "product_code": "5055-265", "tech_specs": {"Weight": ["2.84kg (26.5)"], "Ideal for": ["Alpine touring", "Freeride and freeskiing", "Downhill skiing"], "Boot/binding compatibility\n\nThe boot and binding systems must match for best performance and safe use.": ["Tech", "Alpine touring (WTR)", "Alpine touring"], "Buckles": ["4"], "Lower shell material": ["Grilamid"], "Shell cuff material": ["Grilamid"], "Sole type\n\nAlpine Touring: with tread; compatible with DIN touring bindings. Alpine Touring Tech (Tech): with tread; compatible with G3 Onyx and Dynafit. Downhill: without tread; compatible with freeride/downhill bindings.": ["Tech", "Alpine Touring WTR", "Alpine Touring"], "Forward lean\n\nForward lean affects a skiers balance. Some boots have a set forward lean angle; some are adjustable. Less lean places your knees in a more upright (almost standing) position, whereas more lean positions your knees forward over the ball of your feet.": ["15-17º"], "Range of motion\n\nThe range of motion of the boot when in hike mode.": ["54º"], "Flex index\n\nIndicates how stiff the boots are when flexed forward.  Flex ranges from 50 (soft) to 130 (very stiff). Note: There is currently no industry standardized test.": ["130"], "Last width\n\nThe width of the interior of the boot shell across the widest part of the forefoot.": ["98mm"], "Lace-up option": ["Yes"], "Thermoformable inner boot": ["Yes"], "Hike mode\n\nA mechanism that allows to release the boot cuff to switch to tour mode.": ["Yes"], "Made in": ["Romania"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8913447354398/5055265-BOA00.jpg"]}