{"name": "Gregory Avos 10 Hydration Pack - Women's", "categories": ["Home", "All", "Packs and bags", "Hydration packs and accessories", "Hydration packs", "Avos 10 Hydration Pack"], "description": "The superb fit lets you focus on the trail not the load on your back. Tuned to fit women who ride, the unique suspension system lets you move the hipbelt up and down to suit your posture and your riding style. The back has a suspended mesh panel to allow cooling airflow. And it comes with a 3D Hydro reservoir that's easy to clean and easy to clip into the pack.Made of lightweight 210-denier ripstop nylon with an abrasion resistant 420-denier polyester base.Suspended mesh back panel wicks sweat and lets air flow through to cool your back.Women's specific Shift RS (ride stability) vertically adjustable hipbelt moves up or down to compensate for body position, riding style and trail grade.Wide zippered clamshell opening to access to main compartment.Zippered top pocket and hipbelt pockets hold quick access items.Padded pocket for your gadgets and valuables to keep them safe in case you crash.Removable zippered tool pouch stows inside an internal non-bounce storage pocket.Internal organizers for pumps, spare tubes and energy bars.Hydration sleeve with snap and go SpeedClip mounting system lets you load the reservoir with one hand.Includes a Gregory 3D Hydro 3L reservoir that uses QuickDry soft moulded technology and has an integrated drying hanger so it's easy to keep clean.Gregory recommends this pack for loads up to 7lb/15kg.", "product_code": "5056-154", "tech_specs": {"Weight": ["819g"], "Ideal for": ["Mountain biking"], "Main fabric": ["210-denier ripstop nylon"], "Secondary fabric": ["420-denier polyester"], "Access\n\nThe location of all access points into the main compartment of the pack.": ["Clamshell zip"], "Hipbelt": ["Padded"], "Volume": ["10L"], "Ventilated back panel": ["Yes"], "Dynamic suspension\n\nThe hipbelt and/or shoulder straps of the pack are designed to move, pivot or flex to follow your body’s movements.  Each brand uses their own technology.": ["Yes"], "Carry-on sized\n\nSize restrictions vary among airlines. Just to be sure, check with your carrier for their specific restrictions.": ["Yes"], "Additional feature(s)": ["Compression straps", "Hipbelt pocket(s)", "Hydration compatible (reservoir included)"], "Made in": ["Philippines"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8928094814238/5056154-ING00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8943036760094/5056154-ING00-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8928094814238/5056154-ING00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8943036760094/5056154-ING00-ALT-BACK.jpg"]}