{"name": "Riot Kayaks Intrigue Ultralight Kayak with Window", "categories": ["Home", "All", "Watersports", "Kayaking", "Kayaks", "Recreational kayaks", "Intrigue Ultralight Kayak with Window"], "description": "A whole new perspective on paddling. The window in the bottom of the cockpit is fun during the day, and extra-trippy at night if you paddle near areas with bioluminescent species. Or slip a flashlight into the cup holder above the window to lure little fishies. When you're done studying aquatic life, the Intrigue's ultralight hull makes it easy to stow on your dock or roof rack.New thermoformed ABS construction is almost 4kg lighter than previous versions.Window is made of clear polycarbonate.Recessed deck fittings reduce hang-ups.Built-in keel-like bow and stern helps the Intrigue track well.Wide hull and hard chines provide excellent stability.Rear hatch and bulkhead provide safety and dry storage.Outfitted with grab handles, bungees, flotation in the bow, watertight stern storage, locking foot pedals, moulded seat with adjustable backrest, recessed fittings, drainage slots on the deck, and a paddle-shaft holder to assist with entries and exits.", "product_code": "5058-207", "tech_specs": {"Weight": ["14kg"], "Ideal for": ["Cottage and recreational kayaking"], "Hull material": ["ABS"], "Length": ["3m (10ft.)"], "Beam": ["74cm (29in.)"], "Centre depth\n\nThe depth of the boat at the front of the cockpit, measured from the inside bottom of the boat to the inside top.": ["36cm (14in.)"], "External cockpit dimensions\n\nDimensions of the cockpit, measured on the outside of the lip. The external measurement is useful when sizing sprayskirts.": ["97 x 47cm (38 x 18½in.)"], "Load": ["125kg (275lb.)"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8928085245982/5058207-YLW44.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8928085377054/5058207-RED53.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8928085245982/5058207-YLW44.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8928085377054/5058207-RED53.jpg"]}