{"name": "The North Face Warm Storm Jacket - Girls' - Youths", "categories": ["Home", "All", "Kids", "Youth (8-16 yrs)", "Youth clothing", "Youth jackets", "Youth rain jackets", "Warm Storm Jacket"], "description": "Stay cozy and dry, no matter the forecast. The Warm Storm Jacket lives up to its name, with a waterproof-breathable outside to defy the elements, and a plush fleece interior to insulate them against the chill. A touch of reflectivity keeps them visible when dusk falls early, and an internal ID label helps the jacket find its way home if it ever gets left in class.Waterproof-breathable fabric with fully taped seams.Body is 100% nylon, while hood and sleeves are a nylon/polyester blend.Hood is lined with cozy high-pile fleece.Body features 100% recycled polyester fleece lining for added warmth.Elastic cuffs.Pockets zip closed for secure storage.Reflective logos front and back for low-light visibility.ID label.", "product_code": "5058-994", "tech_specs": {"Ideal for": ["Casual wear"], "Type": ["Waterproof-breathable"], "Technology": ["DryVent"], "Construction": ["2-layer"], "Face fabric": ["70-denier nylon"], "Lining/backer": ["Polyurethane"], "Fabric waterproof rating\n\nThe standard test for waterproof fabrics uses a standing column filled with water.  The figures given are the water column height.  A rating of 3,500mm or higher can be considered waterproof.  The higher the rating, the more durable the waterproof fabric will be over time.": ["17,000 mm"], "Waterproofness\n\nWaterproof garments use waterproof-breathable technologies and are fully seam-taped. Water-resistant garments use waterproof-breathable technologies but their seams are not taped. Water-resistant garments repel water and protect against wind but are not made of waterproof fabric.": ["Waterproof with fully taped seams"], "Fabric active breathability\n\nThe rate at which a waterproof breathable fabric expels moisture when the inner surface is moist from perspiration.  Values under 8,000g/m2/24h provide low performance, 20,000g/m2/24h provide moderate performance and values over 30,000g/m2/24h provide high performance.": ["800g/m2/24h"], "Pockets": ["2 front"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["Windproof"], "Durable water repellency\n\nUsually referred to as DWR. A treatment made to fabrics that causes water to bead and run off instead of soaking through.": ["Yes"], "Hood": ["Standard"], "Additional feature(s)": ["Reflective details"], "Made in": ["Vietnam"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9197203423262/5058994-SWV01.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196119228446/5058994-SWV01-ALT-A.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196119359518/5058994-SWV01-ALT-B.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196119326750/5058994-SWV01-ALT-C.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9197203423262/5058994-SWV01.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196119228446/5058994-SWV01-ALT-A.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196119359518/5058994-SWV01-ALT-B.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196119326750/5058994-SWV01-ALT-C.jpg"]}