{"name": "Salomon QST Pro 90 TR Ski Boots - Women's", "categories": ["Home", "All", "Ski and snowboard gear", "Backcountry skiing gear", "Backcountry ski boots", "QST Pro 90 TR Ski Boots"], "description": "Nimble boots that are inspired by Salomon's trail running shoes. The Endofit tongue offers comfort, progressive flex and performance. A waterproof gusset keeps your feet from getting soaked when bootpacking, and a Surelock mechanism keeps them in ski mode when it's time to drop in. Different materials in the cuff and shell offer the right blend of flex and stiffness, and the women's specific heat-mouldable shell and liner will make this boot work for your foot.Endofit tongue and waterproof gusset provide progressive flex with all-day comfort.Twinframe2 technology creates a rigid structure for control and sensitivity.360-degree custom shell wraps your foot and lower leg, and is heat-mouldable to adapt to your foot.Bi-material polyurethane and polyamide lower shell provides density and durability.Polypropylene upper cuff offers a great stiffness to weight ratio.Oversized pivot improves precision transmission, lending pivot to skis that require more torque.Surelock mechanism ensures a solid connection when going down, without impacting the 40-degree range of motion when in walk mode.Custom fit 3D Pro liner is 60% thermoformable and made of preshaped high-density foam.3 lightweight aluminum micro buckles with a 45mm power strap for a precise and secure fit.Tech-compatible soles comes installed on the boots. Alpine soles included in the box.Flex 110.", "product_code": "5060-696", "tech_specs": {"Weight": ["3.44kg (26.5)"], "Ideal for": ["Freeride and freeskiing", "Alpine touring", "Downhill skiing"], "Boot/binding compatibility\n\nThe boot and binding systems must match for best performance and safe use.": ["Alpine touring"], "Buckles": ["3"], "Lower shell material": ["Polyurethane", "Polyamide"], "Shell cuff material": ["Polypropylene"], "Sole type\n\nAlpine Touring: with tread; compatible with DIN touring bindings. Alpine Touring Tech (Tech): with tread; compatible with G3 Onyx and Dynafit. Downhill: without tread; compatible with freeride/downhill bindings.": ["Alpine Touring", "Tech"], "Range of motion\n\nThe range of motion of the boot when in hike mode.": ["40º"], "Flex index\n\nIndicates how stiff the boots are when flexed forward.  Flex ranges from 50 (soft) to 130 (very stiff). Note: There is currently no industry standardized test.": ["110"], "Last width\n\nThe width of the interior of the boot shell across the widest part of the forefoot.": ["100-106mm"], "Lace-up option": ["No"], "Thermoformable inner boot": ["Yes"], "Hike mode\n\nA mechanism that allows to release the boot cuff to switch to tour mode.": ["Yes"], "Made in": ["Romania"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8993067237406/5060696-PBR02.jpg"]}