{"name": "Lenz SET Lithium Pack Rechargeable 1200+heat Socks 5.0 Toecap - Unisex", "categories": ["Home", "All", "Footwear", "Socks", "Ski socks", "SET Lithium Pack rcB 1200+heat Socks 5.0 Toec"], "description": "Warm feet at last. The integrated heating element in these socks wraps your feet and toes with electric warmth. Heated socks are great for super-cold conditions when you're sitting still or for crawling into a cold sleeping bag at night. The 2 battery packs (one for each foot) are rechargeable, and the temperature settings can be controlled from the battery or via your Bluetooth-equipped smartphone.Socks are made of thick blend of synthetics, merino wool and silk that wicks moisture well.Ergonomic knitting for a soft toe seam, strategic padding on the shins and a great fit.Integrated heating element completely wraps around both the top and bottom of the toes as well as the forefoot for the ultimate in cozy warmth.Lightweight lithium-ion battery packs attach with press studs to the cuffs, where they're out of the way of boot tops.Temperature settings: 42°C (battery life 10-14h), 52°C (5.5-7.5h) and 60°C (3.5-4.5h). The sock buffers these temperatures and prevents direct contact with skin.Settings can be adjusted on the battery pack or remotely via Bluetooth 4.0. (Requires Lenz Heat app).Remaining charge is visible on the battery packs or the Lenz Heat app.Includes a 100-240V AC wall charger with charge indicator.Unisex sizes: Small fits Euro 35-38, Medium fits Euro 39-41, Large fits 42-44, XL fits 45-47.Replacement socks are available.", "product_code": "5060-973", "tech_specs": {"Ideal for": ["Downhill skiing", "Snowboarding", "Snowshoeing", "Cross-country skiing"], "Fabric content": ["50% polyester", "25% nylon", "15% merino wool", "5% silk", "3% polypropylene", "2% spandex"], "Thickness": ["Medium"], "Cuff height": ["Knee"], "Cushioning\n\nLayers of cushioning, in some athletic socks, are knit in to reduce impact. Mapped socks are activity-specific and will offer cushioning in common pressure areas.": ["Shin"], "Anatomical fit\n\nLeft foot and right foot specific socks provide precise fit.": ["Yes"], "Additional feature(s)": ["Heated"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8994964963358/5060973-BK000.jpg"]}