{"name": "Smith Mission-MIPS Helmet - Unisex", "categories": ["Home", "All", "Ski and snowboard gear", "Ski and snowboard helmets", "Mission-MIPS Helmet"], "description": "More than \"just a helmet\", this one looks good and is incredibly comfortable. The Mission MIPS Helmet's light weight combines with a fit system that offers next-level comfort to make you likely to forget you're even wearing it... until you walk into après-ski. Lots of ventilation keeps you cool on warm days, and you can block a few vents on snowy days to keep you warm. The MIPS liner is designed to reduce the rotational forces applied to your head, should you take a spill.Lightweight in-mould construction with a polycarbonate shell and an EPS inner.Aerocore™ construction featuring Koroyd® is designed to absorb more impact than traditional helmets.MIPS helps reduce rotational forces in the event of a crash.AirEvac2 system drives warm air away from your goggles and adjusts by folding or unfolding liner flaps.Adjustable dial-fit system.Removable Snapfit SL earpads are machine washable and work with Outdoor Technology audio systems.Low-profile regulator adjusts internal airflow from the 14 vents.", "product_code": "5061-061", "tech_specs": {"Weight": ["450g (Medium)"], "Ideal for": ["Snowsports"], "Construction\n\nMicroshell helmets are made of a thin polymer sheet over a foam liner; Hardshell helmets have a hard polymer outer shell and a foam liner; when the liner is being bonded to the outer shell during the manufacturing process, it is Molded in the shell.": ["Molded in the shell"], "Shell material": ["Polycarbonate"], "Fit system": ["Adjustable dial"], "Inner material": ["EPS (expanded polystyrene)"], "Circumference\n\nThe internal circumference determines the size head that the helmet will fit.": ["51-55cm (Matte Black Small)", "55-59cm (Matte Black Medium)", "59-63cm (Matte Black Large)", "63-67cm (Matte Black X-Large)"], "Vents": ["Yes"], "Goggle clip": ["Yes"], "Removable ear liners": ["Yes"], "Approved for\n\nMost helmets are tested and certified for a specific sport. Some helmets are approved for multi-sports, but only after passing the safety tests for both sports (i.e., snowsports and cycling).": ["Snowsports"], "Safety rating\n\nCetification is established by a variety of governing bodies who set impact standards. Most helmets are certified or approved for a specific sport, except in the case of multi-sport helmets (i.e., a snowsports helmet might also be approved for cycling if it meets the cycling safety standards).": ["EN 1077 B", "ASTM F2040"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8965285380126/5061061-MAT00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9131591630878/5061061-CHA28.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8965285380126/5061061-MAT00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9131591630878/5061061-CHA28.jpg"]}