{"name": "Black Diamond Shadow Rock Shoes - Unisex", "categories": ["Home", "All", "Climbing", "Climbing footwear", "Climbing shoes", "Shadow Rock Shoes"], "description": "Soft, sticky and aggressive. The Shadow Rock Shoes are the ideal tool for steep overhanging routes and boulder problems. Black Diamond NeoFriction rubber is the right blend of supple and sticky to get purchase on thin moves and outlandish smears. With a thin midsole that lets you feel the rock, and a rubber combo that minimizers bulk, the Shadow is on the softer end of the shoe spectrum. When the project demands high levels of precision and foot dexterity, the Shadow is the one.Aggressive downturned profile is for steep routes and boulders.4.3mm thick rubber is moulded for consistent thickness.Soft and sticky NeoFriction Fuse rubber.Microfibre upper is stretch-resistant to ensure a great, consistent fit.Minimalist midsole offers sensitivity on steep terrain.Tongue uses Engineered Knit Technology for breathability and comfort.Shoe vamp features a combo of printed and moulded rubber to minimize bulk and resist wear from heavy use.Easy adjusting Velcro® strap allows for precise fit.Members typically size the same as their street shoe size.", "product_code": "5061-688", "tech_specs": {"Ideal for": ["Indoor climbing", "Bouldering", "Sport and toprope climbing"], "Type\n\nA neutral shoe suits long routes and cracks. Moderate shoes allow precision and good edging. Aggressive shoes are downturned and tensioned, for power to the toe on steep or overhanging routes.": ["Aggressive"], "Asymmetry\n\nHighly asymmetric shoes allow more precision and focused power. Symmetrical shoes are more comfortable for all-around climbing.": ["Medium"], "Stiffness\n\nStiffness is provided by the type of sole and the tensioning system. Softer shoes allow more precision. Supportive shoes prevent fatigue.": ["Soft"], "Uppers": ["Synthetic"], "Closure": ["Hook-and-loop"], "Outsoles": ["4.3mm NeoFriction Fuse"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8987513323550/5061688-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8987526496286/5061688-BK000-ALT-SOLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8987525578782/5061688-BK000-ALT-SIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8987527118878/5061688-BK000-ALT-LIFESTYLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8987513323550/5061688-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8987526496286/5061688-BK000-ALT-SOLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8987525578782/5061688-BK000-ALT-SIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8987527118878/5061688-BK000-ALT-LIFESTYLE.jpg"]}