{"name": "Fenix HM50R Headlamp", "categories": ["Home", "All", "Camping and hiking", "Headlamps and lighting", "Headlamps", "HM50R Headlamp"], "description": "Small weight, small size, big brightness. Smaller and lighter than most headlamps, yet even brighter, the HM50R is a worth a look. With 4 modes that take you from 4 lumens to 500, you get a light that works around camp, on pre-dawn trail runs or in dark Northern Thailand caves. USB charging makes it easy to top up the included 16340 battery. It's also compatible with CR123 batteries for better cold-weather performance.Rugged aluminum body has type-III hard anodizing for an extra level of protection.Glass lens is toughened for durability and has anti-reflective coating.Covered micro-USB port makes charging easy.LED power indicator lets you know how your battery is doing, whether charging or discharging.1-button operation is easy to use, with or without gloves.Intelligent circuitry remembers the last mode you were in.Can be easily adapted into a compact flashlight.Silicone strip on the back of the head strap helps keep it in place.Reflective detailing on the head strap helps keep you visible.Compact design: 6.8 x 3.3 x 2.8cm.In the box: Fenix HM50R, spare O-ring, spare rubber anti-dust cover, spare silicone holder, ARB-L16-700 lithium-ion battery, charging cable, user manual and warranty card.", "product_code": "5061-193", "tech_specs": {"Weight": ["80g"], "Ideal for": ["Camping and hiking", "Trail running", "Travel"], "Light modes\n\nThe number of lighting levels/modes the light has (i.e., low, med, high, flash).": ["4 modes"], "Beam distance - boost": ["80m"], "Beam distance - low": ["6m"], "Beam distance - med": ["20m"], "Beam distance - high": ["42m"], "Boost mode\n\nBriefly increases the light output to maximum brightness and distance.": ["Yes"], "Light source": ["Cree XM-L2 U2 LED"], "Burn time - low": ["90 h"], "Burn time - med": ["24 h"], "Burn time - high": ["10 h"], "Max light output\n\nThe total quantity of light emitted in every direction from a source of light; measured in lumens.": ["500 lumens"], "Beam pattern\n\nBeam pattern affects how much you can see within the area of light thrown from the headlamp. Wide beams are good for close-up; spot or focussed beams are good for long range visibility.": ["Spot"], "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": ["IP X6"], "Rechargeability\n\nRechargeable lights give you hassle-free recharging with almost any power source. Replaceable batteries provide instant power, but you’ll need to bring extra batteries, recycle used ones and buy new ones.": ["Rechargeable"], "Red light mode": ["No"], "Regulated output\n\nOn regulated lights brightness is consistent, and does not decrease gradually as the batteries are drained.": ["Yes"], "Batteries": ["1 16340 (included) or 1 lithium CR123A (not included)"], "Flash mode": ["No"], "Product sustainability": ["Rechargeable batteries"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8963189112862/5061193-BK000.jpg"]}