{"name": "Suunto 9 Baro - Unisex", "categories": ["Home", "All", "Camping and hiking", "Electronics", "GPS Navigation", "GPS watches", "9 Baro"], "description": "Whether you're racing an ultra or trying to beat your PB, Suunto's 9 Baro has the power to be with you every step of the way. Intelligent power management software tracks your battery’s status at all times. Modes and settings are easily changed, giving you enough power for the last kilometer or the next 50. One key reason that Suunto is able to achieve these runtimes is its FusedTrack system. Data from the onboard sensors is combined with limited GPS readings (1 every 1 to 2 minutes), creating a near–GPS-quality track without needing to constantly power the GPS. Preloaded with more than 80 activity profiles, the 9 series is ready for any sport. The optical heart rate monitor adds an extra layer of precision to your training. Pair your watch with a compatible smartphone running the Movescount app, and the 9 Baro gains a whole new feature set. Movescount lets you transfer activities, receive notifications, plan routes using heatmaps, share activities to your social channels, and more. Heatmaps are one of Suunto’s coolest features – they display other Movescount users' activities over local maps, making it easier to find the best runs, rides, trails or swims. Full activity tracking features record your steps and calories, as well as monitor the quality of your sleep, for a 24/7 picture of performance the 9 Baro uses to calculate your recovery times and track your progress.Equipped with Valencell’s optical heart rate monitor (version 1.2), which provides reliable constant heart rate data and allows you to train without a chest strap.Optical heart rate sensors measure changes in blood volume under the skin, and work best when worn snugly, 1 to 3 finger-widths above your wrist bone.Spot check your heart rate at any point and receive a graph of 10 minutes’ or 12 hours’ worth of heart rate data. During an activity, heart rate data is collected every second.FusedTrack™ uses data from the internal sensors to plot your route between GPS points. By combining the data, you get a track that mirrors your actual track, while only checking into GPS once or twice a minute. All of that means a greatly increased battery life. Currently only works for running and trail running, with open water swimming in the works.FusedAlti™ uses a combination of GPS and barometric data to extrapolate the most accurate altitude possible.FusedSpeed™ combines GPS and accelerometer data to provide a more stable running pace.Pre-set intelligent battery profiles change modes to get specific runtimes and features out of the remaining battery.Custom battery profiles allow you to set up exactly what you need for an activity. Saving these modes lets you have specific battery profiles for different activities.Dynamic battery monitoring suggests power changes on the fly, ensuring you have power for the remainder of your activity.Low-battery detection mode switches off everything but the activity timer.Intelligent battery reminders learn your activity patterns and remind you to charge your watch leading up to your activity.Movescount web interface allows customization of modes and display, as well as competition and comparison of activities with other Movescount users, letting you race against friends from all over the world.Movescount enables sharing your metrics with coaches and personal trainers, opening up a whole world of digital training plans and tips.Keeps track of your personal bests by sport and shows progress trends for activities including running, cycling, swimming (Bluetooth heart rate belt required for optimal accuracy in the water), and many more. Seeing these trends is a quick and easy way to gauge the effectiveness of your training.Loaded with more than 80 different sport modes, from running to swimming, cycling and many more.24/7 activity tracking lets it learn your activity level and guide you towards a more active lifestyle.Sleep tracking monitors the quality of your sleep, when you turn in and total sleep, which it uses to calculate recovery times and progress.Barometric altimeter helps you track your ascents, descents and total elevation changes.Storm alarm tracks pressure changes and alerts you when it’s time to find shelter.Tilt compensated digital compass helps keep you headed in the right direction.Bluetooth Smart connects to myriad fitness sensors, from power meters to footpods, as well as smartphones featuring Bluetooth 4.0.Automatically syncs data to paired smartphones running either of the free Suunto apps, Movescount or Suunto.Smart notifications (emails, texts, alerts and more) via Bluetooth connection to a compatible smartphone.Free software updates add functionality and improve performance.User-friendly strap changes, thanks to quick-release pins. Fits any 24mm wide strapsFits wrists 13-23cm.In the box: Suunto 9 Baro, USB cable, quick guide, warranty leaflet.", "product_code": "5062-151", "tech_specs": {"Weight": ["81g"], "Ideal for": ["Running, fitness and training", "Swim training", "Road cycling", "Triathlon"], "Face material\n\nPolycarbonate is inexpensive and light, with good clarity and wear-resistance. Mineral crystal glass offers greater clarity and significantly greater wear-resistance. Sapphire crystal is better still for clarity and wear-resistance.": ["Sapphire crystal"], "Wrist strap material": ["Silicone"], "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": ["IP X8"], "Dimensions": ["5 x 5 x 1.7cm"], "Snooze": ["Yes"], "Countdown timer": ["Yes"], "Stopwatch": ["Yes"], "Electronic compass\n\nAn electronic compass allows the user to view their heading in situations where they are either standing still or moving too slowly for the GPS to detect.": ["Yes"], "12/24 hour format": ["Yes"], "Interface": ["USB", "Wireless"], "Lug width": ["24mm"], "Low battery warning": ["Yes"], "Calorie consumption\n\nCalculated based on data from a heart rate monitor.": ["Yes"], "App compatibility\n\nAn online community where members upload, analyze and share activity data.": ["Suunto", "Movescount"], "Add maps capability\n\nThese units allow you to add maps, so you can mark and name waypoints and create routes on your PC, and then upload the map of your choice to your GPS.": ["No"], "Programmable workouts\n\nWant an easy jog? A fast-paced ride? A workout with lots of variety to keep you on your toes? With programmable workouts you can tailor your training to match whatever you are looking for on a particular day.": ["Advanced"], "New lap auto start\n\nAutomatically triggers a new lap after reaching a specified difference.": ["Yes"], "Heart rate monitor": ["Yes"], "Distance/time alarm": ["Yes"], "Interval training": ["Yes"], "Bluetooth": ["Yes"], "Auto pause\n\nAutomatically pauses timer when you stop or go below a specified pace.": ["No"], "Heart rate in real time\n\nDisplays beats per minute during activity.": ["Yes"], "Calories in real time\n\nDisplays calorie expenditure during activity, based on heart rate monitor data.": ["Yes"], "Speed/cadence sensor\n\nMonitors pedalling cadence and measures pedalling strokes per minute.": ["Sold separately"], "Battery life": ["25 - 336 h"], "Chest strap": ["Sold separately"], "Custom POI\n\nA POI (point of interest) is a specific location that someone may find interesting (i.e., favourite viewpoint, best coffee stop before the trailhead). The custom POI feature allows the user to load only the POI's that interest them onto their GPS unit.": ["Yes"], "Metric/imperial units format": ["Yes"], "Power meter\n\nDisplays output in watts as you ride.": ["Sold separately"], "Unit to unit transfer\n\nShares data wirelessly between compatible units.": ["No"], "Basemap\n\nA basic set of map data that is included with the GPS. Basemap detail may vary from unit to unit.": ["No"], "Area calculation": ["No"], "Tide tables": ["No"], "Battery power indicator": ["Yes"], "Data card": ["Not accepted"], "Foot pod\n\nAttaches to your shoe, captures your running data (i.e., pace, distance), and transmits it to your heart rate monitor or GPS.": ["Sold separately"], "Touch screen": ["Yes"], "Heart rate target zones\n\nDisplays heart rate zones during activity.": ["Yes"], "Barometric altimeter\n\nBarometer function helps forecast weather trends. An altimeter can provide one line of position for location on a topo map, useful if the GPS isn't working.": ["Yes"], "Coded signal\n\nA coded instrument ensures no interference between your chest strap and your watch, necessary if you are training in busy gyms or trails where other signals may be encountered.": ["Yes"], "Workout history": ["Yes"], "Wireless sync": ["Yes"], "WiFi": ["No"], "Button lock": ["Yes"], "Batteries": ["Lithium-ion (included)"], "Haptic feedback": ["Yes"], "Case diameter": ["50mm"], "Virtual partner\n\nAllows user to monitor training goals with either a virtual partner or alarms.": ["No"], "Pause timer\n\nPauses the timer when slowing or stopping, and automatically resumes when moving again.": ["Yes"], "Replaceable wrist strap": ["Yes"], "Pace alarm\n\nAn alarm that notifies you if you vary from a pre-set pace.": ["Yes"], "ANT+ compatible\n\nEnsures seamless digital wireless communication between ANT+ devices. For example, data from an ultra-low power wireless sensor can be displayed on a bike computer or smartphone, then downloaded to a PC, etc.": ["No"], "Made in": ["Finland"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8983214063646/5062151-WHT00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8983464542238/5062151-NOCLR-ALT-BATTERYULTRA.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8983464706078/5062151-NOCLR-ALT-BATTERYPERFORMANCE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8983464738846/5062151-NOCLR-ALT-BATTERYENDURANCE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8983464902686/5062151-NOCLR-ALT-BATTERYCUSTOM.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8983230611486/5062151-WHT00-ALT-SIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8983230644254/5062151-WHT00-ALT-LIFESTYLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8983230677022/5062151-WHT00-ALT-BATTERYMODE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9040043737118/5062151-WHT00-ALT-ALIFESTYLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9040043868190/5062151-WHT00-ALT-ZBATTERYMODE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9040043835422/5062151-WHT00-ALT-ZSIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8983230775326/5062151-BK000-ALT-SIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8983231168542/5062151-BK000-ALT-BATTERYMODE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9040043311134/5062151-BK000-ALT-ALIFESTYLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9040043343902/5062151-BK000-ALT-ZBATTERYMODE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9040043638814/5062151-BK000-ALT-ZSIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8983214096414/5062151-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8983214063646/5062151-WHT00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8983464542238/5062151-NOCLR-ALT-BATTERYULTRA.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8983464706078/5062151-NOCLR-ALT-BATTERYPERFORMANCE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8983464738846/5062151-NOCLR-ALT-BATTERYENDURANCE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8983464902686/5062151-NOCLR-ALT-BATTERYCUSTOM.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8983230611486/5062151-WHT00-ALT-SIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8983230644254/5062151-WHT00-ALT-LIFESTYLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8983230677022/5062151-WHT00-ALT-BATTERYMODE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9040043737118/5062151-WHT00-ALT-ALIFESTYLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9040043868190/5062151-WHT00-ALT-ZBATTERYMODE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9040043835422/5062151-WHT00-ALT-ZSIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8983230775326/5062151-BK000-ALT-SIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8983231168542/5062151-BK000-ALT-BATTERYMODE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9040043311134/5062151-BK000-ALT-ALIFESTYLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9040043343902/5062151-BK000-ALT-ZBATTERYMODE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9040043638814/5062151-BK000-ALT-ZSIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8983214096414/5062151-BK000.jpg"]}