{"name": "Osprey Raptor 14L Pack - Unisex", "categories": ["Home", "All", "Packs and bags", "Daypacks and school bags", "Daypacks", "Raptor 14L Pack"], "description": "A minimal, breathable hydration pack purpose-built for mountain biking. An airy mesh back panel and harness let your back breathe while you're grinding up the trail, and keep the load close to your body when you drop in. The included 2.5L reservoir keeps you plenty hydrated, and its dedicated compartment has a massive zippered opening for easy refills. Zippered hipbelt pockets keep your phone or snacks within easy reach, and in case of trouble, an integrated tool compartment rolls out for trailside repairs.Mesh-covered ridged foam back panel allows maximum ventilation while keeping the load close to the body.Biostretch harness features die-cut foam for breathability and soft mesh contact surfaces. Bike-specific winged shoulder straps wrap around the upper body for added stability.Air mesh hipbelt has 2 zippered pockets to store snacks and other essentials.Dedicated hydration compartment has a huge easy-access zippered opening. Includes an Osprey Hydraulics 2.5L reservoir with a magnetic bite-valve keeper.Integrated tool pouch rolls out of a zippered lower pocket for trailside repairs. It's also completely removable.Lots of pockets keep you organized. There's even a dedicated sleeve for your pump and a soft lined pocket for your sunglasses.Low-profile helmet-carry attachment slips through the vents of your helmet to hold it securely in place.Reflective details and a loop for a blinky light keep you visible on after-dark missions.", "product_code": "5063-825", "tech_specs": {"Weight": ["720g"], "Ideal for": ["Mountain biking"], "Main fabric": ["210-denier ripstop nylon"], "Secondary fabric": ["420-denier nylon"], "Access\n\nThe location of all access points into the main compartment of the pack.": ["Clamshell zip"], "Hipbelt": ["Padded"], "Volume": ["14L"], "Length": ["48cm"], "Width": ["22cm"], "Depth": ["25cm"], "Ventilated back panel": ["No"], "Carry-on sized\n\nSize restrictions vary among airlines. Just to be sure, check with your carrier for their specific restrictions.": ["Yes"], "Additional feature(s)": ["Compression straps", "Helmet attachment", "Hipbelt pocket(s)", "Hydration compatible (reservoir included)", "Reflective details"], "Made in": ["Vietnam"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9017598509086/5063825-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9018914537502/5063825-BK000-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9017598509086/5063825-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9018914537502/5063825-BK000-ALT-BACK.jpg"]}