{"name": "Black Diamond Zone Rock Shoes - Unisex", "categories": ["Home", "All", "Climbing", "Climbing footwear", "Climbing shoes", "Zone Rock Shoes"], "description": "Get in the zone: complete focus, efficient flow, and confident movement. The Black Diamond Zone shoe is made with incredibly breathable mesh upper that stretches where you want, without bagging out. The downturned and aggressive shape, along with the sticky Fuse rubber, helps you get purchase on tiny footholds in steep terrain.Engineered Knit upper provides exceptional fit, breathability and comfort.Double Velcro® straps keep your foot locked in on aggressive heel hooks.Minimal, soft flex midsole keeps things sensitive in steep terrain.Moulded NeoFriction Fuse rubber provides confidence and grip on smears and small edges.Members typically size the same as their street shoe size.", "product_code": "5063-165", "tech_specs": {"Ideal for": ["Rock climbing", "Bouldering", "Indoor climbing"], "Type\n\nA neutral shoe suits long routes and cracks. Moderate shoes allow precision and good edging. Aggressive shoes are downturned and tensioned, for power to the toe on steep or overhanging routes.": ["Moderate"], "Asymmetry\n\nHighly asymmetric shoes allow more precision and focused power. Symmetrical shoes are more comfortable for all-around climbing.": ["High"], "Stiffness\n\nStiffness is provided by the type of sole and the tensioning system. Softer shoes allow more precision. Supportive shoes prevent fatigue.": ["Medium"], "Uppers": ["Synthetic"], "Closure": ["Hook-and-loop"], "Outsoles": ["4.3mm NeoFriction Fuse"], "Lined": ["Partial"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9007161409566/5063165-ALU00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9007161016350/5063165-ALU00-ALT-SIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9007161409566/5063165-ALU00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9007161016350/5063165-ALU00-ALT-SIDE.jpg"]}