{"name": "Cotopaxi Tarak 20L Daypack - Del Dia - Unisex", "categories": ["Home", "All", "Packs and bags", "Daypacks and school bags", "Daypacks", "Tarak 20L Daypack - Del Dia"], "description": "Head to the mountains in a pack that's one-of-a-kind, just like you. The Tarak is super versatile in the backcountry, with a hydration sleeve, low-bulk shoulder straps and removable waist belt, so you can go from day hiking to multipitch climbing, and even backcountry skiing. As part of Cotopaxi's Del Día collection, it's made with remnant materials – so the people who sew it have creative control over its final look. No two packs are alike.Made of durable, lightweight ripstop nylon sourced from fabric remnants.Low-profile shoulder straps and a removable webbing waistbelt reduce weight and bulk.Cushy foam back panel can be removed to save weight, or to double as a seat pad on cold, rough ground.Large main compartment has an internal hydration sleeve.Zippered pockets on the front and lid keep your phone, sunnies and wallet safe.External compression straps, lash points, and ice axe loops let you attach extra gear on the outside.Since each pack is unique, the colours on your pack may differ from those in the image. Sorry, we can’t accommodate specific colour requests (embrace the uncertainty).", "product_code": "5063-854", "tech_specs": {"Weight": ["539g"], "Ideal for": ["Rock climbing", "Backcountry skiing", "Day hiking"], "Main fabric": ["210-denier ripstop nylon"], "Access\n\nThe location of all access points into the main compartment of the pack.": ["Top"], "Hipbelt": ["Removable waistbelt"], "Lid type\n\nSome pack lids can be adjusted to compensate for overloaded packs, or even removed, and some removeable lids have tuck-away hipbelts that allow youto use them as a waistpack.": ["Fixed"], "Volume": ["20L"], "Length": ["53cm"], "Width": ["22cm"], "Depth": ["20cm"], "Carry-on sized\n\nSize restrictions vary among airlines. Just to be sure, check with your carrier for their specific restrictions.": ["Yes"], "Additional feature(s)": ["Hydration compatible (reservoir sold separately)", "Ice axe/pole attachment", "Compression straps"], "Made in": ["Philippines"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9020631646238/5063854-DLD00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9021477617694/5063854-DLD00-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9020631646238/5063854-DLD00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9021477617694/5063854-DLD00-ALT-BACK.jpg"]}