{"name": "MEC Phoenix Sunglasses - Unisex", "categories": ["Home", "All", "Clothing", "Clothing accessories", "Sunglasses", "Sport sunglasses", "Phoenix Sunglasses"], "description": "With a face hugging rimless frame, loaded with photochromatic lenses these sunglasses keep up with you and the changing conditions.Photochromic lenses adjust their tint on the fly, meaning it's right for the conditions – without needin an extra set of lenses.Rimless design with no frame at the bottom is great for use with drop bars.Scratch-resistant polycarbonate lenses.8-base curvature helps to protect you from light coming in at angles.Rubber temple tips and rubber nose pads offer a comfortable fit, that doesn’t shift around.", "product_code": "6000-498", "tech_specs": {"Ideal for": ["Road cycling", "Mountain biking", "Cycle commuting", "Trail running"], "Frame material\n\nTR90 thermoplastic offers good resistance to chemicals and torsion. Propionate is a light, nylon-based, hypoallergenic plastic that's very strong and offers more transparency and gloss than other plastics.": ["TR90 thermoplastic"], "Lens material": ["Polycarbonate"], "Lens performance\n\nFixed tints provide a constant degree of darkness. Photochromic lenses adjust to changing light levels. Polarized lenses absorb horizontal reflected glare to improve clarity around surfaces like snow or water.": ["Photochromic"], "Visible Light Transmission\n\n0-10% – very heavy tint, too dark for most needs. \n10-30% – heavy tint for bright sunny days.\n20-60% – light tint, great for cloudy, overcast conditions and shady trails. \n60-80% – very light tint (often coloured), for improving contrast in low-light conditions, think dawn or dusk. \n80-100% – little to no tint, this what you want in the dark.": ["87-11%"], "Lens width\n\nRefers to the horizontal width in millimeters of one of the frame's lenses.": ["65mm"], "Nose bridge width\n\nThe gap between the lenses, measured at the smallest point.": ["16mm"], "Temple length\n\nThe length of an arm from tip to tip.": ["128mm"], "Lens height\n\nMeasures the height of the lens within the frame, excluding the lens curve.": ["38mm"], "Fits over most eyewear\n\nThese optics are designed to fit comfortably over most eyewear.": ["No"], "100% UVA protected": ["Yes"], "Interchangeable lenses\n\nInterchangeable lenses let you change lenses to suit differing light conditions or activities.": ["No"], "100% UVB protected": ["Yes"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9039073607710/6000498-LXL00.jpg"]}