{"name": "Arc'teryx Atom LT Hoody - Women's", "categories": ["Home", "All", "Clothing", "Jackets", "Insulated jackets", "Atom LT Hoody"], "description": "An insulating layer for active pursuits. It warms your core and won't hold you back climbing, hiking or skiing. Coreloft™ fill provides reliable warmth, feels weightless and is highly compressible. Layer it under a shell or wear it as your stand-alone jacket in cool weather. So functional and  sleek, it's the unofficial uniform of mountain towns word wide.Taffeta nylon shell is DWR treated for water resistance.Coreloft™ synthetic insulation is lightweight, breathable and warm.Air-permeable stretch fleece side panels.Underarm gussets and articulated elbows for range of motion.Adjustable storm hood.Full front zip has \"speed bumps\" to prevent it from opening accidentally.Handwarmer pockets and internal chest pocket have secure zips.Stretch knit cuffs fit over gloves.Adjustable hem with slight drop in back.", "product_code": "6000-889", "tech_specs": {"Weight": ["330g (Medium)"], "Ideal for": ["Backcountry skiing", "Climbing", "Snowshoeing", "Camping and hiking"], "Type": ["Insulated synthetic"], "Technology": ["Coreloft"], "Face fabric": ["20-denier nylon"], "Lining/backer": ["20-denier nylon"], "Insulation": ["60g/sq. m polyester"], "Waterproofness\n\nWaterproof garments use waterproof-breathable technologies and are fully seam-taped. Water-resistant garments use waterproof-breathable technologies but their seams are not taped. Water-resistant garments repel water and protect against wind but are not made of waterproof fabric.": ["Water-resistant"], "Pockets": ["1 internal zippered", "2 front zippered"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["Wind-resistant"], "Length": ["Hip-length"], "Durable water repellency\n\nUsually referred to as DWR. A treatment made to fabrics that causes water to bead and run off instead of soaking through.": ["Yes"], "Hood": ["Adjustable", "Low-profile", "Insulated"], "Made in": ["Bangladesh"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9045915041822/6000889-BK000.jpg"]}