{"name": "DPS Skis Wailer F112 RP Skis - Men's", "categories": ["Home", "All", "Ski and snowboard gear", "Downhill skiing gear", "Downhill skis", "Wailer F112 RP Skis"], "description": "This Wailer is an all-mountain, all-season ski with maximum versatility – and it gives you a ton of ski for the money.  Reimagined with Foundation construction, the new Wailer 112 brings DPS innovation to more skiers. It serves up a sweet balance of dampness, power and lightness and great on-snow feel. Its revised shaping features a longer fore-body and new flex pattern to ride out the chatter and give it \"boof\" in the soft stuff.Foundation construction focuses on materials and shape to create a beautiful blend of power and dampness that's accessible to a wide range of skiers.Bamboo and poplar core helps find a balance between dampening, responsiveness and weight.Unidirectional carbon and triaxial fiberglass helps improve stiffness and ability to transfer power.Textured nylon top sheet is very durable.Paddle tech sidecut is tapered, with flatter sections that blend at the contact points to make it a smooth, smooth driver.Sidewalls are UHMW (Ptex).Wide profile Rockwell 48 steel edges provide excellent edge control without sacrificing a playful, floaty ride.World Cup Race base is fast and hard for exceptional performance.", "product_code": "6001-616", "tech_specs": {"Weight": ["3.68kg (168cm)", "3.96kg (178cm)", "4.22kg (184cm)", "4.6kg (189cm)"], "Ideal for": ["Freeride and freeskiing", "Downhill skiing"], "Snow conditions": ["Powder", "Mixed"], "Terrain": ["Off-Piste"], "Ability\n\nBeginner: new or getting back into skiing.  Intermediate: confident with turning and stopping.  Advanced: highly confident carver. Expert: steeps, drops, park, double blacks -- bring it on.": ["Intermediate", "Advanced", "Expert"], "Construction\n\nSandwich and combination construction is generally used for big freeride-style skis while the lighter structural cap type of construction is more commonly found on cross-country skis.": ["Sandwich"], "Core": ["Wood"], "Rocker/camber profile": ["Rocker tip", "Rocker tail"], "Dimension": ["139/112/124mm (168cm)", "140/112/125mm (178cm)", "140/112/127mm (184cm)", "141/112/129mm (189cm)"], "Turning radius": ["15m"], "Bindings included": ["No"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9049627623454/6001616-GYE00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9049626705950/6001616-GYE00-ALT-ROCKER.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9049627623454/6001616-GYE00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9049626705950/6001616-GYE00-ALT-ROCKER.jpg"]}