{"name": "Merrell MTL Astrum Winter Trail Running Shoes - Women's", "categories": ["Home", "All", "Run and fitness", "Running and training footwear", "Running shoes", "Trail running shoes", "MTL Astrum Winter Trail Running Shoes"], "description": "Rugged, offroad snow tires for your feet, ready to take on trails in the coldest weather. Heat-reflective technology in the upper and insole radiate your body heat back towards your foot, and a stretch collar prevents snow and slush from coming in over the top. The rubber compound and lug pattern are inspired by snow tires, and are designed to keep you stable in winter conditions.Synthetic and textile upper has heat-reflective tech.Lycra® neoprene stretch collar keeps out snow and trail debris.M Select™ Shield water repellent treatment resists slush and mud.Heat-reflective insole.Compression-moulded FlexConnect EVA midsole for stable cushioning.Midsole flex grooves provide a responsive, agile feel.TrailProtect rock plate protects foot by distributing pressure while maintaining natural forefoot flexibility.Triple-density Vibram® rubber outsole grips snow, ice and mud.5mm lugs give you traction in loose terrain.", "product_code": "6002-305", "tech_specs": {"Weight": ["1.1kg (7)"], "Ideal for": ["Trail running"], "Feel\n\n'Minimal and natural' shoes offer low drop, lots of flex, and minimal cushioning. Most running shoes are 'Light and responsive' with medium cushioning and good energy return. 'Cushioned and floaty' shoes have maximum cushioning.": ["Light and responsive"], "Stability\n\nSome shoes include added motion control or stability features to help minimize over pronation, where the foot tends to roll inward in a biomechanically imbalanced running position.": ["Neutral"], "Upper material": ["Synthetic"], "Closure": ["Quick pull"], "Heel-to-toe cushioning\n\nThe approximate thickness of the midsole cushioning under the heel and the forefoot. A thicker heel and greater difference between heel and toe height tends to suit heel-strike runners, while forefoot and midfoot strikers may prefer a minimal drop between heel and toe cushioning.": ["31-25mm"], "Drop\n\nThe drop is the difference in height between the heel and the forefoot midsole cushioning. Traditional running shoes tend to have a 10mm drop or higher while minimalist style shoes are on the lower end of the spectrum.": ["6mm"], "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": ["No"], "Removable insole": ["Yes"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9038250278942/6002305-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9038665613342/6002305-BK000-ALT-LATERAL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9038666006558/6002305-BK000-ALT-HEEL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9038666268702/6002305-BK000-ALT-MEDIAL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9038666334238/6002305-BK000-ALT-TOE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9038666367006/6002305-BK000-ALT-SOLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9038250278942/6002305-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9038665613342/6002305-BK000-ALT-LATERAL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9038666006558/6002305-BK000-ALT-HEEL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9038666268702/6002305-BK000-ALT-MEDIAL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9038666334238/6002305-BK000-ALT-TOE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9038666367006/6002305-BK000-ALT-SOLE.jpg"]}