{"name": "Salomon MTN Explore Ski Boots - Women's", "categories": ["Home", "All", "Ski and snowboard gear", "Backcountry skiing gear", "Backcountry ski boots", "MTN Explore Ski Boots"], "description": "These all-mountain boots underwrite your quest for touring fit and performance. The MTN Explore Ski Boots hike up like light touring boots and ski down like nimble downhill chargers. With 63 degrees of motion, they feel easy and natural on a long hike up. Thermoformable liners and shell tune the fit with precision, while the light weight encourages you to put the skins back on and go up for another lap.Grilamid lower shell with a Polyolefin cuff.Custom Shell HD technology makes for a heat-mouldable shell to provide the best fit possible.Carbon fibre spine is rigid to allow a wide range of motion and forward flex.Motion Flex Technology offers 63 degrees of motion.24mm riveted oversized pivot reduces play for precision and direct power transmission.Textile cover on lower tongue saves weight and adds comfort in walk mode.Ultralight thermoformable 3D liner with 2 pull loops is preshaped and has biovent ventilation.Surelock ski/walk mechanism has metal-on-metal locking system for reliable support.2 buckles and a 35mm Velcro® booster strap.Contragrip sole provides grip and the rockered sole allows a natural walking motion.Low-tech inserts included.", "product_code": "6003-833", "tech_specs": {"Weight": ["1.27kg (24.5)"], "Ideal for": ["Alpine touring", "Freeride and freeskiing"], "Boot/binding compatibility\n\nThe boot and binding systems must match for best performance and safe use.": ["Alpine touring", "Tech"], "Buckles": ["2"], "Lower shell material": ["Grilamid"], "Shell cuff material": ["Polymer"], "Sole type\n\nAlpine Touring: with tread; compatible with DIN touring bindings. Alpine Touring Tech (Tech): with tread; compatible with G3 Onyx and Dynafit. Downhill: without tread; compatible with freeride/downhill bindings.": ["Alpine Touring", "Tech"], "Range of motion\n\nThe range of motion of the boot when in hike mode.": ["63º"], "Flex index\n\nIndicates how stiff the boots are when flexed forward.  Flex ranges from 50 (soft) to 130 (very stiff). Note: There is currently no industry standardized test.": ["90"], "Last width\n\nThe width of the interior of the boot shell across the widest part of the forefoot.": ["98-104mm"], "Lace-up option": ["Yes"], "Thermoformable inner boot": ["Yes"], "Hike mode\n\nA mechanism that allows to release the boot cuff to switch to tour mode.": ["Yes"], "Made in": ["Romania"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9053388734494/6003833-WSB01.jpg"]}