{"name": "Showers Pass Crosspoint Waterproof Knit Gloves - Unisex", "categories": ["Home", "All", "Cycling", "Cycling clothing", "Cycling clothing accessories", "Cycling gloves", "Crosspoint Waterproof Knit Gloves"], "description": "Keep your fingers warm and dry during your rainy commute. The waterproof-breathable membrane ensures your hands won't get soaked, and the synthetic-blend inner liner keeps you sweat-free.Outer fabric is wear-resistant nylon knit with a bonded Artex waterproof-breathable membrane.Moisture-wicking CoolMax blend liner keeps hands dry.Silicone print on palm keeps grip even in wet conditions.Low-profile fit and an ergonomic fit for finger dexterity.As of 2020 Showers Pass is Climate Neutral certified, meaning they fully offset their carbon emissions. Climate Neutral certified is a consumer label that's carried by brands who take responsibility for greenhouse gas emissions generated in production, operation and shipping of  their goods and services.", "product_code": "6003-639", "tech_specs": {"Ideal for": ["Cycle commuting", "Urban cycling", "Cycle touring", "Running"], "Type": ["Gloves"], "Main fabric": ["95% nylon", "5% rubber"], "Liner fabric": ["88% polyester", "10% nylon", "2% Lycra Spandex"], "Palm material\n\nThe type of material used on the palm of the glove. Grippy palms have a raised silicone or polyurethane pattern to improve grip and are most often seen on cycling and paddling handwear.": ["Grippy palm"], "Liner type": ["Sewn-in"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["Windproof"], "Touchscreen compatible": ["No"], "Waterproof": ["Yes"], "Made in": ["Taiwan"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9052092203038/6003639-NGR00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9052296445982/6003639-BK000-ALT-LIFESTYLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9052091875358/6003639-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9052092203038/6003639-NGR00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9052296445982/6003639-BK000-ALT-LIFESTYLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9052091875358/6003639-BK000.jpg"]}