{"name": "Salomon X Access 60 Wide Ski Boots - Women's", "categories": ["Home", "All", "Ski and snowboard gear", "Downhill skiing gear", "Downhill ski boots", "X Access 60 Wide Ski Boots"], "description": "Buckle up and blast off. With a softer flex, these accessible boots are a great choice for recreational skiers with a fun-first attitude. Fine tuned for female anatomy, the cuff and liner are shaped to prevent ankle slop and heel lift. The liner is comfortable enough to ski out of the box, but it can also be thermo-moulded for some bonus boot bliss. Easy to handle and perfect to progress in, these boots are ready to rip and ride this season.Twinframe technology in the shell provides progressive flex without overpowering stiffness.Flex comfort liner can be thermo-moulded for an instant custom fit.Oversized pivot transfers power smoothly and efficiently.Women's specific cuff and liner are tailored to female anatomy.Calf adjuster lets you find the right height in the back of the shell.4 plastic buckles and a 28 mm strap secures the foot.104mm last accommodates wide feet or gives room for thicker socks.Alpine soles and Grip-Walk ready.", "product_code": "6003-827", "tech_specs": {"Weight": ["3.1kg (24.5)"], "Ideal for": ["Downhill skiing"], "Boot/binding compatibility\n\nThe boot and binding systems must match for best performance and safe use.": ["Downhill"], "Buckles": ["4"], "Lower shell material": ["Polypropylene"], "Shell cuff material": ["Polypropylene"], "Sole type\n\nAlpine Touring: with tread; compatible with DIN touring bindings. Alpine Touring Tech (Tech): with tread; compatible with G3 Onyx and Dynafit. Downhill: without tread; compatible with freeride/downhill bindings.": ["Downhill"], "Flex index\n\nIndicates how stiff the boots are when flexed forward.  Flex ranges from 50 (soft) to 130 (very stiff). Note: There is currently no industry standardized test.": ["60"], "Last width\n\nThe width of the interior of the boot shell across the widest part of the forefoot.": ["104mm"], "Lace-up option": ["No"], "Thermoformable inner boot": ["Yes"], "Hike mode\n\nA mechanism that allows to release the boot cuff to switch to tour mode.": ["No"], "Made in": ["Romania"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9056556974110/6003827-BK000.jpg"]}