{"name": "Intense 2020 Tracer 27.5 Elite Bike - Unisex", "categories": ["Home", "All", "Cycling", "Bikes", "Mountain bikes", "2020 Tracer 27.5 Elite Bike"], "description": "Your ticket to shred. 160mm of front travel, slack geometry and a carbon fibre frame make it a certified enduro weapon. Point the Tracer downhill and expect it to handle everything from big hits to mind-bending rock gardens. The JS-Tuned suspension soaks up drops and chuddery sections of trail with powerful, burly elegance. The Elite model is the pinnacle of the Tracer build series with hyperlight, no-nonsense parts. Trail-ready FOX components handle all of your suspension needs. A carbon wheelset rolls in the absence of gravity. The 1x12 SRAM Eagle X01 with carbon crankset leverages a mega 10-50t cassette and an X01 derailleur and shifter for consistent, rapid-fire performance. Get rowdy and go hard, because the Shimano brakes have you covered with 180mm rotors in the front and rear.Monocoque unidirectional carbon frame and top link provides a light, stiff and compliant ride.JS Tuned rear linkage results in efficient and balanced ride on climbs or descents.Low standover height improves maneuverability and stability.Suspension link nested directly above the BB allows for a reduction in chainstay length and a shorter wheelbase.Internal routing prevents cable rattle and keeps them protected.FOX Performance Float 36 fork provides 160mm of travel, and can be locked out and tuned.FOX Performance Float X2 rear shock with 165mm of travel.FOX Transfer Factory seatpost offers 125mm (S) 150mm (M/L) or 175mm (XL) of travel.SRAM X01 Eagle 12-speed shifter and rear derailleur leverages a massive 10-50 cassette.Truvativ Descendent carbon crankset uses pressfit DUB standard with a 32T chainring.Shimano XT M8020 hydraulic disc brakes with 180mm rotors.780mm wide Intense Recon carbon handlebars provide a comfortable riding position.Fabric Scoop Radius Elite saddle is ultra comfy.148x12mm spacing in the rear and 110x15mm in the front boosts stiffness.E13 LG1 Endura Race carbon rims with 30mm internal width laced to E13 LG1 hubs.Maxxis Minion DHF/DHR2 are 2.4in. wide on the rear and 2.5in. wide on the front.Bikes are covered by MEC's Rocksolid Guarantee and Bike Service Agreement. You can bring your Intense Bike to any MEC bike shop for free adjustments and minor maintenance for 1 year after purchase.Includes an Intense gift box with over $150 of free stuff – like a torque wrench set, shock pump, and extra valve stems for going tubeless.Based in Temecula, California, Intense Cycles has been building aggressive, game-changing and flat-out rad mountain bikes since 1993.", "product_code": "6005-833", "tech_specs": {"Weight": ["13.24kg (Medium)"], "Ideal for": ["Enduro", "Trail riding"], "Frame": ["Intense Tracer 27.5 carbon"], "Front travel": ["160mm"], "Fork": ["Fox Float 36 Factory GRIP2"], "Rear shock": ["Fox Float Performance X2"], "Rear travel": ["165mm"], "Stem": ["Intense Recon Elite 40mm 31.8mm"], "Seatpost": ["Fox Factory Transfer with 150mm travel"], "Headset": ["Cane Creek 40"], "Handlebars": ["Intense Recon Carbon 780mm 31.8mm"], "Grips/tape": ["Intense Dual Density Lock-on"], "Brakes\n\nMechanical disc brakes are more powerful than rim brakes, but less powerful than hydraulic brakes.": ["Shimano XT (hydraulic disc)"], "Brake levers": ["Shimano XT"], "Shifters": ["SRAM X01 Eagle"], "Derailleur (front)": ["N/A"], "Derailleur (rear)": ["SRAM X01 Eagle"], "Crank + rings": ["Truvativ Descendant Carbon 32T"], "Bottom bracket": ["Truvativ Pressfit DUB"], "Pedals": ["Sold separately"], "Hub (front)": ["LG1"], "Hub (rear)\n\nThe hub affects a bike’s rolling efficiency. Internally geared hubs require significantly less maintenance.": ["LG1"], "Cassette\n\nCassettes with a smaller range allow you to go faster; a bigger range makes climbing hills easier.": ["SRAM XG-1295 Eagle 12-speed 10-50T"], "Chain": ["SRAM Eagle X01"], "Spokes": ["E13"], "Rims": ["E13 LG1 Enduro Race Carbon"], "Tires": ["Maxxis Minion DHR II 27.5 x 2.4"], "Saddle": ["Fabric Scoop Radius Elite"], "Made in": ["Taiwan"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9061494292510/6005833-SGR05.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9061509365790/6005833-SGR05-ALT-ANGLEBACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9061509333022/6005833-SGR05-ALT-ANGLEFRONT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9061494292510/6005833-SGR05.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9061509365790/6005833-SGR05-ALT-ANGLEBACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9061509333022/6005833-SGR05-ALT-ANGLEFRONT.jpg"]}