{"name": "Zamberlan 1111 Cresta Gore-Tex RR Backpacking Boots - Men's", "categories": ["Home", "All", "Camping and hiking", "Hiking footwear", "Hiking boots", "1111 Cresta Gore-Tex RR Backpacking Boots"], "description": "These hiking and backpacking boots are ready to take on rugged trails. Thick Tuscan leather holds your feet in place and the rubber toe cap and heel add durability in high-wear areas. Vibram® Curcuma outsole sticks where you strike and won’t give out during downhill braking. Built-in GORE-TEX® booties provide waterproofness with breathability.Uppers are Zamberlan Hydrobloc full-grain leather, treated for water repellency and durability.GORE-TEX Performance Comfort membrane is thermo-sealed into a bootie then fixed to the upper and glued to the midsole.Flex panels improve ankle mobility for a more natural stride.3mm PE insoles control flexibility and distribute load.Rubber toe cap adds protection from rocks and other trail debris.Polyurethane midsoles cushion feet for comfort and feel stiff and stable on rough terrain.Vibram® rubber outer sole with multi-directional lugs provides good traction on a variety of surfaces.", "product_code": "6005-951", "tech_specs": {"Weight": ["1.4kg (42)"], "Ideal for": ["Backpacking"], "Upper material": ["Full-grain leather"], "Closure": ["Lace-up"], "Rand\n\nRubber on the toe and around the boot improves durability. It can also increase grip while scrambling.": ["Toecap"], "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": ["Yes"], "Removable insole": ["Yes"], "Made in": ["Italy"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9085234937886/6005951-WXB01.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9080531812382/6005951-WXB01-ALT-SOLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9080531910686/6005951-WXB01-ALT-TOP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9085234937886/6005951-WXB01.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9080531812382/6005951-WXB01-ALT-SOLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9080531910686/6005951-WXB01-ALT-TOP.jpg"]}