{"name": "Salomon Sense Ride 3 Gore-Tex Invisible Fit Trail Running Shoes - Women's", "categories": ["Home", "All", "Run and fitness", "Running and training footwear", "Running shoes", "Trail running shoes", "Sense Ride 3 Gore-Tex Invisible Fit Trail Run"], "description": "Breeze through your longest trail runs in lightweight waterproof running shoes. Invisible Fit technology adds waterproof-breathable protection with next-to-no additional weight. Seamless design and internal fit sleeves let you run sockless if you want to (you do you). A rock plate and toecap protect forefoot and toes from rocks and roots, and a responsive foam midsole cushions your landing and lets you use that energy for the next step. A grippy rubber sole offers excellent traction on slippery rocks, loose gravel and muddy sections.Light seamless mesh upper delivers a soft and comfortable feel with a secure fit.GORE-TEX® Invisible Fit technology provides reliable waterproofing with outstanding breathability.Internal SensiFit offers a performance fit ideal for high-output activity.Quicklace closure provides a secure fit with a single pull and includes a lace pocket.OptiVibe midsole provides durable shock absorption and reduces vibration through the sole.Revised 3D chassis delivers improved stability on technical terrain.Profeel Film protects the base of your foot from sharp objects.Contagrip MA outsole is designed for varied terrain with reliable grip on wet or rocky trails.Molded Ortholite insole is comfortable and smooth-fitting.", "product_code": "6006-217", "tech_specs": {"Weight": ["500g (7)"], "Ideal for": ["Trail running"], "Feel\n\n'Minimal and natural' shoes offer low drop, lots of flex, and minimal cushioning. Most running shoes are 'Light and responsive' with medium cushioning and good energy return. 'Cushioned and floaty' shoes have maximum cushioning.": ["Light and responsive"], "Stability\n\nSome shoes include added motion control or stability features to help minimize over pronation, where the foot tends to roll inward in a biomechanically imbalanced running position.": ["Neutral"], "Upper material": ["Mesh", "TPU"], "Closure": ["Quick pull"], "Heel-to-toe cushioning\n\nThe approximate thickness of the midsole cushioning under the heel and the forefoot. A thicker heel and greater difference between heel and toe height tends to suit heel-strike runners, while forefoot and midfoot strikers may prefer a minimal drop between heel and toe cushioning.": ["27-19mm"], "Drop\n\nThe drop is the difference in height between the heel and the forefoot midsole cushioning. Traditional running shoes tend to have a 10mm drop or higher while minimalist style shoes are on the lower end of the spectrum.": ["8mm"], "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": ["Yes"], "Removable insole": ["Yes"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9078499409950/6006217-TSA01.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9077654192158/6006217-TSA01-ALT-HEEL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9077654224926/6006217-TSA01-ALT-LACES.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9077654323230/6006217-TSA01-ALT-LACES2.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9077654355998/6006217-TSA01-ALT-ONMODEL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9077654454302/6006217-TSA01-ALT-SOLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9077654618142/6006217-TSA01-ALT-SOLEDETAIL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9077654650910/6006217-TSA01-ALT-TOPS.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9078499409950/6006217-TSA01.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9077654192158/6006217-TSA01-ALT-HEEL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9077654224926/6006217-TSA01-ALT-LACES.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9077654323230/6006217-TSA01-ALT-LACES2.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9077654355998/6006217-TSA01-ALT-ONMODEL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9077654454302/6006217-TSA01-ALT-SOLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9077654618142/6006217-TSA01-ALT-SOLEDETAIL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9077654650910/6006217-TSA01-ALT-TOPS.jpg"]}