{"name": "Pearl Izumi Bioviz Barrier Jacket - Men's", "categories": ["Home", "All", "Cycling", "Cycling clothing", "Cycling tops", "Cycling jackets", "Bioviz Barrier Jacket"], "description": "For better presence on the road. This light shell blocks the wind and repels light rain. But that's not all. Highly reflective Bioviz® details make you extra visible on the road, even in low light conditions. And with 360 degress of reflective prints, other road users can easily spot you from any angle.BioViz® reflective print maximizes visibility to improve your safety.Recycled polyester fabric with a DWR finish cuts wind and sheds light precipitation.2-way zipper closes smoothly and lets you vent from the top or bottom.Silicone gripped hem keeps the jacket in place at the back.Rear pocket.Hem is adjustable from both sides.\n\n        Sustainability\n\n\n\n\n\n.st0{stroke:#333;stroke-width:.79;stroke-miterlimit:10}\n\n\n\n\n\n\n\n\n                      Recycled content", "product_code": "6007-228", "tech_specs": {"Ideal for": ["Road cycling", "Cycle commuting", "Urban cycling"], "Type": ["Wind shell"], "Waterproofness\n\nWaterproof garments use waterproof-breathable technologies and are fully seam-taped. Water-resistant garments use waterproof-breathable technologies but their seams are not taped. Water-resistant garments repel water and protect against wind but are not made of waterproof fabric.": ["Water-resistant"], "Pockets": ["1 back zippered"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["Wind-resistant"], "Length": ["Hip-length"], "Durable water repellency\n\nUsually referred to as DWR. A treatment made to fabrics that causes water to bead and run off instead of soaking through.": ["Yes"], "Additional feature(s)": ["Reflective details", "2-way zipper"], "Product sustainability": ["Recycled content"], "Made in": ["Vietnam"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9075419906078/6007228-SYR99.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9075437305886/6007228-SYR99-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9075419906078/6007228-SYR99.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9075437305886/6007228-SYR99-ALT-BACK.jpg"]}