{"name": "Arc'teryx Sabre LT Bib Pants - Men's", "categories": ["Home", "All", "Ski and snowboard gear", "Ski and snowboard clothing", "Ski and snow pants", "Sabre LT Bib Pants"], "description": "Designed to handle the demands of aggressive skiers on- or off-piste, the Sabre LT bibs are waterproof-breathable and ruggedly built. Long thigh vents let you dump heat during high energy chair laps and bootpacks, while the roomy fit accommodates multiple layers for cold descents. The overall build quality is top-notch, with durable kick patches, tight seam tolerances and articulated construction that won't hold you back on the down or the up.Completely waterproof, breathable and durable GORE-TEX construction.Hard-wearing 80-denier face fabric.C-KNIT™ lining backer is soft and breathable.Wee Burly™ softshell bib has plenty of stretch for ease of movement.Micro seam allowance of 1.6mm and extra narrow 8mm seam tape reduce bulk and weight.Articulated construction and gusseted crotch for freedom of movement.Front fly with snap closure.Thigh zips for easy venting.Highly water-resistant external zippers used throughout.Durable kick patches protect against ski edges.Powder cuffs with gripper elastic keep snow out.", "product_code": "6009-706", "tech_specs": {"Weight": ["620g (Medium)"], "Ideal for": ["Backcountry skiing", "Downhill skiing"], "Type": ["Waterproof-breathable"], "Technology": ["GORE-TEX", "GORE-TEX C-Knit"], "Construction": ["3-layer"], "Face fabric": ["80-denier nylon"], "Lining/backer": ["80-denier nylon"], "Fabric waterproof rating\n\nThe standard test for waterproof fabrics uses a standing column filled with water.  The figures given are the water column height.  A rating of 3,500mm or higher can be considered waterproof.  The higher the rating, the more durable the waterproof fabric will be over time.": ["28,000mm"], "Waterproofness\n\nWaterproof garments use waterproof-breathable technologies and are fully seam-taped. Water-resistant garments use waterproof-breathable technologies but their seams are not taped. Water-resistant garments repel water and protect against wind but are not made of waterproof fabric.": ["Waterproof with fully taped seams"], "Fabric active breathability\n\nThe rate at which a waterproof breathable fabric expels moisture when the inner surface is moist from perspiration.  Values under 8,000g/m2/24h provide low performance, 20,000g/m2/24h provide moderate performance and values over 30,000g/m2/24h provide high performance.": ["20,000g/m2/24h"], "Venting": ["Thigh vents"], "Pockets": ["1 side zippered", "1 thigh", "1 front zippered"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["Windproof"], "Durable water repellency\n\nUsually referred to as DWR. A treatment made to fabrics that causes water to bead and run off instead of soaking through.": ["Yes"], "Additional feature(s)": ["Gusseted crotch", "Kick patches", "Internal gaiters", "Suspenders"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9154483159070/6009706-BK000.jpg"]}