{"name": "AfterShokz Aeropex Bone Conduction Headphones", "categories": ["Home", "All", "Camping and hiking", "Electronics", "Radios and headphones", "Headphones", "Aeropex Bone Conduction Headphones"], "description": "Hear your music and your world. Tipping the scales at only 26g the Aeropex are Aftershokz lightest pair of bone conduction headphones to date. Refined design is stable and comfortable on the go.The adjusted angles on the transducers improves sound quality, with higher highs and thumping low bass notes. Need to stay tuned in to what happening around you? That's where bone conduction come in, it lets you hear music and other sounds you need to take in.Bone conduction sends sound vibrations directly to your inner ear, so your ear canal stays free to hear other sounds.Dual noise cancelling microphones help remove noise pollution, making voices crisp and clear.Titanium band is lightweight, strong and provides an even, comfortable pressure.Bluetooth 5.0 is easy on your battery, has multi-point pairing and a 40m range.Waterproof design isn’t bothered by sweat or rain.8 hours of playback or 10 days of stand-by from a single charge.Included magnetic charging cable fully charges in 2 hours (1A/5V max).LED power indicator lets you know how your battery is doing.Integrated buttons let you answer calls, control your music and more.In the box: headphones, storage pouch, earplugs, 2 x magnetic USB charging cable and documentation.", "product_code": "6009-244", "tech_specs": {"Weight": ["26g"], "Ideal for": ["Fitness and training", "Running", "Everyday use"], "Microphone": ["Internal mic"], "Frequency response": ["20Hz-20kHz"], "Inline control": ["Yes"], "Bluetooth": ["Yes"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9069490765854/6009244-COS24.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9068658327582/6009244-COS24-ALT-LIFESTYLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9068658425886/6009244-COS24-ALT-LIFESTYLE2.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9069490765854/6009244-COS24.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9068658327582/6009244-COS24-ALT-LIFESTYLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9068658425886/6009244-COS24-ALT-LIFESTYLE2.jpg"]}