{"name": "Tacx Neo 2T Smart Trainer - Unisex", "categories": ["Home", "All", "Cycling", "Training and electronics", "Bike trainers and accessories", "Bike trainers", "Neo 2T Smart Trainer"], "description": "The most advanced bike trainer available. Powerful, accurate and realistic. The Tacx Neo 2T have been improved again, with redesigned magnets, making your training experience even quieter with less sway. Full pedal stroke analysis lets you measure your left and right leg power individually. The road surface simulation blurs the line between virtual and real rides so you can really feel the cobblestones of Paris-Roubaix. And since this is a direct-drive trainer, you don’t need to think twice about slippage with no need for calibration. Press uphill with up to 2200W of resistance and 25% incline, or coast down -5% descents. The Neo 2T is the strong but silent type, so you can ride when your kids or dogs are still snoozing. It links with the usual bike app suspects, so you can cruise and compete with friends (or foes).Magnetic trainer provides a predicatable and consistent linear increase in resistance.Direct drive trainer accounts for every Watt you generate.Power reading accuracy of 1% ensures maximum precision in your training.A new powerful chip and memory upgrade makes the Neo 2 ready for future development.Cassette body fits Shimano and SRAM 8-12 speed cassettes. Campy, SRAM XD and SRAM XD-R body sold separately.Can be controlled by Tacx's app, Zwift, TrainerRoad, Kinomap or other apps.FE-C control lets your app of choice change resistance.ERG mode allows you to maintain a certain effort level regardless of your cadence.Road feel replicates cobblestones, cement plates, gravel roads and other surfaces.Realistic slope simulation of up to 25% and descent to -5%.Maximum brake power of 2200W.Virtual flywheel ensures you get a realistic simulation based on your weight and the course you're riding.Road feel and downhill drive won't be available when used without external power.Integrated LED light gauges intensity.Suits axles in Race 130mm, MTB 135mm, 142 mm and 148 mm.Adapters included for 142x12mm and 148x12mm axles. Adapter for 135x10mm available separately.Cassette available separately.", "product_code": "6009-023", "tech_specs": {"Weight": ["21.5kg"], "Ideal for": ["Cycle training"], "Resistance type\n\nHow the trainer delivers resistance to the rear wheel of your bike.": ["Electromagnetic", "Electric motor"], "Broadcast communication protocol\n\nANT+ is standard and will work with any ANT+ compatible device. Bluetooth communication, while not standard for bike trainers, works with many software packages and devices.": ["ANT+", "Bluetooth Smart"], "Wireless resistance control\n\nVirtual rides and device-controlled training require wireless communication. ANT+ FE-C is a device independent standard. Bluetooth protocol is not standardized, but will communicate with smartphones and tablets without an ANT+ adapter.": ["ANT+ FE-C", "Bluetooth Smart"], "Data type\n\nPower, cadence and speed are helpful for training sessions. This data can be transmitted to apps or software to create virtual rides or to pace yourself when training.": ["Cadence", "Power", "Speed"], "Maximum slope simulation": ["25%"], "Maximum resistance at 40Km/h": ["2200W"], "Dimensions": ["57.5 x 75 x 55cm"], "External power supply required\n\nIf an external source is required, your trainer needs to be plugged into an outlet, or if unplugged, will have a reduced number of features.": ["Yes"], "Zwift Certified\n\nZwift certified trainers can have their resistance controlled by the software for a realistic experience.": ["Yes"], "Adjustable resistance": ["Yes"], "Folding\n\nTrainer can be folded flat for storage.": ["Yes"], "Made in": ["Netherlands"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9061500813342/6009023-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9061512871966/6009023-BK000-ALT-FOLDED.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9061512970270/6009023-BK000-ALT-SIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9061513199646/6009023-BK000-ALT-SIDE2.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9061500813342/6009023-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9061512871966/6009023-BK000-ALT-FOLDED.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9061512970270/6009023-BK000-ALT-SIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9061513199646/6009023-BK000-ALT-SIDE2.jpg"]}