{"name": "Helle Kletten Folding Knife", "categories": ["Home", "All", "Camping and hiking", "Tools and accessories", "Knives and tools", "Pocket knives and fixed blade knives", "Folding pocket knives", "Kletten Folding Knife"], "description": "What makes a Helle knife special? Natural handle material? Check – beautiful curly birch scales that fit perfectly in your hand. Classic grind? Check – outfitted with the iconic Scandi grind. Quality steel? Check – like all Helle knives, the Kletten’s blade uses their classic laminated steel. Tipping the scales at only 84g this EDC powerhouse performs way above its weight class.Laminated steel sandwiched between softer steel sides for toughness and edge retention, that's still easy to sharpen.Scandinavian (Scandi) grind excels at everyday tasks.Handle scales are carved out of curly birch wood.Sculpted guard keeps fingers safe from the edge.Lined lanyard tube for your personalized lanyard.Time-tested lock-back design is easy to operate and keeps the blade in place when in use.Simple and reliable nail-nick blade access.Helle knives have been made in a small Norwegian village since 1932.  Created by craftsman who take pride in their work. Each knife has passed through experienced hands on its way to your pocket.Natural materials, give each knife its own personality with variations in colour and patterns.", "product_code": "6010-197", "tech_specs": {"Weight": ["84g"], "Ideal for": ["Everyday use", "Day hiking"], "Handle material": ["Wood", "Stainless steel"], "Sheath material": ["Leather"], "Blade edge type\n\nSerrated edges are useful for cutting dense material like rope or webbing. They stay sharper longer than straight edges, but can be more difficult to sharpen.": ["Straight"], "Blade material": ["Stainless steel"], "Blade length": ["5.5cm"], "Knife length (closed)": ["8cm"], "Knife length (open)": ["13.5cm"], "Blade locking system": ["Yes"], "Sheath included": ["No"], "Made in": ["Norway"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9075422756894/6010197-NOC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9075437961246/6010197-NOC02-ALT-CLOSED.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9075422756894/6010197-NOC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9075437961246/6010197-NOC02-ALT-CLOSED.jpg"]}