{"name": "Garmin Edge 1030 Plus - Unisex", "categories": ["Home", "All", "Cycling", "Training and electronics", "Bike computers", "GPS bike computers", "Edge 1030 Plus"], "description": "Navigation is where the 1000 level Edge units shine, and the 1030 Plus is no different. Garmin now includes free detailed maps for nearly every region in the world. With double the internal storage of its predecessor, you get phone-free turn-by-turn routing, course creation and round-trip routing for nearly anywhere on the planet, right from your handlebars. When connected to the Garmin Connect™ app, features like Trendline™ show you the most popular routes, anywhere Garmin users ride. Real-time Strava segment integration speaks to your competitive side, displaying nearby segments, showing how you compare to your PR and the current KOM or QOM. Live Tracking continues to evolve, now displaying not only where you have been but also where you are going. Through the free Garmin Connect app, you can receive texts, social media alerts, emails, download training plans and personalize daily workouts, review activities, keep an eye on the weather and more.Intuitive touch-based interface and an upgraded processor allow fast and easy movement between training, navigation, activity profiles and Connect IQ apps.Free global maps, with North America included on the device and more regions downloadable for free from Garmin Express, let you get turn-by-turn routing, search out local points of interest.Point of interest navigation lets you search for places like restaurants, attractions, hospitals, accommodation and more.Trendline™ routing uses Garmin Connect’s database of rider’s routes and tracks to find popular routes.ClimbPro™ mode breaks down the climbs in your ride, letting you know the grade, the total ascent, remaining ascent and elevation profile, so you can pace yourself.Mountain biking dynamics include 3 new metrics, jumps: number of jumps, hangtime, distance and speed, grit: overall trail difficulty, and flow: a score of how smoothly you rode the trail.TrailForks™ integration lets you access and navigate the TrailForks trail database without needing a cellular connection.Strava Segment integration (requires premium) preloaded or on-the-fly through your phone, shows starred segments and instantaneous results as segments end.LiveTrack now lets you share your course, sharing with your contacts where you are and have been, and also where you are going.GroupTrack displays the location and telemetry of your contacts that are using compatible Garmin devices.Find my Edge feature let’s you know if your Edge loses its connection to your phone. Should your Edge fall off, you get a lost-connection alert with location and exact GPS coordinates. Once in Bluetooth™ range you can trigger an alarm on your device, letting you know exactly where it is.Training plan takes you through the details of your ride: weather – including the recommended clothing for the conditions, food and water requirements based on your fitness levels – even providing reminders of when you should drink and eat, and much more.Environmental factors like heat and altitude acclimation are taken into consideration when calculating performance and recovery metrics.Training status and daily suggested workouts help you optimize your training, guiding you where you need to push and where you may need to dial it back.Incident detection uses accelerometers to detect accident and uses you phone to send a signal to predefined emergency contacts.Bike alarm mode adds a bit of peace of mind to bathroom stops, water stops and anywhere you need to refuel or de-fuel, sounding a loud, shrill, attention getting alarm if your bike is touched.Connects to 3 different satellite constellations, GPS, GLONASS and Galileo. Multiple networks, combined with satellite position caching, gives you a fast connection and a strong GPS signal wherever you are.Connect IQ support allows you to download apps, templates, data fields, and other features.Free Garmin Connect app lets you review activities, receive texts, social media alerts, emails, etc., download training plans, keep an eye on the weather and more.Bluetooth™ and ANT+™ sensor and trainer support.Barometric altimeter tracks ascents, descents, and total elevation changes.Physiological metrics includes VO2 max estimate, lactate threshold, race predictor, recovery advisor and performance indicator (requires heartrate chest strap, not included).Imports activity profiles, custom screens and all sensors used in the past year, from previous Edge models, making set-up easier than ever.In the box: Edge 1030 Plus, mounts (standard and extended out-front), USB cable, tether and manuals.", "product_code": "6011-891", "tech_specs": {"Weight": ["124g"], "Ideal for": ["Cycle touring", "Bikepacking", "Cycle training"], "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": ["IP X7"], "Built-in memory": ["32GB"], "Dimensions": ["11.4 x 5.8 x 1.9cm"], "Countdown timer": ["No"], "Stopwatch": ["Yes"], "Electronic compass\n\nAn electronic compass allows the user to view their heading in situations where they are either standing still or moving too slowly for the GPS to detect.": ["Yes"], "Interface": ["USB", "Wireless"], "Low battery warning": ["Yes"], "Calorie consumption\n\nCalculated based on data from a heart rate monitor.": ["No"], "App compatibility\n\nAn online community where members upload, analyze and share activity data.": ["Garmin Connect", "Garmin Express", "Third party apps"], "Add maps capability\n\nThese units allow you to add maps, so you can mark and name waypoints and create routes on your PC, and then upload the map of your choice to your GPS.": ["Yes"], "New lap auto start\n\nAutomatically triggers a new lap after reaching a specified difference.": ["Yes"], "Programmable workouts\n\nWant an easy jog? A fast-paced ride? A workout with lots of variety to keep you on your toes? With programmable workouts you can tailor your training to match whatever you are looking for on a particular day.": ["Advanced"], "Heart rate monitor": ["Sold separately"], "Distance/time alarm": ["Yes"], "Interval training": ["Yes"], "Bluetooth": ["Yes"], "Auto pause\n\nAutomatically pauses timer when you stop or go below a specified pace.": ["Yes"], "Heart rate in real time\n\nDisplays beats per minute during activity.": ["No"], "Calories in real time\n\nDisplays calorie expenditure during activity, based on heart rate monitor data.": ["No"], "Speed/cadence sensor\n\nMonitors pedalling cadence and measures pedalling strokes per minute.": ["Sold separately"], "Battery life": ["24 h"], "Chest strap": ["Sold separately"], "Custom POI\n\nA POI (point of interest) is a specific location that someone may find interesting (i.e., favourite viewpoint, best coffee stop before the trailhead). The custom POI feature allows the user to load only the POI's that interest them onto their GPS unit.": ["Yes"], "Waypoints\n\nWaypoints consist of a standard set of coordinates (two for land, three for air or space) that identify a specific physical location. A route is navigated between two or more waypoints.": ["200"], "Metric/imperial units format": ["Yes"], "Power meter\n\nDisplays output in watts as you ride.": ["Sold separately"], "Unit to unit transfer\n\nShares data wirelessly between compatible units.": ["Yes"], "Basemap\n\nA basic set of map data that is included with the GPS. Basemap detail may vary from unit to unit.": ["Yes"], "Battery power indicator": ["Yes"], "Area calculation": ["No"], "Data card": ["Not accepted"], "Foot pod\n\nAttaches to your shoe, captures your running data (i.e., pace, distance), and transmits it to your heart rate monitor or GPS.": ["Not compatible"], "Touch screen": ["Yes"], "Heart rate target zones\n\nDisplays heart rate zones during activity.": ["No"], "Barometric altimeter\n\nBarometer function helps forecast weather trends. An altimeter can provide one line of position for location on a topo map, useful if the GPS isn't working.": ["Yes"], "Coded signal\n\nA coded instrument ensures no interference between your chest strap and your watch, necessary if you are training in busy gyms or trails where other signals may be encountered.": ["Yes"], "Workout history": ["Yes"], "Wireless sync": ["Yes"], "WiFi": ["Yes"], "Button lock": ["Yes"], "Batteries": ["Rechargeable battery pack (non-removable)"], "Routes": ["100"], "Haptic feedback": ["No"], "Virtual partner\n\nAllows user to monitor training goals with either a virtual partner or alarms.": ["Yes"], "Pause timer\n\nPauses the timer when slowing or stopping, and automatically resumes when moving again.": ["Yes"], "Pace alarm\n\nAn alarm that notifies you if you vary from a pre-set pace.": ["Yes"], "ANT+ compatible\n\nEnsures seamless digital wireless communication between ANT+ devices. For example, data from an ultra-low power wireless sensor can be displayed on a bike computer or smartphone, then downloaded to a PC, etc.": ["Yes"], "Product sustainability": ["Rechargeable batteries"], "Made in": ["Taiwan"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9130869915678/6011891-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9130879975454/6011891-BK000-ALT-ANGLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9130880270366/6011891-BK000-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9130880237598/6011891-BK000-ALT-LEFT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9130880303134/6011891-BK000-ALT-MAP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9130880335902/6011891-BK000-ALT-POWER.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9130880368670/6011891-BK000-ALT-RIGHT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9130880466974/6011891-BK000-ALT-TRAININGLOAD.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9130880499742/6011891-BK000-ALT-VO2MAX.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9130869915678/6011891-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9130879975454/6011891-BK000-ALT-ANGLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9130880270366/6011891-BK000-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9130880237598/6011891-BK000-ALT-LEFT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9130880303134/6011891-BK000-ALT-MAP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9130880335902/6011891-BK000-ALT-POWER.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9130880368670/6011891-BK000-ALT-RIGHT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9130880466974/6011891-BK000-ALT-TRAININGLOAD.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9130880499742/6011891-BK000-ALT-VO2MAX.jpg"]}