{"name": "Thule Spring Stroller", "categories": ["Home", "All", "Travel gear", "Child transport", "Strollers and accessories", "Strollers", "Spring Stroller"], "description": "Comfy for your passenger and convenient for you, The Spring stroller has all the amenities plus a new folding mechanism to make transport and storage a cinch. You can fold it with one hand. Simply lift the carry handle under the seat and the stroller collapses into a compact package that's easy load in your car. When on the go, smooth rolling wheels and padded seat keep the ride comfy. The weatherproof canopy has an expandable section with a mesh window, so you can check on your passenger. The mesh window even has a has a roll down cover, perfect for naptime. The reclining seat back has a peak-a-boo mesh window that uses silent magnetic closures, so there's no noisy hook-and-loop to wake your passenger.Collapsible design uses a single lever (doubles as an ergonomic carrying handle). When folded, the stroller locks closed and stands upright.One-hand adjustable handlebar height goes from 98–108cm, locking at any point in that range.UPF50+ canopy blocks UV and uses PFC-free weatherproof finishes.Adjustable canopy has an expandable mesh window for ventilation.Reclining seat lays nearly flat, great for naps on the go.Reclining seat back has a peak-a-boo mesh window with a silent magnetic closure.Padded 5-point harness.Swivelling front wheel for great handling in tight quarters. Front wheel can also be locked in place for smooth tracking when you have a bit more room.Puncture-proof, smooth rolling rubber tires.Front step helps kids hop in and out – just be sure the brakes are on.Under seat cargo basket holds more than 21L.In the box: Spring stroller, large front wheel, 2 rear wheels, removable canopy and documentation.", "product_code": "6011-069", "tech_specs": {"Weight": ["9.5kg"], "Ideal for": ["Everyday use"], "Frame material": ["Aluminum", "Plastic"], "Main fabric": ["Polyester"], "Front wheel position\n\nA fixed front wheel won't rotate, which is ideal for jogging. A lock-out pin allows for the wheel to be either fixed or to rotate freely increasing manoeuvrability.": ["Lock-out"], "Brake type\n\nA hand brake can help runners maintain pace and form while running downhill. A parking brake prevents the stroller from moving while loading and unloading on flat surfaces.": ["Parking brake"], "Child harness": ["5-point harness"], "Carrying capacity\n\nThe maximum cargo capacity including the weight of the child(ren) in child carriers.": ["29kg"], "Seating capacity": ["1"], "Folded dimensions": ["32 x 45 x 76cm"], "Dimensions": ["103 x 60 x 108cm"], "Car seat adapter": ["Available separately"], "Infant adapter kit": ["Not compatible"], "Handlebar console kit": ["Not compatible"], "Snack tray": ["Available separately"], "Suspension\n\nSuspension improves on and off-road handling and ensures a smooth ride on uneven terrain.": ["Yes"], "Safety flag": ["No"], "Reclining seat": ["Yes"], "Wrist strap": ["Yes"], "Storage compartment": ["Yes"], "Reflectors": ["No"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9096806957086/6011069-GRE07.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9096820260894/6011069-GRE07-ALT-SIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9096806957086/6011069-GRE07.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9096820260894/6011069-GRE07-ALT-SIDE.jpg"]}