{"name": "Silva Trailrunner Free Hybrid", "categories": ["Home", "All", "Camping and hiking", "Headlamps and lighting", "Headlamps", "Trailrunner Free Hybrid"], "description": "The Trail Runner Free is a light and streamlined headlamp that exists to illuminate your low-light runs. Equipped with Silva’s intelligent lighting optics, it offers a mix of flood and spot lighting, letting you see where you're headed and where you are.Free Technology™ integrates the cord, between the battery pack and the light, into the headband, so there is nothing to snag or bounce around.4 modes: high (400 lumens), medium (200 lumens), low (50 lumens) and flash.Intelligent lighting combines flood and spot lighting, covering the near and the far.Hybrid battery case give you options: use the included Hybrid USB-powered pack for runs from home or anywhere you have easy access to USB ports, and enjoy the convenience of the AAA battery pack while traveling – the AAA is the world’s second most readily available battery.Hybrid battery case has a rear facing red light that helps keep you seen.Battery extension cord gives you the option of putting the battery pack in your bag or inside a jacket pocket. This both removes weight from your head and lets you keep the batteries warm for better cold-weather performance.Included hybrid battery case has a rear facing red light that helps keep you seen.LED power indicator lets you know when your batteries need changing.Anti-slip headband stays in place when on the move.Large, 1-button interface is easy to use with or without gloves.Lumens and runtimes measured to the ANSI/NEMA FL1 standard.IPX5 waterproofing stands up to any weather you’re willing to go out in.In the box: Trail Runner Free headlamp, Hybrid 3 x AAA battery case, rechargeable battery pack, cloth wrapped extension cable, USB charging cable and manual.", "product_code": "6011-462", "tech_specs": {"Ideal for": ["Trail running", "Running"], "Light modes\n\nThe number of lighting levels/modes the light has (i.e., low, med, high, flash).": ["4 modes"], "Beam distance - low": ["20m"], "Beam distance - med": ["50m"], "Beam distance - high": ["80m"], "Boost mode\n\nBriefly increases the light output to maximum brightness and distance.": ["No"], "Light source": ["2 LEDs"], "Burn time - low": ["12 h"], "Burn time - med": ["5 h"], "Burn time - high": ["2.5 h"], "Max light output\n\nThe total quantity of light emitted in every direction from a source of light; measured in lumens.": ["400 lumens"], "Beam pattern\n\nBeam pattern affects how much you can see within the area of light thrown from the headlamp. Wide beams are good for close-up; spot or focussed beams are good for long range visibility.": ["Wide", "Spot"], "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": ["IP X5"], "Rechargeability\n\nRechargeable lights give you hassle-free recharging with almost any power source. Replaceable batteries provide instant power, but you’ll need to bring extra batteries, recycle used ones and buy new ones.": ["Rechargeable"], "Red light mode": ["No"], "Regulated output\n\nOn regulated lights brightness is consistent, and does not decrease gradually as the batteries are drained.": ["No"], "Batteries": ["Lithium-polymer 1150mAh (included) or 3 AAA (not included)"], "Flash mode": ["Yes"], "Product sustainability": ["Rechargeable batteries"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146507165726/6011462-NOC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146516504606/6011462-NOC02-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146516635678/6011462-NOC02-ALT-BATTERY.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146516668446/6011462-NOC02-ALT-LIGHT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146516701214/6011462-NOC02-ALT-LIGHT2.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146516766750/6011462-NOC02-ALT-TOP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146507165726/6011462-NOC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146516504606/6011462-NOC02-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146516635678/6011462-NOC02-ALT-BATTERY.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146516668446/6011462-NOC02-ALT-LIGHT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146516701214/6011462-NOC02-ALT-LIGHT2.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146516766750/6011462-NOC02-ALT-TOP.jpg"]}