{"name": "Salomon Escape 6 Vitane Grip Skis - Women's", "categories": ["Home", "All", "Ski and snowboard gear", "Cross country skiing gear", "Cross country classic", "Classic skis", "Escape 6 Vitane Grip Skis"], "description": "For recreational skiers looking for stability and control. Sidecut and wide front platform promote control and stability. Minimal camber from heel to toe means skis respond efficiently to your power. Waxless bases have dual grip zones for nuanced traction and consistent kick.S-cut sidecut has a light carving sidecut behind the foot and a wider platform and the front for more control and stability.Low heel-toe camber puts lots of oomph into your stride and glide.Core is Densolite 2000, light in weight, but with consistent torsional stiffness.G2 Synchro waxless bases have dual grip zones for smooth transitions and consistent kick.Universal Race grinding uses low-pressure stone grinding to make these fast in all conditions.", "product_code": "6011-183", "tech_specs": {"Weight": ["1.37kg (190cm)"], "Ideal for": ["Recreational classic skiing"], "Construction\n\nSandwich and combination construction is generally used for big freeride-style skis while the lighter structural cap type of construction is more commonly found on cross-country skis.": ["Structural cap"], "Core": ["Densolite"], "Dimension (all lengths)": ["51-48-46-49mm"], "User weight range\n\nA good starting point for selecting ski or snowboard length. You might choose a shorter or longer length based on terrain and ability.": ["40-55kg (174cm)", "50-65kg (182cm)", "60-75kg (190cm)", "70-85kg (198cm)"], "Waxless\n\nOften called \"fish scale\" skis, waxless skis are designed so you don't need to apply kick wax. However, you may still want to apply glide wax for a better glide. They are a good option for those who don't like waxing, or for regions where temperatures can vary greatly throughout the day.": ["Yes"], "Metal edge": ["No"], "Bindings included": ["No"], "Made in": ["Bulgaria"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9137040031774/6011183-NOC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9137036591134/6011183-NOC02-ALT-BOTTOM.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9137040031774/6011183-NOC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9137036591134/6011183-NOC02-ALT-BOTTOM.jpg"]}