{"name": "Smith Engage MIPS Cycling Helmet - Unisex", "categories": ["Home", "All", "Cycling", "Bike helmets and body armour", "Bike helmets", "Engage MIPS Cycling Helmet"], "description": "Don’t overheat on the climb and keep a cool head on the descent. For mountain bikers and trail riders looking next level safety, lots of ventilation and an accessible price, look no further than the Engage.MIPS® technology (Multi-directional Impact Protection System) reduces rotational forces in an oblique impact. An inner shell sandwiched between the foam and the padding reduces rotational torque on the skull.Deep design increases protection for the back of your head.Fog reducing AirEvac™ system pulls warm air away from your sunglasses.Pass-through channels to store glasses on front.3-position visor allows goggle storage.20 strategically placed vents.Quick drying liner wicks away moisture.VaporFit™ dial adjustment system offers 270-degrees fit adjustment.", "product_code": "6012-469", "tech_specs": {"Weight": ["350g (Medium)"], "Ideal for": ["Trail riding", "Cross-country riding", "Cycle commuting"], "Construction\n\nMicroshell helmets are made of a thin polymer sheet over a foam liner; Hardshell helmets have a hard polymer outer shell and a foam liner; when the liner is being bonded to the outer shell during the manufacturing process, it is Molded in the shell.": ["Molded in the shell"], "Shell material": ["Polycarbonate"], "Fit system": ["Adjustable dial"], "Inner material": ["EPS (expanded polystyrene)"], "Vents": ["Yes"], "Approved for\n\nMost helmets are tested and certified for a specific sport. Some helmets are approved for multi-sports, but only after passing the safety tests for both sports (i.e., snowsports and cycling).": ["Cycling"], "Safety rating\n\nCetification is established by a variety of governing bodies who set impact standards. Most helmets are certified or approved for a specific sport, except in the case of multi-sport helmets (i.e., a snowsports helmet might also be approved for cycling if it meets the cycling safety standards).": ["CPSC", "EN 1078"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9161592930334/6012469-MTW00.jpg"]}