{"name": "Ryders Eyewear Fifth Sunglasses - Unisex", "categories": ["Home", "All", "Cycling", "Cycling clothing", "Cycling clothing accessories", "Cycling sunglasses", "Fifth Sunglasses"], "description": "When the sun rides high and the sweat begins to flow, the Fifth will keep your vision clear.Fits medium to large faces best.Treated with a military grade anti-fog material to keep you fog-free. Anti-fog lenses perform at their best when clean. Simply wash the lenses with water and they’ll keep your vision clear. When not in use, anti-fog lenses are happiest stored in a warm, dry environment.Scratch-resistant polycarbonate lenses.8-base lens curve provides face hugging coverage.Rubber temple tips and rubber nose pads offer a comfortable fit, that doesn’t shift around.Grilamid TR90 thermoplastic frames are flexible, durable and light.", "product_code": "6012-744", "tech_specs": {"Ideal for": ["Road cycling", "Mountain biking", "Bike triathlon", "Run triathlon", "Running"], "Frame material\n\nTR90 thermoplastic offers good resistance to chemicals and torsion. Propionate is a light, nylon-based, hypoallergenic plastic that's very strong and offers more transparency and gloss than other plastics.": ["Grilamid"], "Lens material": ["Polycarbonate"], "Lens performance\n\nFixed tints provide a constant degree of darkness. Photochromic lenses adjust to changing light levels. Polarized lenses absorb horizontal reflected glare to improve clarity around surfaces like snow or water.": ["Fixed tint"], "Visible Light Transmission\n\n0-10% – very heavy tint, too dark for most needs. \n10-30% – heavy tint for bright sunny days.\n20-60% – light tint, great for cloudy, overcast conditions and shady trails. \n60-80% – very light tint (often coloured), for improving contrast in low-light conditions, think dawn or dusk. \n80-100% – little to no tint, this what you want in the dark.": ["32% (Gloss White-Grey/Rose Anti-Fog)", "15% (Matte Black-Grey/Grey Anti-Fog)"], "Lens width\n\nRefers to the horizontal width in millimeters of one of the frame's lenses.": ["59mm"], "Nose bridge width\n\nThe gap between the lenses, measured at the smallest point.": ["16mm"], "Temple length\n\nThe length of an arm from tip to tip.": ["105mm"], "Lens height\n\nMeasures the height of the lens within the frame, excluding the lens curve.": ["41mm"], "Fits over most eyewear\n\nThese optics are designed to fit comfortably over most eyewear.": ["No"], "100% UVA protected": ["Yes"], "Interchangeable lenses\n\nInterchangeable lenses let you change lenses to suit differing light conditions or activities.": ["No"], "100% UVB protected": ["Yes"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9182816010270/6012744-MBA45.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9182815977502/6012744-GRF34.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9182816010270/6012744-MBA45.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9182815977502/6012744-GRF34.jpg"]}