{"name": "Carson Outdoor Adventure Binocular Set", "categories": ["Home", "All", "Camping and hiking", "Tools and accessories", "Binoculars and monoculars", "Outdoor Adventure Binocular Set"], "description": "Set little explorers and first time hikers up for adventure with this Outdoor Adventure set. Bundled into this kit are 2 of the 10 essentials for hiking (a compass and a flashlight), as well as a 1 good to have (a whistle) and 1 very nice to have (binoculars).5x30 compact binoculars have a rubberized body that is easy to hold steady.Compass has bearing siting capability.Whistle has an integrate thermometer.Flashlight requires 2 AA batteries (not included).Include a binocular pouch, strap and lens cloth.", "product_code": "6012-849", "tech_specs": {"Ideal for": ["Fun and games", "Day hiking"], "Magnification\n\nThis tells you how many times an object is magnified when observed through the binoculars.": ["5"], "Objective lens\n\nThe diameter of the objective lens will impact how bright, sharp, and comfortable your view is. Generally, bigger is better.": ["30mm"], "Field of view\n\nThe widest dimension of circular viewing area that you can see.": ["143m"], "Exit pupil\n\nThe diameter of the objective (outside) lens divided by the binocular's magnification. It indicates the amount of light that reaches your eye (most noticeable in low light conditions). Higher numbers offer brighter images.": ["6mm"], "Dust proof": ["No"], "Fogproof": ["No"], "Waterproof\n\nWaterproof binoculars are assembled with O-rings and are purged with nitrogen to avoid condensation. They are ideal for boating or use in rainy weather.": ["No"], "Diopter adjustment\n\nThese binoculars can be adjusted for variances between right and left eye vision.": ["No"], "Includes case": ["Yes"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9140118126622/6012849-GRN00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9140113440798/6012849-GRN00-ALT-BOX.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9140118126622/6012849-GRN00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9140113440798/6012849-GRN00-ALT-BOX.jpg"]}