{"name": "Garmin Forerunner 745 Smartwatch - Unisex", "categories": ["Home", "All", "Camping and hiking", "Electronics", "Watches", "Altimeter barometer watches", "Forerunner 745 Smartwatch"], "description": "Combining advanced training tools with smartwatch functionality, Garmin’s newest Forerunner isn’t just for training, it’s for living. Onboard GPS and other sensors track speed and distance, turning your movement into data, helping you train smarter. Because how you train isn’t the only factor in your performance, the 745 also looks at where you train. Elevation and temperature are taken into consideration and layered onto performance data. The Elevate™ optical heart rate monitor takes your pulse right from your wrist. When paired with the Garmin Connect™ app, your 745 goes from a training tool, to an everyday tool. Connect lets you review activities, receive notifications, access music apps, track weather and more. And, if you leave your phone at home, the 745 has the soundtrack covered, with storage for hundreds of songs and podcasts.Modes for biking, running, swimming, multisport and brick workouts – transition between activities with thee press of a button.Daily suggested workouts based on your current training load and training status.Garmin Coach provides free, personalized training plans to improve your 10k, half marathon, or just to train smarter.Download or create training plans in Garmin Connect, or sync training plans from other apps, e.g. TrainingPeaks®, TrainerRoad, etc.Listen to music over Bluetooth®, download playlists and podcasts via Spotify®, Amazon Music or Deezer (premium account may be required).Playlists synced from streaming services update when in range of Wi-Fi.Holds up to 500 songs.ClimbPro™ mode breaks down climbs to show grade, total ascent, and elevation profile.Strava Segment integration (requires premium) preloaded or on-the-fly through your phone, shows starred segments and instantaneous results as segments end.Body Battery™ tracks daily energy levels, monitoring what drains your energy (exercise) and recharges your energy (rest, food, etc.), giving you a better idea of how and when to train.Garmin Pay™ contact-less payment (if supported by your bank).Elevate™ optical heart rate monitor has a red LED for Pulse Ox data that works while swimming.Physiological metrics includes VO2 max, a race predictor, recovery advisor and performance indicator.Training load uses data from your past week’s workouts to let you know if you are overtraining, under-training, or on the right path.Compatible with running dynamics sensors (sold separately).LiveTrack™ (through a connected phone) allows you to share your location and fitness data.Incident detection sends an alert via phone to your emergency contacts in case of accident.Assistance mode sends out a message with a LiveTrack link, letting your contacts know where you are.Connects to satellite constellations (GPS, GLONASS and Galileo) and caches positions for fast, strong connectionsUltraTrac™ mode reduces GPS recording rate to conserve battery.24/7 activity tracking learns your activity level and guides you towards a more active lifestyle.On board sleep tracking mode monitors  rest, breathing patterns, total sleep hours and periods of restful sleep.Automatically syncs data to paired phone running Garmin Connect.Connects with ANT+ and Bluetooth Smart sensors, from foot pods, to speed and cadence pods, to power meters.Connect IQ support allows you to download apps, templates, data fields, watch faces, and other features.Internal GPS provides basic waypoint navigation.Back to start feature directs you (as the crow flies) to where you started your activity.", "product_code": "6012-429", "tech_specs": {"Ideal for": ["Triathlon", "Running", "Road cycling", "Casual wear"], "Face material\n\nPolycarbonate is inexpensive and light, with good clarity and wear-resistance. Mineral crystal glass offers greater clarity and significantly greater wear-resistance. Sapphire crystal is better still for clarity and wear-resistance.": ["Mineral crystal glass"], "Wrist strap material": ["Silicone"], "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": ["IP X8"], "Dimensions": ["4.4 x 4.4 x 1.3cm"], "Snooze": ["No"], "Countdown timer": ["Yes"], "Stopwatch": ["Yes"], "Electronic compass\n\nAn electronic compass allows the user to view their heading in situations where they are either standing still or moving too slowly for the GPS to detect.": ["No"], "12/24 hour format": ["Yes"], "Interface": ["USB", "Wireless"], "Lug width": ["22mm"], "Low battery warning": ["Yes"], "Calorie consumption\n\nCalculated based on data from a heart rate monitor.": ["Yes"], "App compatibility\n\nAn online community where members upload, analyze and share activity data.": ["Garmin Connect", "Third party apps"], "Add maps capability\n\nThese units allow you to add maps, so you can mark and name waypoints and create routes on your PC, and then upload the map of your choice to your GPS.": ["No"], "New lap auto start\n\nAutomatically triggers a new lap after reaching a specified difference.": ["Yes"], "Programmable workouts\n\nWant an easy jog? A fast-paced ride? A workout with lots of variety to keep you on your toes? With programmable workouts you can tailor your training to match whatever you are looking for on a particular day.": ["Advanced"], "Heart rate monitor": ["Yes"], "Distance/time alarm": ["Yes"], "Interval training": ["Yes"], "Bluetooth": ["Yes"], "Auto pause\n\nAutomatically pauses timer when you stop or go below a specified pace.": ["Yes"], "Heart rate in real time\n\nDisplays beats per minute during activity.": ["Yes"], "Calories in real time\n\nDisplays calorie expenditure during activity, based on heart rate monitor data.": ["Yes"], "Speed/cadence sensor\n\nMonitors pedalling cadence and measures pedalling strokes per minute.": ["Sold separately"], "Battery life": ["6-336 h"], "Chest strap": ["Sold separately"], "Custom POI\n\nA POI (point of interest) is a specific location that someone may find interesting (i.e., favourite viewpoint, best coffee stop before the trailhead). The custom POI feature allows the user to load only the POI's that interest them onto their GPS unit.": ["Yes"], "Metric/imperial units format": ["Yes"], "Power meter\n\nDisplays output in watts as you ride.": ["Sold separately"], "Unit to unit transfer\n\nShares data wirelessly between compatible units.": ["Yes"], "Basemap\n\nA basic set of map data that is included with the GPS. Basemap detail may vary from unit to unit.": ["No"], "Battery power indicator": ["Yes"], "Area calculation": ["No"], "Tide tables": ["No"], "Data card": ["Not accepted"], "Foot pod\n\nAttaches to your shoe, captures your running data (i.e., pace, distance), and transmits it to your heart rate monitor or GPS.": ["Sold separately"], "Touch screen": ["No"], "Heart rate target zones\n\nDisplays heart rate zones during activity.": ["Yes"], "Barometric altimeter\n\nBarometer function helps forecast weather trends. An altimeter can provide one line of position for location on a topo map, useful if the GPS isn't working.": ["Yes"], "Coded signal\n\nA coded instrument ensures no interference between your chest strap and your watch, necessary if you are training in busy gyms or trails where other signals may be encountered.": ["Yes"], "Workout history": ["Yes"], "Wireless sync": ["Yes"], "WiFi": ["Yes"], "Button lock": ["Yes"], "Batteries": ["Lithium-ion (included)"], "Haptic feedback": ["Yes"], "Case diameter": ["44mm"], "Virtual partner\n\nAllows user to monitor training goals with either a virtual partner or alarms.": ["Yes"], "Pause timer\n\nPauses the timer when slowing or stopping, and automatically resumes when moving again.": ["Yes"], "Replaceable wrist strap": ["Yes"], "Pace alarm\n\nAn alarm that notifies you if you vary from a pre-set pace.": ["Yes"], "ANT+ compatible\n\nEnsures seamless digital wireless communication between ANT+ devices. For example, data from an ultra-low power wireless sensor can be displayed on a bike computer or smartphone, then downloaded to a PC, etc.": ["Yes"], "Product sustainability": ["Rechargeable batteries"], "Made in": ["Taiwan"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9134858928158/6012429-BK000.jpg"]}