{"name": "Thule Urban Glide 2 Double Stroller - Infants to Children", "categories": ["Home", "All", "Travel gear", "Child transport", "Strollers and accessories", "Strollers", "Urban Glide 2 Double Stroller"], "description": "This light, compact stroller has passenger amenities you’d love in your car: a reclining seat for napping, rear suspension to smooth the ride, and venting mesh and an adjustable canopy for climate control. Your needs haven’t been overlooked either: the ergonomic handlebar with an easy-to-use twist-brake adjusts to fit different users and activities, and the stroller folds up one-handed for easy transitions into vehicles.Twist-brake provides easy on-the-go control, letting you set the perfect pace.UPF 50+ polyurethane-coated canopy provides adjustable protection from harsh UV rays and the elements.Use for jogging with children 6 months or older. For strolling, children younger than 6 months must be in a car seat with the Thule® car seat adapter. (Only one seat adapter can be used at a time).Large rear wheels handle uneven terrain well.Reflective detailing on the wheels helps keep you and your passengers visible.Front wheel pivots for easy turning or locks into place for jogging. A micro adjustment ensures straight-line travel.Narrow design is aerodynamic in use and folds to a compact package for storage or transport.Peek-a-boo roof window lets you keep an eye on your passengers.5-point padded harnesses offer security and comfort.Seat backs recline 165° to a near-flat position for naps.Storage includes a removable under-seat compartment, a large mesh seatback pocket and 2 small mesh pockets inside the carrier.Integrated cross bar accommodates accessories like a console or cup holder (each sold separately).Safety wrist strap prevents runaways.Foot brake locks and releases without bending.", "product_code": "6013-970", "tech_specs": {"Weight": ["15kg"], "Ideal for": ["Everyday use"], "Frame material": ["Aluminum"], "Main fabric": ["Polyester"], "Front wheel position\n\nA fixed front wheel won't rotate, which is ideal for jogging. A lock-out pin allows for the wheel to be either fixed or to rotate freely increasing manoeuvrability.": ["Lock-out"], "Brake type\n\nA hand brake can help runners maintain pace and form while running downhill. A parking brake prevents the stroller from moving while loading and unloading on flat surfaces.": ["Hand brake", "Parking brake"], "Child harness": ["5-point harness"], "Carrying capacity\n\nThe maximum cargo capacity including the weight of the child(ren) in child carriers.": ["45kg"], "Seating capacity": ["2"], "Folded dimensions": ["87 x 80 x 41cm"], "Dimensions": ["105 x 80 x 102cm"], "Car seat adapter": ["Available separately"], "Infant adapter kit": ["Available separately"], "Handlebar console kit": ["Available separately"], "Snack tray": ["Available separately"], "Suspension\n\nSuspension improves on and off-road handling and ensures a smooth ride on uneven terrain.": ["Yes"], "Safety flag": ["No"], "Reclining seat": ["Yes"], "Wrist strap": ["Yes"], "Storage compartment": ["Yes"], "Reflectors": ["Yes"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9167357116446/6013970-BSF01.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9167350104094/6013970-BSF01-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9167350136862/6013970-BSF01-ALT-FOLDED.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9167350169630/6013970-BSF01-ALT-SIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9167357116446/6013970-BSF01.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9167350104094/6013970-BSF01-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9167350136862/6013970-BSF01-ALT-FOLDED.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9167350169630/6013970-BSF01-ALT-SIDE.jpg"]}