{"name": "Fjallraven Singi Down Jacket - Women's", "categories": ["Home", "All", "Clothing", "Jackets", "Insulated jackets", "Down jackets", "Singi Down Jacket"], "description": "A top-of-the-line coat, Fjallraven's Singi Down Jacket is made to keep you cozy on even the coldest days of winter. Thick G-1000 fabric with a dense weave stands up to abrasion and precipitation. Packed with warmth, goose down insulation in the body and synthetic insulation in the shoulders and elbows stands up to the demands of weather and wear. An adjustable hood lets you react as the conditions change, and it's framed with a synthetic fur trim to help cut the wind.Made from Fjallraven's G-1000 fabric, a super-durable blend of polyester and cotton with a dense weave.Shoulders and rear are G-1000 HeavyDuty for even greater durability.Impregnated with Fjallraven's Greenland Wax treatment for excellent water resistance. To make it waterproof, apply additional wax (sold separately).Insulated with 600-fill-power goose down, certified as cruelty-free by Four Paws, an animal welfare organization.Shoulders and elbows have Super Microloft synthetic insulation for great resistance to weather and wear.Adjustable hood has synthetic fur trim to cut the wind.Velcro® adjustable cuffs and internal drawcords at the waist and hem seal out the winter chill.", "product_code": "6013-430", "tech_specs": {"Weight": ["1.42kg (Small)"], "Ideal for": ["Casual wear"], "Type": ["Insulated down"], "Technology": ["Supreme Microloft"], "Construction": ["Quilted"], "Face fabric": ["Polyester", "Cotton"], "Lining/backer": ["Nylon"], "Insulation": ["600 fill-power goose down", "Polyester"], "Down weight": ["210g"], "Waterproofness\n\nWaterproof garments use waterproof-breathable technologies and are fully seam-taped. Water-resistant garments use waterproof-breathable technologies but their seams are not taped. Water-resistant garments repel water and protect against wind but are not made of waterproof fabric.": ["Water-resistant"], "Pockets": ["2 front with flap", "2 zippered chest", "1 internal zippered"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["Wind-resistant"], "Length": ["Below hip"], "Durable water repellency\n\nUsually referred to as DWR. A treatment made to fabrics that causes water to bead and run off instead of soaking through.": ["Yes"], "Hood": ["Adjustable", "Insulated"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9166630158366/6013430-GAR05.jpg"]}