{"name": "Ocean Signal RescuMe PLB-1 Personal Locator Beacon", "categories": ["Home", "All", "Camping and hiking", "Electronics", "GPS Navigation", "Satellite communicators and locators", "RescuMe PLB-1 Personal Locator Beacon"], "description": "A simple, subscription-free way to call for help. This beacon fits in a pocket and transmits on 2 frequencies simultaneously once activated. The 406 MHz signal goes to both the GEOSAR and LEOSAR satellite constellations. The 121.5 MHz transmission is a local signal that searchers can triangulate on once in your vicinity. A manually-activated SOS strobe guides SAR personnel at night.Broadcasts SOS to government funded satellite networks, so there's no monthly fee.Transmits a unique beacon identifier you register with the Rescue Coordination Centre for fast response time as SAR teams know what to look for.66-channel GPS receiver pinpoints locations within a few metres and embeds it in the signal to GEOSAR satellites.Battery lasts 7 years in storage, transmits for more than 24 hours at -20°C.Battery replacement can be done at an Ocean Signal authorised battery replacement centres.Retractable antenna improves signal strength in challenging conditions.1-button activation with a spring loaded hard-plastic cover, prevents accidental activation.Cancel button for accidental activation.Test button for yearly readines checks.Bright white strobe (13 lumens) signals  SOS transmission, and guides rescuers to your position.LED indicator provides transmission details.Floatation pouch included to make it bouyant.Waterproof to 15m.", "product_code": "6013-458", "tech_specs": {"Weight": ["116g"], "Ideal for": ["Emergency preparedness"], "Transmission duration": ["24 hours @ -20ºC"], "Satellite network used": ["COSPAS-SARSAT"], "Operating temperature": ["-20 to 55°C"], "Battery life (operating)": ["24 h"], "Frequency (alert)": ["406MHz"], "Storage temperature": ["-30 to 70°C"], "Dimensions": ["3.3 x 5.1 x 7.7cm"], "Frequency (homing)": ["121.5MHz"], "Battery life (standby)": ["61320 h"], "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": ["IP X8"], "Replaceable batteries": ["No"], "Rechargeability\n\nRechargeable lights give you hassle-free recharging with almost any power source. Replaceable batteries provide instant power, but you’ll need to bring extra batteries, recycle used ones and buy new ones.": ["Non-rechargeable"], "Electronic compass\n\nAn electronic compass allows the user to view their heading in situations where they are either standing still or moving too slowly for the GPS to detect.": ["No"], "Batteries": ["Lithium-manganese (included)"], "Ability to test\n\nAllows you to test the unit.": ["Yes"], "Barometric altimeter\n\nBarometer function helps forecast weather trends. An altimeter can provide one line of position for location on a topo map, useful if the GPS isn't working.": ["No"], "GPS data sent in SOS\n\nGPS coordinates are sent in each SOS message.": ["Yes"], "Check-in feature\n\nAllows you to send a 'check-in' message to let people know you are safe.": ["No"], "Floats": ["No"], "Delivery confirmation\n\nLets you know that your message was received.": ["Yes"], "Standards": ["ETSI EN 302-152-1"], "Made in": ["United Kingdom"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9145996869662/6013458-NOC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9145995198494/6013458-NOC02-ALT-INSITU.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146026917918/6013458-NOC02-ALT-DIMENSIONS.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146026950686/6013458-NOC02-ALT-SIZING.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9145996869662/6013458-NOC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9145995198494/6013458-NOC02-ALT-INSITU.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146026917918/6013458-NOC02-ALT-DIMENSIONS.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146026950686/6013458-NOC02-ALT-SIZING.jpg"]}