{"name": "Light & Motion Vya Combo Bike Light Set", "categories": ["Home", "All", "Cycling", "Bike accessories", "Bike lights", "Rear bike lights", "Vya Combo Bike Light Set"], "description": "This duo is compact, easy to charge, weatherproof, and they turn themselves on and off.  This taillight and headlight bundle are ready for low-light commutes. Thanks to a little internal magic, they know when you are on the move and automatically turning on and off.Internal motion detector turns lights on when you start rolling.Lights cannot turn on unless in the mount and turn off when removed from the mount.Headlight  runs up to 10h at 150 lumens.Taillight  runs  up to 8h at 50 lumens.Pulsing light pattern is engineered for maximum visibility.Both lights have an integrated type-A male USB plug.Side lighting ports add visibilty for traffic approaching from either side.IP67 weather proofing.", "product_code": "6013-058", "tech_specs": {"Weight": ["60g"], "Ideal for": ["Cycle commuting", "Cycle touring", "Urban cycling"], "Included mounts": ["Handlebar mount", "Seat post mount"], "Type\n\nMost Canadian municipalities require a white front light and a red rear light.": ["Front", "Rear"], "Light source": ["LED"], "Max light output\n\nThe total quantity of light emitted in every direction from a source of light; measured in lumens.": ["150 lumens"], "Charge time\n\nThe amount of time it takes to fully charge the battery. Applies to lithium and NiMH type batteries. Does not apply to rechargeable or non-rechargeable AA or AAA batteries.": ["2 h"], "Rechargeability\n\nRechargeable lights give you hassle-free recharging with almost any power source. Replaceable batteries provide instant power, but you’ll need to bring extra batteries, recycle used ones and buy new ones.": ["Rechargeable"], "Helmet attachment\n\nIncludes a bracket or mounting system that attaches to most bike helmets.": ["Sold separately"], "Red light mode": ["Yes"], "Regulated output\n\nOn regulated lights brightness is consistent, and does not decrease gradually as the batteries are drained.": ["Yes"], "Batteries": ["Lithium-ion (included)"], "Flash mode": ["Yes"], "Product sustainability": ["Rechargeable batteries"], "Made in": ["USA"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9143695638558/6013058-BK000.jpg"]}