{"name": "Outdoor Research PackOut Compression Stuff Sack - Unisex", "categories": ["Home", "All", "Camping and hiking", "Sleeping bags, sleeping pads, quilts and pillows", "Compression bags and stuff sacks", "PackOut Compression Stuff Sack"], "description": "Bring your clothes down to a packable size. This simple storage solution is great for camping, cycle touring, general travel or as a laundry bag in a packed suitcase.Made of lightweight and water-resistant nylon.2 compression straps and a roll-top closure.Reinforced bottom adds durability when stuffing and compressing.", "product_code": "6013-275", "tech_specs": {"Ideal for": ["Camping and hiking", "Travel", "Cycle touring and bikepacking"], "Closure": ["Roll-top"], "Material": ["40-denier silicone-treated ripstop nylon, PU-coated interior"], "Ruggedness\n\nFair: made of lightweight materials and designed to be carried inside another bag. Good: strikes a balance between light weight and durability. Excellent: made of heavy duty materials and designed to be carried alone. Exceptional: made of ultra-tough materials and designed to withstand abuse.": ["Fair"], "Waterproofness\n\nWaterproof bags and cases are made with waterproof materials and have waterproof closures. Some are designed to be submersible. Water-resistant bags and cases are made with waterproof materials, but water could sneak in through the seams or closure.": ["Water-resistant"], "Submersible": ["No"], "Length": ["34cm (5L)", "40cm (8L)", "45cm (10L)", "50cm (15L)", "55cm (20L)"], "Width": ["28cm (5L)", "32cm (8L)", "36cm (10L)", "40cm (15L)", "44cm (20L)"], "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": ["Not IPX rated"], "Volume": ["5L (5L)", "8L (8L)", "10L (10L)", "15L (15L)", "20L (20L)"], "Additional feature(s)": ["Compression straps"], "Made in": ["Vietnam"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9190071402526/6013275-ATL29.jpg"]}