{"name": "Rossignol X-Tour Venture WL 52 Tour Step-in Cross-country Skis - Unisex", "categories": ["Home", "All", "Ski and snowboard gear", "Cross country skiing gear", "Cross country classic", "Classic skis", "X-Tour Venture WL 52 Tour Step-in Cross-count"], "description": "No wax, no track, no problem. Uncomplicated and versatile, these skis are in their natural habitat on and off the trail. With more traditional length, they glide gracefully on groomed tracks. Their light wood core puts an effective kick under your foot. And with a waxless base, you can go anywhere and everywhere  from long loops to off-track exploring.Active cap construction flexes from tip to tail and offers good torsional rigidity.Wood core for light reliable performance.Sure Kick Concept for responsive kick and energy return.AR plus waxless base grips in all conditions without kick wax.K5000 base glides on variable snow conditions.Includes Tour Step In NNN bindings that are easy to use, even while wearing gloves.", "product_code": "6014-756", "tech_specs": {"Weight": ["1.42kg (196cm)"], "Ideal for": ["Off-track touring", "Recreational classic skiing"], "Construction\n\nSandwich and combination construction is generally used for big freeride-style skis while the lighter structural cap type of construction is more commonly found on cross-country skis.": ["Structural cap"], "Core": ["Wood"], "Dimension (all lengths)": ["52-47-49  mm"], "User weight range\n\nA good starting point for selecting ski or snowboard length. You might choose a shorter or longer length based on terrain and ability.": ["41-45kg (176cm)", "45-54kg (186cm)", "54-64kg (191cm)", "64-73kg (196cm)", "73-82kg (201cm)", "82+kg (206cm)"], "Waxless\n\nOften called \"fish scale\" skis, waxless skis are designed so you don't need to apply kick wax. However, you may still want to apply glide wax for a better glide. They are a good option for those who don't like waxing, or for regions where temperatures can vary greatly throughout the day.": ["Yes"], "Metal edge": ["No"], "Bindings included": ["Yes"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9182831935518/6014756-BK515.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9183003836446/6014756-BK515-ALT-BOTTOM.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9183004065822/6014756-BK515-ALT-BINDING.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9182831935518/6014756-BK515.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9183003836446/6014756-BK515-ALT-BOTTOM.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9183004065822/6014756-BK515-ALT-BINDING.jpg"]}