{"name": "Garmin Forerunner 945 LTE - Unisex", "categories": ["Home", "All", "Camping and hiking", "Electronics", "GPS Navigation", "GPS watches", "Forerunner 945 LTE"], "description": "Stay connected without your phone. With built-in LTE communication, the Forerunner 945 LTE lets you share data, communicate or even call for help without a phone. It also has all the training features of prior Forerunner smartwatches. Internal GPS handles speed, distance and pace. Sensors factor in elevation and temperature. Detailed internal maps get you where you need to go and plot routes. Elevate™ optical heart rate monitor takes pulse data off your wrist, no need for a chest strap. Need more information or extra motivation? Pair it with Garmin Connect and download training plans, review activities, receive texts, social media alerts, emails, track the weather and more. Plus you can store playlists, podcasts, up to 1000 songs and connect to music services.LTE connection allows LiveTrack™, GroupTrack™, spectator messaging and more; requires subscription plan from Garmin.LiveTracking and Live Events shares location and fitness data during activity.GroupTrack™ displays location of up to 50 others using compatible Garmin devices.Spectator messaging lets shared contacts send text and audio messages. Note – audio messages require Bluetooth™ headphones.Assistance Plus let’s you summon help anywhere with LTE coverage. Garmin International Emergency Response Coordination Center (IERCC), a worldwide response coordination center has 24/7/365 staffing. You can also call your contacts for help.Incident detection: identifies accidents and calls IERCC to send help to your location.Built-in modes for biking, running, swimming (indoor and outdoor), multisport – transition between activities at the press of a button – gym (strength training, cardio and elliptical training, stairs, rowing and yoga) and more.Includes North American map data with room to add more.Point of interest navigation for restaurants, attractions, accommodation, etc.Round-trip mapping: choose your distance and the 945 LTE plots course options that start and stop where you are.Trendline™ routing uses Garmin Connect database to find the most popular route to your destination.Stream music through paired smartphone using Spotify, iHeartRadio, Pandora or Deezer. Download playlists and podcasts via music service, e.g. Spotify (premium account required) or add MP3s from your computer.Playlists synced from streaming services can update over Wi-Fi.Power alerts, lap data and audio messages can come through to your paired headphones.ClimbPro™ mode shows grade, total ascent, how far you have to climb on an elevation profile.PacePro™ sets course and desired pace and compares distance splits, shows needed pace vs. goal pace for each split and course.Garmin Pay™ contact-less payment (if supported by your bank).Connects to GPS, GLONASS and Galileo, cached satellite positions offer fast connections and strong GPS signals.Elevate™ 4.0 optical heart rate monitor has improved accuracy and twice the number of infrared sensors for more precise Pulse Ox data.Physiological metrics: VO2 max, race predictor, recovery advisor and performance indicator.Training load uses data from past 7-days to let you know if you are overtraining, under-training, or on the right path.Compatible with running dynamics sensors (sold separately).Body Battery™ tracks daily energy levels to aid training. See what drains your energy (exercise) and recharges your energy (rest, food).24/7 activity tracking.On board sleep tracking monitors rest, total sleep and periods of movement or restful sleep.Garmin Connect lets you review activities, receive texts, social media alerts, emails, etc., download training plans, keep an eye on the weather and more, via Bluetooth + phone.Connect IQ 4.0 support for downloading apps, templates, data fields, watch faces, and more.Internal memory stores up to 200 hours of activities. Garmin Connect stores activity data.Rechargeable lithium-ion battery lasts up to 35 hours in GPS mode, 7 hours in GPS mode with music and LTE tracking, 12 hours in GPS mode with music, up to 14 days in smartwatch mode.Scratch-resistant Corning® Gorilla® Glass DX.In the box: Forerunner 945 LTE, charging cable and documentation.", "product_code": "6015-401", "tech_specs": {"Weight": ["49g"], "Ideal for": ["Triathlon", "Running", "Road cycling", "Casual wear"], "Face material\n\nPolycarbonate is inexpensive and light, with good clarity and wear-resistance. Mineral crystal glass offers greater clarity and significantly greater wear-resistance. Sapphire crystal is better still for clarity and wear-resistance.": ["Mineral crystal glass"], "Wrist strap material": ["Silicone"], "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": ["IP X8"], "Built-in memory": ["14.5GB"], "Dimensions": ["4.4 x 4.4 x 1.4cm"], "Snooze": ["No"], "Countdown timer": ["Yes"], "Stopwatch": ["Yes"], "Electronic compass\n\nAn electronic compass allows the user to view their heading in situations where they are either standing still or moving too slowly for the GPS to detect.": ["Yes"], "12/24 hour format": ["Yes"], "Interface": ["USB", "Wireless"], "Lug width": ["22mm"], "Low battery warning": ["Yes"], "Calorie consumption\n\nCalculated based on data from a heart rate monitor.": ["Yes"], "App compatibility\n\nAn online community where members upload, analyze and share activity data.": ["Garmin Connect", "Third party apps"], "Add maps capability\n\nThese units allow you to add maps, so you can mark and name waypoints and create routes on your PC, and then upload the map of your choice to your GPS.": ["Yes"], "Programmable workouts\n\nWant an easy jog? A fast-paced ride? A workout with lots of variety to keep you on your toes? With programmable workouts you can tailor your training to match whatever you are looking for on a particular day.": ["Advanced"], "New lap auto start\n\nAutomatically triggers a new lap after reaching a specified difference.": ["Yes"], "Heart rate monitor": ["Yes"], "Distance/time alarm": ["Yes"], "Interval training": ["Yes"], "Bluetooth": ["Yes"], "Auto pause\n\nAutomatically pauses timer when you stop or go below a specified pace.": ["Yes"], "Heart rate in real time\n\nDisplays beats per minute during activity.": ["Yes"], "Calories in real time\n\nDisplays calorie expenditure during activity, based on heart rate monitor data.": ["Yes"], "Speed/cadence sensor\n\nMonitors pedalling cadence and measures pedalling strokes per minute.": ["Sold separately"], "Battery life": ["7-336 h"], "Chest strap": ["Sold separately"], "Custom POI\n\nA POI (point of interest) is a specific location that someone may find interesting (i.e., favourite viewpoint, best coffee stop before the trailhead). The custom POI feature allows the user to load only the POI's that interest them onto their GPS unit.": ["Yes"], "Metric/imperial units format": ["Yes"], "Power meter\n\nDisplays output in watts as you ride.": ["Sold separately"], "Unit to unit transfer\n\nShares data wirelessly between compatible units.": ["Yes"], "Basemap\n\nA basic set of map data that is included with the GPS. Basemap detail may vary from unit to unit.": ["Yes"], "Area calculation": ["No"], "Tide tables": ["No"], "Battery power indicator": ["Yes"], "Data card": ["Not accepted"], "Foot pod\n\nAttaches to your shoe, captures your running data (i.e., pace, distance), and transmits it to your heart rate monitor or GPS.": ["Sold separately"], "Touch screen": ["No"], "Heart rate target zones\n\nDisplays heart rate zones during activity.": ["Yes"], "Barometric altimeter\n\nBarometer function helps forecast weather trends. An altimeter can provide one line of position for location on a topo map, useful if the GPS isn't working.": ["Yes"], "Coded signal\n\nA coded instrument ensures no interference between your chest strap and your watch, necessary if you are training in busy gyms or trails where other signals may be encountered.": ["Yes"], "Workout history": ["Yes"], "Wireless sync": ["Yes"], "WiFi": ["Yes"], "Button lock": ["Yes"], "Batteries": ["Lithium-ion (included)"], "Haptic feedback": ["Yes"], "Case diameter": ["44mm"], "Virtual partner\n\nAllows user to monitor training goals with either a virtual partner or alarms.": ["Yes"], "Pause timer\n\nPauses the timer when slowing or stopping, and automatically resumes when moving again.": ["Yes"], "Replaceable wrist strap": ["Yes"], "Pace alarm\n\nAn alarm that notifies you if you vary from a pre-set pace.": ["Yes"], "ANT+ compatible\n\nEnsures seamless digital wireless communication between ANT+ devices. For example, data from an ultra-low power wireless sensor can be displayed on a bike computer or smartphone, then downloaded to a PC, etc.": ["Yes"], "Made in": ["Taiwan"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9202306580510/6015401-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9202295996446/6015401-BK000-ALT-A.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9202296094750/6015401-BK000-ALT-B.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9202296127518/6015401-BK000-ALT-C.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9202296487966/6015401-BK000-ALT-D.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9202296520734/6015401-BK000-ALT-E.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9202306580510/6015401-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9202295996446/6015401-BK000-ALT-A.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9202296094750/6015401-BK000-ALT-B.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9202296127518/6015401-BK000-ALT-C.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9202296487966/6015401-BK000-ALT-D.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9202296520734/6015401-BK000-ALT-E.jpg"]}