{"name": "Magicshine MJ 906B 3200 Lumen Bluetooth Front Light", "categories": ["Home", "All", "Cycling", "Bike accessories", "Bike lights", "Front bike lights", "MJ 906B 3200 Lumen Bluetooth Front Light"], "description": "A customizable light for hitting the trails after dark. A powerful light with 5 modes, it pairs with a free app to dial in exact brightness from 1-100%. Set a mode, choose flash options and brightness. The app offers custom profiles, so you can set up mountain biking options like a low mode for climbing plus bright for descending. Ride streets with an eye-catching flash or any other light mode you choose, without having to cycle through modes you never use.5 levels: 100%, 75%, 50%, 20% and flash. Light locks into lowest setting when power is 5% or less.Free app allows profile customization over Bluetooth®.2.4GHz wireless remote control for switching modes or powing on and off.Single button control: easy to use with gloves on, and remembers last mode used.Customized optics offer wide, flood light (20º spread).USB rechargeable 5200mAh battery straps to frame.Battery doubles as a USB powerbank (5V, 2A output).4-level LED battery status works when charging or in use.Machined aluminum housing with integrated heat-sink reduces heat build up.IPX4 weatherproofing keeps the light shining during heavy rain.O-ring mounting system fits all handlebars.Note: when not in use, the remote draws a small amount of power, enough to drain the battery over 1-2 weeks. Disconnect the battery when not in use to preserve power.", "product_code": "6016-461", "tech_specs": {"Weight": ["287g"], "Ideal for": ["Mountain biking", "Gravel riding"], "Included mounts": ["Handlebar mount"], "Type\n\nMost Canadian municipalities require a white front light and a red rear light.": ["Front"], "Light modes\n\nThe number of lighting levels/modes the light has (i.e., low, med, high, flash).": ["Programmable"], "Boost mode\n\nBriefly increases the light output to maximum brightness and distance.": ["No"], "Light source": ["5 Cree XM-L2 U2 LEDs"], "Max light output\n\nThe total quantity of light emitted in every direction from a source of light; measured in lumens.": ["3200 lumens"], "Charge time\n\nThe amount of time it takes to fully charge the battery. Applies to lithium and NiMH type batteries. Does not apply to rechargeable or non-rechargeable AA or AAA batteries.": ["9 h"], "Rechargeability\n\nRechargeable lights give you hassle-free recharging with almost any power source. Replaceable batteries provide instant power, but you’ll need to bring extra batteries, recycle used ones and buy new ones.": ["Rechargeable"], "Helmet attachment\n\nIncludes a bracket or mounting system that attaches to most bike helmets.": ["Yes"], "Red light mode": ["No"], "Regulated output\n\nOn regulated lights brightness is consistent, and does not decrease gradually as the batteries are drained.": ["Yes"], "Batteries": ["Lithium-ion 5200mAh (included)"], "Flash mode": ["Yes"], "Product sustainability": ["Rechargeable batteries"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9199331737630/6016461-BK000.jpg"]}