{"name": "Magicshine MOH 55 Aquila Pro 4000 Lumen Helmet Light", "categories": ["Home", "All", "Cycling", "Bike accessories", "Bike lights", "Front bike lights", "MOH 55 Aquila Pro 4000 Lumen Helmet Light"], "description": "See exactly where you’re going, not just where the bike is pointing. A powerful helmet mounted light changes the night-riding game. Pumping out 4000 lumens, the Aquila Pro carves a tunnel of light out of the dark. There's a mode for every part of the ride, from slow climbs, to flowing single track and flat-out descents. And, the USB powered battery pack is easy to charge, making “good enough” batteries a thing of the past.5 levels: 100%, 50%, 25%, 10% and flash. Light locks into lowest setting when power is 5% or less.Hybrid mode combines spot (28º spread) and flood (102º spread)Run times: 4000 lumens (2.25h), 1500 lumens (6.3h), 600 lumens (20.3h) and 100 lumens (89h).Tiltable head aims light where you want it.Single button control: easy to use with gloves on and remembers last mode used.USB rechargeable 10,000mAh battery tucks in your pack or jacket.Battery doubles as a USB powerbank (5V, 2A output).4-level LED battery status works when charging or in use.Machined aluminum housing with integrated heat sink reduces heat build up.IPX6 weatherproofing keeps light shining in heavy downpours.Integrated Garmin ¼-turn mount and GoPro mount gives you options to use existing mounts.", "product_code": "6016-460", "tech_specs": {"Weight": ["563g"], "Ideal for": ["Mountain biking", "Gravel riding"], "Included mounts": ["Helmet mount"], "Type\n\nMost Canadian municipalities require a white front light and a red rear light.": ["Front"], "Light modes\n\nThe number of lighting levels/modes the light has (i.e., low, med, high, flash).": ["15 modes"], "Boost mode\n\nBriefly increases the light output to maximum brightness and distance.": ["No"], "Light source": ["2 Cree XHP-50.2 LEDs"], "Burn Time - steady": ["2-89 h"], "Max light output\n\nThe total quantity of light emitted in every direction from a source of light; measured in lumens.": ["4000 lumens"], "Charge time\n\nThe amount of time it takes to fully charge the battery. Applies to lithium and NiMH type batteries. Does not apply to rechargeable or non-rechargeable AA or AAA batteries.": ["9 h"], "Rechargeability\n\nRechargeable lights give you hassle-free recharging with almost any power source. Replaceable batteries provide instant power, but you’ll need to bring extra batteries, recycle used ones and buy new ones.": ["Rechargeable"], "Helmet attachment\n\nIncludes a bracket or mounting system that attaches to most bike helmets.": ["Yes"], "Red light mode": ["No"], "Regulated output\n\nOn regulated lights brightness is consistent, and does not decrease gradually as the batteries are drained.": ["Yes"], "Batteries": ["Lithium-ion 10000mAh (included)"], "Flash mode": ["Yes"], "Product sustainability": ["Rechargeable batteries"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9202284855326/6016460-BK000.jpg"]}