{
  "categories": [
    "Home",
    "All",
    "Camping and hiking",
    "Electronics",
    "Electronics cases",
    "Camera and radio cases",
    "1300 Case"
  ],
  "description": "Long the standard-issue protection for cameras, radios, and other delicate equipment. Canoeists and kayakers love Pelican Cases for keeping cameras easily accessible, yet utterly safe and secure. Because they are fully watertight they are also airtight. The larger cases have a finger-operated purge valve so after flying or climbing you can equalize the interior air pressure to make them easier to open.Made of lightweight structural foam resin that won’t dent, crack, or corrode. Light enough to float in salt water with a load up to 5.6kg.Sturdy gasket around the rim makes them watertight.Removable pick-n-pluck foam is perforated into cubes, so you can customize the size and shape of inner compartment.Both the Pelican warranty and MEC's Rocksolid Guarantee cover this case itself. Neither guarantee covers the contents you put inside the case.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8844015239198/4001189-YLW00.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8844015239198/4001189-YLW00.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Pelican 1300 Case",
  "product_code": "4001-189",
  "source_url": "https://www.mec.ca/en/product/4001-189/1300-Case",
  "tech_specs": {
    "Crushproof": [
      "Yes"
    ],
    "Customizable foam\n\nThe interior can be custom-fitted to accommodate various device storage.": [
      "Yes"
    ],
    "External dimensions": [
      "27 x 25 x 17.4cm"
    ],
    "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": [
      "IP X7"
    ],
    "Ideal for": [
      "Watersports",
      "Travel"
    ],
    "Internal dimensions": [
      "23.3 x 17.8 x 15.5cm"
    ],
    "Made in": [
      "USA"
    ],
    "Material": [
      "ABS"
    ],
    "Submersible": [
      "Yes"
    ],
    "Waterproofness\n\nWaterproof bags and cases are made with waterproof materials and have waterproof closures. Some are designed to be submersible. Water-resistant bags and cases are made with waterproof materials, but water could sneak in through the seams or closure.": [
      "Waterproof"
    ],
    "Weight": [
      "1.6kg"
    ]
  }
}