{
  "categories": [
    "Home",
    "All",
    "Camping and hiking",
    "Electronics",
    "Electronics cases",
    "Camera and radio cases",
    "Mini Camera Case 408"
  ],
  "description": "Take great pictures while kayaking, rafting or snorkelling. On land, the case protects your digital camera from dust and grit.Made of UV-stabilized polymers that don't break down or discolour in sunlight.In direct sunlight, the air inside a transparent case heats up and causes condensation, to reduce this use desiccant packs.High-frequency welded seams are as strong as the surrounding material.Case dimensions are 11.5 x 18.5cm.Fits a camera with a 20cm circumference. Not suitable for cameras with a zoom lens.Equipped with an adjustable lanyard.Guaranteed to IPX8 standard, submersible to 5m.Both the Aquapac® warranty and MEC's Rocksolid Guarantee cover this case itself. Neither guarantee covers the contents you put inside the case.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817433935902/5025316-NOC02.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817433935902/5025316-NOC02.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Aquapac Mini Camera Case 408",
  "product_code": "5025-316",
  "source_url": "https://www.mec.ca/en/product/5025-316/Mini-Camera-Case-408",
  "tech_specs": {
    "Closure": [
      "Watertight clip"
    ],
    "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": [
      "IP X8"
    ],
    "Ideal for": [
      "Watersports"
    ],
    "Length": [
      "18.5cm"
    ],
    "Made in": [
      "United Kingdom"
    ],
    "Material": [
      "Thermoplastic polyurethane"
    ],
    "Ruggedness\n\nFair: made of lightweight materials and designed to be carried inside another bag. Good: strikes a balance between light weight and durability. Excellent: made of heavy duty materials and designed to be carried alone. Exceptional: made of ultra-tough materials and designed to withstand abuse.": [
      "Excellent"
    ],
    "Submersible": [
      "Yes"
    ],
    "Waterproofness\n\nWaterproof bags and cases are made with waterproof materials and have waterproof closures. Some are designed to be submersible. Water-resistant bags and cases are made with waterproof materials, but water could sneak in through the seams or closure.": [
      "Waterproof"
    ],
    "Weight": [
      "47g"
    ],
    "Width": [
      "11.5cm"
    ]
  }
}