{
  "categories": [
    "Home",
    "All",
    "Camping and hiking",
    "Camping kitchen and hydration",
    "Water bottles and water treatment",
    "Water filters, treatment and tablets",
    "Water filters",
    "Gravity filters",
    "GravityWorks 4.0L Filter System"
  ],
  "description": "This pump-free system is gravity fed and offers a high-flow capacity. Fill the unfiltered water reservoir, raise, and hang it. You'll have 4L of clean water in under 3 minutes.The fibres in this filter are slightly more brittle than other types. Although the cartridge is encased in a protective rubber shell, and drop-tested to seven feet, consider carrying a spare cartridge on long trips – they are small, light, and relatively inexpensive.Filters 4L of water in less than 3 minutes (depends on water quality).Hollow fibre filter has a high surface-area that allows water to flow quickly through a 0.2 micron effective pore size.Do not allow the cartridge to freeze after initial use.Nominal 1500L filter life is for clear water, turbidity will reduce the useful life of any filter.Maintain a high flow rate in the field by holding the clean water reservoir above the unfiltered reservoir. No disassembly required.Unfiltered reservoir has a webbing handle for carrying and hanging. Quick-disconnect valve automatically cuts the flow of water when the hose is disconnected. Hose connection on the side won't collect silt and debris.Clean reservoir has a webbing loop and a simple hose connection, and no top zipper, so it won't pop open while in use.Reservoirs are made of silver ion-treated polyethylene film that doesn't pick up tastes.Clip-style shut-off valve on output hose between reservoirs.Silicone tubing.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8812679692318/5035528-NOC02.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8812680052766/5035528-NOC02-ALT-INSITU.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8812679692318/5035528-NOC02.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8812680052766/5035528-NOC02-ALT-INSITU.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8812679692318/5035528-NOC02.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8812680052766/5035528-NOC02-ALT-INSITU.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8812679692318/5035528-NOC02.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8812680052766/5035528-NOC02-ALT-INSITU.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Platypus GravityWorks 4.0L Filter System",
  "product_code": "5035-528",
  "source_url": "https://www.mec.ca/en/product/5035-528/GravityWorks-4-0L-Filter-System",
  "tech_specs": {
    "Cartridge life\n\nThe life of the filter cartridge is based on the quantity of water you can treat before the cartridge is no longer effective. This does not apply to battery operated or chemical filter systems.": [
      "1500L"
    ],
    "Dimensions": [
      "4.5 x 14.7cm"
    ],
    "Effective against bacteria\n\nBacteria can cause illnesses such as diarrhea and dysentery and are about 1.0 micron in size, although some can be as small as 0.2 microns.": [
      "Yes"
    ],
    "Effective against particulate\n\nParticulate consists of very small bits and pieces such as dirt or bugs.": [
      "Yes"
    ],
    "Effective against protozoa\n\nProtozoa are larger than one micron and include cryptosporidium and giardia.": [
      "Yes"
    ],
    "Effective against viruses\n\nMost viruses are in the 0.1 micron size range, but they can be as small as 0.002 microns.": [
      "No"
    ],
    "Filter size\n\nA 0.5 micron or smaller filters protozoa and some large bacteria; 0.2 micron or smaller filters smaller bacteria such as campylobacter.": [
      "0.2microns"
    ],
    "Filter type\n\nWater can be treated using various types of filters, chemicals or non-chemical purification methods, or a combination. Filters on their own will not remove viruses as they are too small.": [
      "Hollow fibre technology"
    ],
    "Ideal for": [
      "Camping and hiking"
    ],
    "Made in": [
      "USA"
    ],
    "Output": [
      "1.75L/min"
    ],
    "Weight": [
      "326g"
    ]
  }
}