{
  "categories": [
    "Home",
    "All",
    "Climbing",
    "Rock climbing",
    "Climbing helmets",
    "Shield Helmet"
  ],
  "description": "This kid’s climbing helmet gets high marks for style and safety. The Wing-Fit system has a rear adjustment dial that lets them adjust the fit quickly and easily.Lightweight in-mold construction combines an expanded polystyrene foam core with a tough polycarbonate shell.Airflow system has large side vents to ensure a constant supply of fresh air circulating around the head.Innovative under-ear closure moves the buckle away from the chin and neck.Integrated headlamp clips.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8810258137118/5040686-SAH01.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8810258137118/5040686-SAH01.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Edelrid Shield Helmet - Children to Youths",
  "product_code": "5040-686",
  "source_url": "https://www.mec.ca/en/product/5040-686/Shield-Helmet",
  "tech_specs": {
    "Approved for\n\nMost helmets are tested and certified for a specific sport. Some helmets are approved for multi-sports, but only after passing the safety tests for both sports (i.e., snowsports and cycling).": [
      "Climbing"
    ],
    "Circumference\n\nThe internal circumference determines the size head that the helmet will fit.": [
      "48-56cm"
    ],
    "Construction\n\nMicroshell helmets are made of a thin polymer sheet over a foam liner; Hardshell helmets have a hard polymer outer shell and a foam liner; when the liner is being bonded to the outer shell during the manufacturing process, it is Molded in the shell.": [
      "Molded in the shell"
    ],
    "Fit system": [
      "Adjustable dial",
      "Interchangeable foam pads"
    ],
    "Headlamp compatible": [
      "Yes"
    ],
    "Ideal for": [
      "Snow and ice climbing",
      "Rock climbing"
    ],
    "Inner material": [
      "EPS (expanded polystyrene)"
    ],
    "Made in": [
      "China"
    ],
    "Safety rating\n\nCetification is established by a variety of governing bodies who set impact standards. Most helmets are certified or approved for a specific sport, except in the case of multi-sport helmets (i.e., a snowsports helmet might also be approved for cycling if it meets the cycling safety standards).": [
      "EN 12492"
    ],
    "Shell material": [
      "Polycarbonate"
    ],
    "Vents": [
      "Yes"
    ],
    "Weight": [
      "248g"
    ]
  }
}