{
  "categories": [
    "Home",
    "All",
    "Camping and hiking",
    "Tools and accessories",
    "Binoculars and monoculars",
    "UP 8x25 WP Binoculars"
  ],
  "description": "Zero in on an eagle's nest or the series of rapids you want to scope. These waterproof binoculars offer quality Pentax multicoated optics in a compact size.  The UP line are porro-prism binoculars with a dual-axis, single body housing with synchronized eyepiece adjustment. Aspherical lens elements give you edge-to-edge sharpness.Multicoated optics allow max light transmission with minimal internal glare and flare.Uni-body design has few moving parts and synchronizes the eyepiece movement.Aspherical lenses provide exceptional clarity from the centre to the edges of your field of view.JIS Class 6 waterproof construction and full-body rubber housing protects against water and shock.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8813683408926/5043288-GRN00.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8813683408926/5043288-GRN00.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Pentax UP 8x25 WP Binoculars",
  "product_code": "5043-288",
  "source_url": "https://www.mec.ca/en/product/5043-288/UP-8x25-WP-Binoculars",
  "tech_specs": {
    "Dimensions": [
      "10.9 x 6.9 x 11.7cm"
    ],
    "Diopter adjustment\n\nThese binoculars can be adjusted for variances between right and left eye vision.": [
      "Yes"
    ],
    "Dust proof": [
      "No"
    ],
    "Exit pupil\n\nThe diameter of the objective (outside) lens divided by the binocular's magnification. It indicates the amount of light that reaches your eye (most noticeable in low light conditions). Higher numbers offer brighter images.": [
      "3.1mm"
    ],
    "Eye relief\n\nThe distance between the eyepiece and your eye while still allowing entire field of view. Long eye relief is good for eyeglass wearers.": [
      "15mm"
    ],
    "Field of view\n\nThe widest dimension of circular viewing area that you can see.": [
      "108m"
    ],
    "Fogproof": [
      "Yes"
    ],
    "Ideal for": [
      "Everyday use"
    ],
    "Includes case": [
      "Yes"
    ],
    "Lens coating\n\nLens coatings reduce light loss and glare to increase contrast and diminish eyestrain. Coated: one layer on external surfaces only. Fully coated: every surface is coated. Multi-coated: multiple layers on some of the surfaces. Fully multi-coated: multiple layers on every optical surface.": [
      "Fully multi-coated"
    ],
    "Made in": [
      "China"
    ],
    "Magnification\n\nThis tells you how many times an object is magnified when observed through the binoculars.": [
      "8"
    ],
    "Minimum focus\n\nThe nearest distance at which the binoculars will focus on an object.": [
      "192cm"
    ],
    "Objective lens\n\nThe diameter of the objective lens will impact how bright, sharp, and comfortable your view is. Generally, bigger is better.": [
      "25mm"
    ],
    "Waterproof\n\nWaterproof binoculars are assembled with O-rings and are purged with nitrogen to avoid condensation. They are ideal for boating or use in rainy weather.": [
      "Yes"
    ],
    "Weight": [
      "349g"
    ]
  }
}