{
  "categories": [
    "Home",
    "All",
    "Climbing",
    "Mountaineering and ice climbing",
    "Mountaineering boots",
    "Trango Ice Cube Gore-Tex Boots"
  ],
  "description": "For fast, light alpine missions, the Trango Ice Cube offers superb performance on snow, ice and rock. Seamless uppers are waterproof and have protective integrated gaiters to keep out snow and debris. They're light enough that you won't feel weighed down when throwing a figure 4, kicking steps or billy-goating along ridgelines. For sustained snowy routes or summer trekking, waterproof-breathable liners ensure protection and outstanding temperature control. Carbon shafts underfoot add rigidity for use with crampons and the midsoles absorb the impact of rough terrain on convoluted descents. Lateral flexibility in the ankles adds stability to make your foot placements precise and controlled on edges and on steep faces.Uppers are synthetic fabric that's injected with a thermo-plastic for outstanding waterproofing and abrasion resistance.Schoeller soft shell gaiter with a heat-sealed, water-repellent zip to keep out snow and water.Lace system features external eyelets for a nuanced fit.Waterproof-breathable GORE-TEX insulated comfort liner.Footbed uses insulated 3mm carbon Honeycomb tech shaft for rigidity without heaviness.Midsole has shock absorbing polyurethane inserts in the toe and heel.3D Flex System allows for lateral ankle movement for control on uneven terrain.Vibram® sole with impact braking system lugged heel and sticky rubber compound in the toe for precise edging.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8808344420382/5043253-BK059.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8808344420382/5043253-BK059.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8808344420382/5043253-BK059.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8808344420382/5043253-BK059.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "La Sportiva Trango Ice Cube Gore-Tex Boots - Men's",
  "product_code": "5043-253",
  "source_url": "https://www.mec.ca/en/product/5043-253/Trango-Ice-Cube-Gore-Tex-Boots",
  "tech_specs": {
    "Closure": [
      "Lace-up"
    ],
    "Crampon compatibility\n\nRigid boots with defined toe and heel welts can use compatible step-in crampons or any other type of crampon. Rigid boots with a heel welt but no toe welt can use hybrid crampons or strap-on crampons. Semi-rigid boots can use strap-on crampons only.": [
      "Step-in"
    ],
    "Ideal for": [
      "Snow and ice climbing"
    ],
    "Insulated": [
      "Yes"
    ],
    "Made in": [
      "Italy"
    ],
    "Rand\n\nRubber on the toe and around the boot improves durability. It can also increase grip while scrambling.": [
      "Full rand"
    ],
    "Removable inner boot": [
      "No"
    ],
    "Removable insole": [
      "Yes"
    ],
    "Upper material": [
      "Synthetic leather"
    ],
    "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": [
      "Yes"
    ],
    "Weight": [
      "1.45kg (43)"
    ]
  }
}