{
  "categories": [
    "Home",
    "All",
    "Climbing",
    "Climbing footwear",
    "Climbing shoes",
    "Otaki Rock Shoes"
  ],
  "description": "Precisely curved and exacting, these shoes suit in-your-face routes and powerful climbing. The Velcro® closures are designed to push your foot forward to get power into your toes so you can work small holds and overhanging terrain. The heel is crafted for stability, with very firm rubber on the inside edge that resists being deformed under torsion so you can set a heel hook and bear down on it. Shaped like a classic slipper, the Otaki is a precision instrument that sings on the sharp end.Uppers are leather with microfiber, lined only in the front for a glove-like, sensitive fit.Hook-and-loop closure for easy on/off and to tune in a performance fit.Downturned performance fit for precise placements on small holds and dime-sized edges.S-Heel construction is designed for stable, confident heel hooking.Slip-lasted construction with 1.1mm P3 (Permanent Power Platform) midsoles.Soles are 4mm Vibram® XS Grip2.La Sportiva suggests downsizing 1-1.5 sizes (performance fit) or 0.5-1 sizes (comfort fit) from your street shoe size.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8809650356254/5044820-SLF01.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8809650356254/5044820-SLF01.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "La Sportiva Otaki Rock Shoes - Women's",
  "product_code": "5044-820",
  "source_url": "https://www.mec.ca/en/product/5044-820/Otaki-Rock-Shoes",
  "tech_specs": {
    "Asymmetry\n\nHighly asymmetric shoes allow more precision and focused power. Symmetrical shoes are more comfortable for all-around climbing.": [
      "High"
    ],
    "Closure": [
      "Hook-and-loop"
    ],
    "Ideal for": [
      "Bouldering",
      "Indoor climbing",
      "Sport and toprope climbing"
    ],
    "Lined": [
      "Partial"
    ],
    "Made in": [
      "Italy"
    ],
    "Outsoles": [
      "4mm Vibram XS Grip 2"
    ],
    "Stiffness\n\nStiffness is provided by the type of sole and the tensioning system. Softer shoes allow more precision. Supportive shoes prevent fatigue.": [
      "Supportive"
    ],
    "Type\n\nA neutral shoe suits long routes and cracks. Moderate shoes allow precision and good edging. Aggressive shoes are downturned and tensioned, for power to the toe on steep or overhanging routes.": [
      "Moderate"
    ],
    "Uppers": [
      "Leather and synthetic"
    ],
    "Weight": [
      "350g (38)"
    ]
  }
}