{
  "categories": [
    "Home",
    "All",
    "Packs and bags",
    "Daypacks and school bags",
    "Daypacks",
    "Speed 30 Backpack"
  ],
  "description": "A streamlined climbing pack for fast and light alpine ascents. Black Diamond's ergoACTIV suspension system provides unparalleled freedom of movement for technical rock and ice routes. When weight is at a premium, the pack's padded hipbelt, frame, framesheet and top lid are all removable to convert it to a stripped down, ultra-light summit pack. The 30L size is ideal for intense car-to-car objectives or minimalist bivies en route.Main fabric is nailhead nylon reinforced with panels of welded nylon for abrasion resistance.ergoACTIV hipbelt uses a proprietary ball joint for mobility in all directions.Thermoformed backpanel for lightweight comfort and breathability.Top loading with spindrift collar, roll top closure and tuck away rope strap.Side compression straps provide volume adjustment.Floating lid is removable and has an external zippered pocket.Ice-tool PickPockets provide tool attachment for technical alpine and ice ascents.Removable 20mm crampon straps.Removable padded hipbelt with fixed webbing belt for stripped down summit pack.Hipbelt gear loops for rock gear or ice screws.Hydration system compatible for hydrating on the move.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8814361772062/5045547-GRA00.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8814361772062/5045547-GRA00.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Black Diamond Speed 30 Backpack - Unisex",
  "product_code": "5045-547",
  "source_url": "https://www.mec.ca/en/product/5045-547/Speed-30-Backpack",
  "tech_specs": {
    "Access\n\nThe location of all access points into the main compartment of the pack.": [
      "Top"
    ],
    "Additional feature(s)": [
      "Compression straps",
      "Crampon patch",
      "Hydration compatible (reservoir sold separately)",
      "Ice axe/pole attachment",
      "Expandable collar"
    ],
    "Dynamic suspension\n\nThe hipbelt and/or shoulder straps of the pack are designed to move, pivot or flex to follow your body’s movements.  Each brand uses their own technology.": [
      "Yes"
    ],
    "Hipbelt": [
      "Removable padded"
    ],
    "Hipbelt circumference": [
      "66-102cm (Small/Medium)",
      "71-114cm (Medium/Large)"
    ],
    "Ideal for": [
      "Alpine climbing and mountaineering",
      "Rock climbing",
      "Day hiking"
    ],
    "Lid type\n\nSome pack lids can be adjusted to compensate for overloaded packs, or even removed, and some removeable lids have tuck-away hipbelts that allow youto use them as a waistpack.": [
      "Adjustable",
      "Removable"
    ],
    "Made in": [
      "Philippines"
    ],
    "Main fabric": [
      "210-denier nylon"
    ],
    "Secondary fabric": [
      "420-denier nylon"
    ],
    "Ventilated back panel": [
      "No"
    ],
    "Volume": [
      "28L (Small/Medium)",
      "30L (Medium/Large)"
    ],
    "Weight": [
      "1.14kg (Small/Medium)",
      "1.16kg (Medium/Large)"
    ]
  }
}