{
  "categories": [
    "Home",
    "All",
    "Camping and hiking",
    "Headlamps and lighting",
    "Flashlights",
    "LD22 Flashlight"
  ],
  "description": "Switch lighting modes for ultimate illumination. Tactical Mode turns off the side switch and activates the turbo, strobe and mid modes through the tail switch. Outdoor mode works like a regular flahlight. Just two AA batteries operate the LD22, and it gets a big lumen upgrade from 215 to 300. Brighten up any dark corner or trail.Anti-roll, slip-resistant body design made of durable aircraft-grade aluminum.Premium hard-anodized anti-abrasive finish.Toughened ultra-clear glass lens with anti-reflective coating.Utilizes a Cree XP-G2(R5) LED with a lifespan of 50,000 hours.Constant brightness.Powered by 2, AA (Ni-MH/Alkaline) batteries.Stainless steel side body switch for output selection under outdoor mode.Outdoor mode gives you standard flashlight operation. A side switch controls all output modes and the tail switch simply turns the light on and off.Tactical push-button tail cap switch with momentary-on function.2-way pocket clip included.Intelligent memory circuit (under outdoor mode) automatically enters previous used brightness level when turned on.Includes holster, lanyard, 2 spare o-rings, 2 AA (alkaline) batteries, manual, and warranty card.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8813069303838/5046349-BK000.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8813069303838/5046349-BK000.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Fenix LD22 Flashlight",
  "product_code": "5046-349",
  "source_url": "https://www.mec.ca/en/product/5046-349/LD22-Flashlight",
  "tech_specs": {
    "Batteries": [
      "2 AA (not included)"
    ],
    "Beam distance - boost": [
      "120m"
    ],
    "Beam pattern\n\nBeam pattern affects how much you can see within the area of light thrown from the headlamp. Wide beams are good for close-up; spot or focussed beams are good for long range visibility.": [
      "Spot"
    ],
    "Body material": [
      "Metal"
    ],
    "Boost mode\n\nBriefly increases the light output to maximum brightness and distance.": [
      "Yes"
    ],
    "Burn time - high": [
      "7 h"
    ],
    "Burn time - low": [
      "100 h"
    ],
    "Burn time - med": [
      "25 h"
    ],
    "Flash mode": [
      "Yes"
    ],
    "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": [
      "IP X8"
    ],
    "Ideal for": [
      "Everyday use",
      "Emergency preparedness"
    ],
    "Light modes\n\nThe number of lighting levels/modes the light has (i.e., low, med, high, flash).": [
      "6 modes"
    ],
    "Light source": [
      "Cree XM-L2 LED"
    ],
    "Made in": [
      "China"
    ],
    "Max light output\n\nThe total quantity of light emitted in every direction from a source of light; measured in lumens.": [
      "300 lumens"
    ],
    "Pocket clip": [
      "Yes"
    ],
    "Rechargeability\n\nRechargeable lights give you hassle-free recharging with almost any power source. Replaceable batteries provide instant power, but you’ll need to bring extra batteries, recycle used ones and buy new ones.": [
      "Non-rechargeable"
    ],
    "Red light mode": [
      "No"
    ],
    "Regulated output\n\nOn regulated lights brightness is consistent, and does not decrease gradually as the batteries are drained.": [
      "Yes"
    ],
    "Weight": [
      "72g"
    ]
  }
}