{
  "categories": [
    "Home",
    "All",
    "Ski and snowboard gear",
    "Backcountry skiing gear",
    "Backcountry ski boots",
    "TLT7 Expedition CR Ski Boots"
  ],
  "description": "An innovative ski mountaineering boot that does more with less. Dynafit’s TLT series improves yet again with the 7 Expedition. At 999g per boot, it's 180g lighter than its predecessor. The toe welt is gone from the toebox, moving the insert back 5mm, giving you a more natural stride. A single UltraLock 3.0 buckle opens, closes and adjusts at a micro level to shave more weight, improve boot durability (fewer snags and catches) and dial in your fit. The speed nose and set-back pivot point are tuned to conserve energy on the ascent and promote efficiency on long tours and ski mountaineering days.Lower shells, cuff and spoiler are Grilamid (polyamide) and carbon infused Grilamid for agility and walkability.Lambda frame acts as an exoskeleton to improve stiffness and power transfer without the addition of unecessary material.Forward lean is adjustable between 15 and 18 degrees.Speed nose offers a shortened toebox and rotation point to make walking even more efficient.UltraLock 3.0 system uses a single buckle to control the walk/ski mode.Micro-adjustability lower shell can remain tight, while the cuff is open for comfortable touring fit.Custom Light thermo-mouldable liner with anatomic construction, optional lacing system and closed cell insulation on the sole.Cuff rotation of 60 degrees ensures comfort and range of motion.Formula Pomoca outsole is mountaineering focussed so you have grip and traction on difficult terrain.Strong master step inserts allow a release value up to 16 without any modifications.Snow-dynamic design slides through powder and avoids lateral obstructions.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8853548367902/5051978-WHT06.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8853548367902/5051978-WHT06.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Dynafit TLT7 Expedition CR Ski Boots - Women's",
  "product_code": "5051-978",
  "source_url": "https://www.mec.ca/en/product/5051-978/TLT7-Expedition-CR-Ski-Boots",
  "tech_specs": {
    "Boot/binding compatibility\n\nThe boot and binding systems must match for best performance and safe use.": [
      "Tech"
    ],
    "Buckles": [
      "2"
    ],
    "Forward lean\n\nForward lean affects a skiers balance. Some boots have a set forward lean angle; some are adjustable. Less lean places your knees in a more upright (almost standing) position, whereas more lean positions your knees forward over the ball of your feet.": [
      "15-18º"
    ],
    "Hike mode\n\nA mechanism that allows to release the boot cuff to switch to tour mode.": [
      "Yes"
    ],
    "Ideal for": [
      "Ski mountaineering",
      "Alpine touring"
    ],
    "Lace-up option": [
      "Yes"
    ],
    "Lower shell material": [
      "Grilamid",
      "Carbon fibre"
    ],
    "Made in": [
      "Italy"
    ],
    "Range of motion\n\nThe range of motion of the boot when in hike mode.": [
      "60º"
    ],
    "Shell cuff material": [
      "Grilamid",
      "Carbon fibre"
    ],
    "Sole type\n\nAlpine Touring: with tread; compatible with DIN touring bindings. Alpine Touring Tech (Tech): with tread; compatible with G3 Onyx and Dynafit. Downhill: without tread; compatible with freeride/downhill bindings.": [
      "Tech"
    ],
    "Thermoformable inner boot": [
      "Yes"
    ],
    "Weight": [
      "1.99kg (27)"
    ]
  }
}