{
  "categories": [
    "Home",
    "All",
    "Camping and hiking",
    "Electronics",
    "GPS Navigation",
    "GPS watches",
    "Fenix 5X Sapphire"
  ],
  "description": "The largest, most feature-rich of the Fenix 5 line, the 5X retains all the multisport and smartwatch functions and adds turn-by-turn mapping and round-trip mapping. Get directions and find local points of interest on the installed maps right from your watch. The 5X has an ultra-durable sapphire crystal face that stays clear and easy to read.  Wifi lets you connect and share your activities on Garmin Connect. Garmin Elevate optical heartrate technology provides data without needing a chest strap. Activity profiles, from snowsports, running, biking, swimming (and even golf) let you put metrics on nearly any activity. Embrace the social side of fitness with support for Strava segments and Garmin’s GroupTrack among others. Get fast accurate signals with the EXO antenna that connects to standard GPS satellites and GLONASS satellites. Not just for the backcountry, with features like activity tracking, sleep monitoring, and smart notifications, the Fenix 5X is useful every day.Virtually scratchproof sapphire crystal face.Includes Canadian map data, with room for more maps.Large internal memory and fast processor handle turn-by-turn mapping, round-trip mapping, and more.Round-trip mapping: choose the distance you want, and the 5X plots course options to take you out and back to where you started.Wifi-enabled for automatic activity uploads to Garmin Connect™ for easy sharing.Low-profile Elevate™ optical heart-rate monitor for training without a chest strap.Optical heart-rate sensors measure changes in blood volume under the skin, and work best when worn snugly, 1 to 3 finger-widths above your wrist bone.Strava Segment integration shows when your starred segment is about to begin and shows instantaneous data to compare your PR to the current KOM or QOM.GroupTrack displays the location and telemetry of your contacts using compatible devices.Personal Records (PRs) indicate your best on distances like 1 mile and 5K.Virtual racer functions lets you compete against your own time, friends or pro athletes on Garmin Connect.Multisport mode allows for easy transitions between activities within a single workout.Create custom profiles for cycling, running or swimming.Internal accelerometer and gyroscope track speed/distance when using a stationary trainer.Physiological metrics includes VO2 max estimate, lactate threshold (requires a heart-rate chest strap, sold separately), race predictor, recovery advisor and performance indicator.Navigates routes created on Garmin Connect, backtracks your outbound route, or leads you directly to saved waypoints.UltraTrac mode allows you to reduce the GPS recording rate in order to conserve battery.Integrated Garmin EXO antenna for outstanding signal reception from GPS and GLONASS satellites.Full altimeter, barometer and compass functions.Daily activity tracking tracks steps, sleep patterns and other everyday essentials.Connect IQ support allows you to download apps, templates, data fields, watch faces, and other features.Automatically syncs data to paired smartphones running the free Garmin Connect app.Bluetooth Smart and ANT+ compatibility can be used simultaneously, and syncs with compatible activity sensors.Smart notifications (emails, texts, alerts and more) via Bluetooth connection to a compatible smartphone.New QuickFit™ strap interface allows for easy strap removal, perfect for giving your watch a new look, or just a thorough clean.Connects to a variety of Garmin devices including Virb action cameras, Vector power meters, the Varia radar line and more.In the box: Fenix 5X, charging/data cable, documentation.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8874579722270/5053931-BK344.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8875720015902/5053931-BK344-ALT-BACK.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8876342575134/5053931-BK344-ALT-READOUTS.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8876342804510/5053931-BK344-ALT-READOUTSANGLE.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8875720802334/5053931-BK344-ALT-SIDERIGHT.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8876343787550/5053931-BK344-ALT-SIDELEFT.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8874579722270/5053931-BK344.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8875720015902/5053931-BK344-ALT-BACK.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8876342575134/5053931-BK344-ALT-READOUTS.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8876342804510/5053931-BK344-ALT-READOUTSANGLE.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8875720802334/5053931-BK344-ALT-SIDERIGHT.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8876343787550/5053931-BK344-ALT-SIDELEFT.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8874579722270/5053931-BK344.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8875720015902/5053931-BK344-ALT-BACK.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8876342575134/5053931-BK344-ALT-READOUTS.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8876342804510/5053931-BK344-ALT-READOUTSANGLE.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8875720802334/5053931-BK344-ALT-SIDERIGHT.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8876343787550/5053931-BK344-ALT-SIDELEFT.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8874579722270/5053931-BK344.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8875720015902/5053931-BK344-ALT-BACK.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8876342575134/5053931-BK344-ALT-READOUTS.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8876342804510/5053931-BK344-ALT-READOUTSANGLE.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8875720802334/5053931-BK344-ALT-SIDERIGHT.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8876343787550/5053931-BK344-ALT-SIDELEFT.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Garmin Fenix 5X Sapphire - Unisex",
  "product_code": "5053-931",
  "source_url": "https://www.mec.ca/en/product/5053-931/Fenix-5X-Sapphire",
  "tech_specs": {
    "12/24 hour format": [
      "Yes"
    ],
    "ANT+ compatible\n\nEnsures seamless digital wireless communication between ANT+ devices. For example, data from an ultra-low power wireless sensor can be displayed on a bike computer or smartphone, then downloaded to a PC, etc.": [
      "Yes"
    ],
    "Add maps capability\n\nThese units allow you to add maps, so you can mark and name waypoints and create routes on your PC, and then upload the map of your choice to your GPS.": [
      "Yes"
    ],
    "App compatibility\n\nAn online community where members upload, analyze and share activity data.": [
      "Garmin Connect",
      "Third party apps"
    ],
    "Auto pause\n\nAutomatically pauses timer when you stop or go below a specified pace.": [
      "Yes"
    ],
    "Barometric altimeter\n\nBarometer function helps forecast weather trends. An altimeter can provide one line of position for location on a topo map, useful if the GPS isn't working.": [
      "Yes"
    ],
    "Basemap\n\nA basic set of map data that is included with the GPS. Basemap detail may vary from unit to unit.": [
      "Yes"
    ],
    "Batteries": [
      "Lithium-ion (included)"
    ],
    "Battery life": [
      "24-300 h"
    ],
    "Battery power indicator": [
      "Yes"
    ],
    "Bluetooth": [
      "Yes"
    ],
    "Built-in memory": [
      "16GB"
    ],
    "Button lock": [
      "Yes"
    ],
    "Calorie consumption\n\nCalculated based on data from a heart rate monitor.": [
      "Yes"
    ],
    "Calories in real time\n\nDisplays calorie expenditure during activity, based on heart rate monitor data.": [
      "Yes"
    ],
    "Case diameter": [
      "51mm"
    ],
    "Chest strap": [
      "Sold separately"
    ],
    "Coded signal\n\nA coded instrument ensures no interference between your chest strap and your watch, necessary if you are training in busy gyms or trails where other signals may be encountered.": [
      "Yes"
    ],
    "Countdown timer": [
      "Yes"
    ],
    "Custom POI\n\nA POI (point of interest) is a specific location that someone may find interesting (i.e., favourite viewpoint, best coffee stop before the trailhead). The custom POI feature allows the user to load only the POI's that interest them onto their GPS unit.": [
      "Yes"
    ],
    "Data card": [
      "Not accepted"
    ],
    "Dimensions": [
      "5.1 x 5.1 x 1.8cm"
    ],
    "Distance/time alarm": [
      "Yes"
    ],
    "Electronic compass\n\nAn electronic compass allows the user to view their heading in situations where they are either standing still or moving too slowly for the GPS to detect.": [
      "Yes"
    ],
    "Face material\n\nPolycarbonate is inexpensive and light, with good clarity and wear-resistance. Mineral crystal glass offers greater clarity and significantly greater wear-resistance. Sapphire crystal is better still for clarity and wear-resistance.": [
      "Sapphire crystal"
    ],
    "Foot pod\n\nAttaches to your shoe, captures your running data (i.e., pace, distance), and transmits it to your heart rate monitor or GPS.": [
      "Sold separately"
    ],
    "Haptic feedback": [
      "Yes"
    ],
    "Heart rate in real time\n\nDisplays beats per minute during activity.": [
      "Yes"
    ],
    "Heart rate monitor": [
      "Yes"
    ],
    "Heart rate target zones\n\nDisplays heart rate zones during activity.": [
      "Yes"
    ],
    "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": [
      "IP X8"
    ],
    "Ideal for": [
      "Casual wear",
      "Running, fitness and training",
      "Camping and hiking",
      "Swim training",
      "Road cycling"
    ],
    "Interface": [
      "USB",
      "Wireless"
    ],
    "Interval training": [
      "Yes"
    ],
    "Low battery warning": [
      "Yes"
    ],
    "Lug width": [
      "26mm"
    ],
    "Made in": [
      "Taiwan"
    ],
    "Metric/imperial units format": [
      "Yes"
    ],
    "New lap auto start\n\nAutomatically triggers a new lap after reaching a specified difference.": [
      "Yes"
    ],
    "Pace alarm\n\nAn alarm that notifies you if you vary from a pre-set pace.": [
      "Yes"
    ],
    "Pause timer\n\nPauses the timer when slowing or stopping, and automatically resumes when moving again.": [
      "Yes"
    ],
    "Power meter\n\nDisplays output in watts as you ride.": [
      "Sold separately"
    ],
    "Programmable workouts\n\nWant an easy jog? A fast-paced ride? A workout with lots of variety to keep you on your toes? With programmable workouts you can tailor your training to match whatever you are looking for on a particular day.": [
      "Advanced"
    ],
    "Replaceable wrist strap": [
      "Yes"
    ],
    "Routes": [
      "30"
    ],
    "Snooze": [
      "No"
    ],
    "Speed/cadence sensor\n\nMonitors pedalling cadence and measures pedalling strokes per minute.": [
      "Sold separately"
    ],
    "Stopwatch": [
      "Yes"
    ],
    "Tide tables": [
      "No"
    ],
    "Touch screen": [
      "No"
    ],
    "Track log": [
      "200 hours"
    ],
    "Unit to unit transfer\n\nShares data wirelessly between compatible units.": [
      "No"
    ],
    "Virtual partner\n\nAllows user to monitor training goals with either a virtual partner or alarms.": [
      "Yes"
    ],
    "Waypoints\n\nWaypoints consist of a standard set of coordinates (two for land, three for air or space) that identify a specific physical location. A route is navigated between two or more waypoints.": [
      "1000"
    ],
    "Weight": [
      "98g"
    ],
    "WiFi": [
      "Yes"
    ],
    "Wireless sync": [
      "Yes"
    ],
    "Workout history": [
      "Yes"
    ],
    "Wrist strap material": [
      "Silicone"
    ]
  }
}