{
  "categories": [
    "Home",
    "All",
    "Camping and hiking",
    "Hiking footwear",
    "Hiking boots",
    "Kailash Plus Gore-Tex Backpacking Boots"
  ],
  "description": "Durable, supportive boots with a waterproof-breathable lining – in case the day includes rain or the trail turns into a creek bed. The all-new Kailash Plus strikes a balance between lightweight construction to suit fast-packing and thru-hiking and ruggedness to stand up to miles of rough terrain. To-the-toe lacing offers a stable, precise fit. A low-density polyurethane insole offers excellent shock absorption, and the Biometric Trek sole keeps you from skidding or slipping on scree or loose gravel.Uppers are Nubuck leather for long lasting durability and support.GORE-TEX® Performance Comfort membrane is waterproof and breathable.Toe rand protects your feet and your footwear.Flex point on upper allows for natural angle variation and reduces pressure points.Midsoles are lightweight polyurethane with EVA heel inserts for shock absorption.Outsoles Vibram® Biometric Trek with ACTIV Impact technology for cushy rebound.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8942403125278/5057414-COF01.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8942403125278/5057414-COF01.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8942403125278/5057414-COF01.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8942403125278/5057414-COF01.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Scarpa Kailash Plus Gore-Tex Backpacking Boots - Men's",
  "product_code": "5057-414",
  "source_url": "https://www.mec.ca/en/product/5057-414/Kailash-Plus-Gore-Tex-Backpacking-Boots",
  "tech_specs": {
    "Closure": [
      "Lace-up"
    ],
    "Ideal for": [
      "Day hiking",
      "Backpacking"
    ],
    "Made in": [
      "Italy"
    ],
    "Rand\n\nRubber on the toe and around the boot improves durability. It can also increase grip while scrambling.": [
      "Toecap"
    ],
    "Removable insole": [
      "Yes"
    ],
    "Upper material": [
      "Nubuck leather"
    ],
    "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": [
      "Yes"
    ],
    "Weight": [
      "1.25kg (42)"
    ]
  }
}