{
  "categories": [
    "Home",
    "All",
    "Camping and hiking",
    "Hiking footwear",
    "Hiking boots",
    "Kailash Trek Gore-Tex Hiking Boots"
  ],
  "description": "A little less stiff than traditional hiking boots, the reliable Kailash Trek GTX have a waterproof-breathable liner to get you through the muddy sections. They strike a good balance between lightweight construction for day hiking, and toughness to stand up to rough terrain. To-the-toe lacing offers a stable, precise fit. A low-density polyurethane insole offers excellent shock absorption, and the Biometric Trek sole keeps you from skidding or slipping on scree or loose gravel.Uppers are suede panels with nylon fabric cuffs for lightweight durability.GORE-TEX® Performance Comfort membrane for waterproofness and breathability.Toe rand protects your feet and your footwear.Flex point on upper allows for natural angle variation and reduces pressure points.Midsoles are lightweight polyurethane with EVA heel inserts for shock absorption.Outsoles Vibram® Biometric Trek with ACTIV Impact technology for cushy rebound.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8942403158046/5057412-TTM24.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8942403158046/5057412-TTM24.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8942403158046/5057412-TTM24.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8942403158046/5057412-TTM24.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Scarpa Kailash Trek Gore-Tex Hiking Boots - Women's",
  "product_code": "5057-412",
  "source_url": "https://www.mec.ca/en/product/5057-412/Kailash-Trek-Gore-Tex-Hiking-Boots",
  "tech_specs": {
    "Closure": [
      "Lace-up"
    ],
    "Ideal for": [
      "Day hiking",
      "Backpacking"
    ],
    "Made in": [
      "Italy"
    ],
    "Rand\n\nRubber on the toe and around the boot improves durability. It can also increase grip while scrambling.": [
      "Toecap"
    ],
    "Removable insole": [
      "Yes"
    ],
    "Upper material": [
      "Suede",
      "Nylon"
    ],
    "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": [
      "Yes"
    ],
    "Weight": [
      "1.07kg (38)"
    ]
  }
}