{
  "categories": [
    "Home",
    "All",
    "Kids",
    "Youth (8-16 yrs)",
    "Youth clothing",
    "Youth jackets",
    "Youth parkas and winter coats",
    "Snowbelle Jacket"
  ],
  "description": "Keep up with your instructor in a waterproof yet pliable insulated jacket. The Snowbelle's supple waterproof-breathable fabric bends and turns with you down the run, keeping you dry thanks to taped seams and a DWR finish. The insulation is light, so you stay warm, not weighed down. On stormy days, the hood gusset seals out wind and snow; on mild ones, you can remove it and leave it in the car. And since you're growing, the jacket arms do too (up to 5cm longer).Waterproof-breathable construction with taped seams and DWR treatment.Herringbone polyester shell is soft and supple.Lightweight insulation is 92% recycled polyester.3-panel hood is removable, with an elasticized gusset for a secure fit.Tricot-lined collar is comfy against your chin.Handwarmer pockets with covered zip closure.Chest pocket with cord port for devices.Ski pass pocket on sleeve, and an internal pass loop for traditional hang passes.Articulated sleeves can be lengthened by 5cm to accommodate growing arms.Internal microfleece cuffs have thumbholes.Drop hem for extra coverage in back.Powder skirt snaps to inside of jacket when not in use.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9137039310878/5058582-COR03.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9137039310878/5058582-COR03.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Patagonia Snowbelle Jacket - Girls' - Youths",
  "product_code": "5058-582",
  "source_url": "https://www.mec.ca/en/product/5058-582/Snowbelle-Jacket",
  "tech_specs": {
    "Additional feature(s)": [
      "Powder skirt",
      "Wind flap behind zipper"
    ],
    "Construction": [
      "2-layer"
    ],
    "Durable water repellency\n\nUsually referred to as DWR. A treatment made to fabrics that causes water to bead and run off instead of soaking through.": [
      "Yes"
    ],
    "Face fabric": [
      "75-denier polyester"
    ],
    "Hood": [
      "Removable"
    ],
    "Ideal for": [
      "Downhill skiing",
      "Snowboarding"
    ],
    "Insulation": [
      "150g/sq. m polyester"
    ],
    "Lining/backer": [
      "Polyester"
    ],
    "Made in": [
      "Vietnam"
    ],
    "Pockets": [
      "2 handwarmer",
      "1 arm",
      "1 front zippered with cord port"
    ],
    "Technology": [
      "H2No",
      "Thermogreen"
    ],
    "Type": [
      "Waterproof-breathable",
      "Insulated synthetic"
    ],
    "Waterproofness\n\nWaterproof garments use waterproof-breathable technologies and are fully seam-taped. Water-resistant garments use waterproof-breathable technologies but their seams are not taped. Water-resistant garments repel water and protect against wind but are not made of waterproof fabric.": [
      "Waterproof with fully taped seams"
    ],
    "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": [
      "Windproof"
    ]
  }
}