{
  "categories": [
    "Home",
    "All",
    "Cycling",
    "Cycling clothing",
    "Cycling bottoms",
    "Cycling shorts",
    "Crinkum Plus Shorts"
  ],
  "description": "Nothing about these shorts will hold you back. Go on epic bikepacking trips and head into town without looking out of place. The stretch fabric lets you move freely and a low-profile chamois is comfortable on long rides.Stretch woven, quick dry fabric is nylon and spandex.DWR treated fabric keeps you drier, longer.Elasticated waist with two tension tabs let you tune the fit.Double-needle stitching makes for highly durable shorts.Built-in chamois liner has an antimicrobial treatment to reduce stink.High quality chamois is made in the mecca of cycling clothing, Italy.One zippered front pocket is ideal to keep your phone secured.Back pockets have hook-and-loop closure and one snap to secure your goods.Reflective hits on back pocket keeps you visible in low-light conditions.\n\nRegular fit, Regular rise\n\n\n\nFit guide\n\nGarments, designed for specific activities have features that aren’t always adaptable to general use. For example, cycling clothing is longer in the back and arms. Activity aside, the fit of MEC clothing falls into these categories:\n\n\n\n\n\nOur next to skin fit that contours the body for no distractions\n\n\n\n\n\nOur close to body fit with a low profile silhouette for ease of movement\n\n\n\n\n\nOur standard, slightly off body fit for unrestricted comfort\n\n\n\n\n\nOur roomy, off body fit for maximum comfort and easy layering\n\n\nAll MEC men’s and boy’s pants are regular rise.\n\n\n\n\n        Sustainability\n\n\n\n\n\n\n\n\nBluesign\n\n\n\n\n\n\n\n\n\n\n\n                      Bluesign® Approved Material",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9019585429534/5058343-BK000.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9019585429534/5058343-BK000.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "MEC Crinkum Plus Shorts - Men's",
  "product_code": "5058-343",
  "source_url": "https://www.mec.ca/en/product/5058-343/Crinkum-Plus-Shorts",
  "tech_specs": {
    "Additional feature(s)": [
      "Gusseted crotch",
      "Antimicrobial treatment"
    ],
    "Chamois": [
      "Yes"
    ],
    "Fabric content": [
      "95% nylon",
      "5% spandex"
    ],
    "Finished inseam\n\nThe finished inseam measurement of the garment.": [
      "11in. (M)"
    ],
    "Gripper elastic\n\nGripper elastics prevent the cycling shorts from riding up and leg and arm warmers from sliding down.": [
      "Yes"
    ],
    "Ideal for": [
      "Mountain biking",
      "Urban cycling"
    ],
    "Made in": [
      "China"
    ],
    "Pockets": [
      "2 front slash",
      "1 front zippered",
      "1 back with flap"
    ],
    "Product sustainability": [
      "Bluesign® Approved Material"
    ],
    "Secondary fabric": [
      "85% polyester",
      "15% Lycra Spandex"
    ]
  }
}