{
  "categories": [
    "Home",
    "All",
    "Clothing",
    "Clothing accessories",
    "Sunglasses",
    "Sport sunglasses",
    "Dimension Sunglasses"
  ],
  "description": "Look race-ready at stoplights. With sleek one-piece lenses and an aggressive wrap, the Dimension Sunglasses are built for speed.Scratch-resistant polycarbonate lenses.Flexible, light and strong TR90 temples.8-base curvature helps protect you from light coming in at angles and blocks wind when the pace picks up.Rubber temple tips and nose pads offer a comfortable fit that doesn’t shift around when you drop the hammer.2 styles are treated with a military grade anti-fog material to keep you fog-free. Anti-fog lenses perform at their best when clean. Simply wash the lenses with water and they’ll keep your vision clear. When not in use, anti-fog lenses are happiest stored in a warm, dry environment",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9041168433182/5058447-GRL00.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9041168433182/5058447-GRL00.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "MEC Dimension Sunglasses - Unisex",
  "product_code": "5058-447",
  "source_url": "https://www.mec.ca/en/product/5058-447/Dimension-Sunglasses",
  "tech_specs": {
    "100% UVA protected": [
      "Yes"
    ],
    "100% UVB protected": [
      "Yes"
    ],
    "Frame material\n\nTR90 thermoplastic offers good resistance to chemicals and torsion. Propionate is a light, nylon-based, hypoallergenic plastic that's very strong and offers more transparency and gloss than other plastics.": [
      "TR90 thermoplastic"
    ],
    "Ideal for": [
      "Road cycling",
      "Running"
    ],
    "Interchangeable lenses\n\nInterchangeable lenses let you change lenses to suit differing light conditions or activities.": [
      "No"
    ],
    "Lens height\n\nMeasures the height of the lens within the frame, excluding the lens curve.": [
      "45mm"
    ],
    "Lens material": [
      "Polycarbonate"
    ],
    "Lens performance\n\nFixed tints provide a constant degree of darkness. Photochromic lenses adjust to changing light levels. Polarized lenses absorb horizontal reflected glare to improve clarity around surfaces like snow or water.": [
      "Fixed tint"
    ],
    "Lens width\n\nRefers to the horizontal width in millimeters of one of the frame's lenses.": [
      "140mm"
    ],
    "Made in": [
      "China"
    ],
    "Temple length\n\nThe length of an arm from tip to tip.": [
      "122mm"
    ],
    "Visible Light Transmission\n\n0-10% – very heavy tint, too dark for most needs. \n10-30% – heavy tint for bright sunny days.\n20-60% – light tint, great for cloudy, overcast conditions and shady trails. \n60-80% – very light tint (often coloured), for improving contrast in low-light conditions, think dawn or dusk. \n80-100% – little to no tint, this what you want in the dark.": [
      "27%"
    ]
  }
}