{
  "categories": [
    "Home",
    "All",
    "Watersports",
    "PFDs, helmets and safety equipment",
    "Boat safety equipment",
    "Sea-Light Suction Cup Mount"
  ],
  "description": "The waterproof Sea-Light mounts securely to flatter kayak decks or solid canoe seats. Its suction-cupped sleeve makes it easy to remove during the day, or to transfer it to other boats. The dome at the top beams light in a 360-degree ring when the unit is vertical, making nighttime paddlers visible to other boats from all directions. If you mount the Sea-Light behind you to avoid compromising your night vision, use a headlamp or other forward-facing light to fill in the gap where the Sea-Light is masked by your body.Waterproof light tested for 24hrs at 1m (3.3 ft.).Domed lens provides a half-sphere of light, offering enhanced visibility over previous models.Operational Life of more than 30 hours at 30°C (more than 20 hours at -1°C).Moisture sensor activates the light automatically when wet (this can be overridden). There is also twist on/off for manual operation.20 lumen LED requires 2 AA batteries (not included).Safety leash secures the light to a PFD.USCG/SOLAS, CE and Transport Canada certified.C-Light™ can be removed for use on life jackets, packs, etc.Suction cup offers great non-permanent deck lighting solution.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8934086541342/5058432-NOC02.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8934086541342/5058432-NOC02.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Scotty Sea-Light Suction Cup Mount",
  "product_code": "5058-432",
  "source_url": "https://www.mec.ca/en/product/5058-432/Sea-Light-Suction-Cup-Mount",
  "tech_specs": {
    "Batteries": [
      "2 AA (not included)"
    ],
    "Body material": [
      "Plastic"
    ],
    "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": [
      "IP X8"
    ],
    "Ideal for": [
      "Kayaking",
      "Canoeing",
      "Paddleboarding"
    ],
    "Light modes\n\nThe number of lighting levels/modes the light has (i.e., low, med, high, flash).": [
      "1 mode"
    ],
    "Made in": [
      "Canada"
    ],
    "Rechargeability\n\nRechargeable lights give you hassle-free recharging with almost any power source. Replaceable batteries provide instant power, but you’ll need to bring extra batteries, recycle used ones and buy new ones.": [
      "Non-rechargeable"
    ],
    "Red light mode": [
      "No"
    ],
    "Regulated output\n\nOn regulated lights brightness is consistent, and does not decrease gradually as the batteries are drained.": [
      "No"
    ]
  }
}