{
  "categories": [
    "Home",
    "All",
    "Watersports",
    "Marine navigation",
    "Compasses",
    "Compass 16DCL-6400 MILS/360 Degrees"
  ],
  "description": "The military version of the Expedition S Compass, it uses mils instead of degrees and has a coyote brown bezel over a glowing mils dial. Use it to keep your adventures on track. With a sighting mirror and clinometer you can chart your course and gauge slope angles and make height estimates.Trusted by NATO forces around the world.0-6,400 mils glowing dial with large numerals at every 200 mil mark is easy to read in challenging conditions.Sighting mirror for plotting routes, can be used in emergencies for signalling.1:25:000 and 1:50:000 scales, GPS scales, centimeter/millimetre/inch rules.Scale lanyard (1:25k and 1:50K) takes guessing out of plotting, and as a break-away lanyard it is safe and convenient.Clinometer for measuring slope angle and making distance and height estimations.Slope card helps you gauge difficulty of ascents, and assess avalanche risk.Coyote brown DryFlex™ rubberized mirror housing and bezel is easy to use with or without gloves.Magnetically adjustable declination.Declination scale.Clear baseplate with magnification lens for easy mapping and plotting.Silicone feet keep the compass from shifting.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9026785345566/5058472-NOC02.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9026785345566/5058472-NOC02.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Silva Compass 16DCL-6400 MILS/360 Degrees",
  "product_code": "5058-472",
  "source_url": "https://www.mec.ca/en/product/5058-472/Compass-16DCL-6400-MILS-360-Degrees",
  "tech_specs": {
    "Adjustable declination\n\nSets the compass to indicate true north instead of magnetic north.": [
      "Yes"
    ],
    "Clinometer\n\nMeasures angles of slope, elevation or inclination.": [
      "Yes"
    ],
    "Hemisphere\n\nThe earth's magnetic field varies considerably so most compasses are designed to work in the specific hemisphere zones for which they are being used. A global compass can be used anywhere.": [
      "Northern Hemisphere"
    ],
    "Ideal for": [
      "Professional trades",
      "Backpacking",
      "Emergency preparedness"
    ],
    "Luminous markings\n\nLuminous markings allow you to read your compass in dim light conditions.": [
      "Yes"
    ],
    "Made in": [
      "China"
    ],
    "Magnifying lens": [
      "Yes"
    ],
    "Sighting mirror": [
      "Yes"
    ],
    "Weight": [
      "86g"
    ]
  }
}