{
  "categories": [
    "Home",
    "All",
    "Camping and hiking",
    "Electronics",
    "GPS Navigation",
    "Handheld GPS",
    "Rino 755t Two Way Radio"
  ],
  "description": "With communication, navigation and a camera, the Rino 755t is like a smartphone for your off-grid adventures. Preloaded with 100K resolution TOPO maps for Canada, it simplifies backcountry navigation and trip planning. The 8-megapixel camera means you can take pictures of your adventure without needing to carry another device. Each picture you take is automatically geotagged with location data via the quad-helix antenna’s excellent GPS reception. Free BaseCamp software lets you map out your adventures and pins your photos on the map. The integrated FRS/GMRS radio lets you stay in contact with other Rino units in your party, so you can communicate via talk or text without needing cell reception. Share your location with other Rino users to take the guesswork out of meeting up in the backcountry. Before heading to the trailhead, pair your device with a smartphone running the free Garmin Connect app to unlock even more potential, including real-time weather tracking, satellite terrain imagery, trip planning, fitness modes, and much more.2 Watt FRS/GMRS 2-way radio lets you communicate by voice or unit-to-unit texting regardless of cellular signal (range: 3.2km FRS and 32km GMRS).NOAA and S.A.M.E. technology (Specific Area Message Encoding) prevent you from missing a weather alert. Alerts are only active when the weather radio is on, and you are on an active radio channel.Active weather provides real-time radar tracking (via a connected smartphone running Garmin Connect), which allows you to stay one step ahead of bad weather.8-megapixel camera with a 4x digital zoom lets you record your adventures with geotagged images.Find your friends by sending other Rino users your exact location and viewing theirs on your map screen.Free Garmin Connect mobile app allows you to customize your Rino experience, choosing which widgets to show and when, reviewing stored activity data, selecting which apps can push notifications, and more.Connect IQ support allows you to download apps, templates, data fields and other features.Free BaseCamp navigation software lets you view and organize maps, waypoints, routes and tracks. BaseCamp will even place your geotagged photos on the correct map locations.BaseStation combines the power of BaseCamp with that of your laptop, acting as a full command centre that's capable of tracking multiple Rinos. View real-time GPS information on the larger display of your computer while the Rino serves as an antenna, meaning you're not dependant on internet or cell service.Compatible with Garmin Custom Maps, a free service that allows you to transform paper and electronic maps easily into downloadable maps for your device.Bluetooth Smart and ANT+ compatibility allow syncs with compatible activity sensors and accessories.Send smartphone notifications straight to your Rino via the Bluetooth connection to your paired smartphone.Compatible with all smartphones featuring Bluetooth 4.0 (iPhone 4S or higher, and Android 4.3 or higher).Auto-rotating screen lets you mount your Rino horizontally or vertically.Integrated quad-helix antenna for enhanced signal reception from GPS and GLONASS satellites.Barometric altimeter helps you track your ascents, descents and total elevation changes.Tilt compensated 3-axis electronic compass shows your heading even when you are stationary, ensuring that you're always facing the right direction.IPX7 waterproofing protects your Rino from even the heaviest downpours.LED flash can double as a flashlight, should you get caught in the dark.Rechargeable lithium-ion battery lasts up to 14 hours with all modes active.Extend your power supply options with the AA battery pack option (sold separately), which accepts one of the most globally available batteries.Free 1-year subscription to BirdsEye Satellite Imagery allows users to download satellite images.In the box: Rino 755t preloaded with 100K TOPO Canada maps, 1-year BirdsEye satellite imagery subscription, lithium-ion battery pack, USB cable, AC charger, carabiner clip, documentation.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8935043596318/5058327-BK000.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8935498055710/5058327-BK000-ALT-BACK.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8935043596318/5058327-BK000.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8935498055710/5058327-BK000-ALT-BACK.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8935043596318/5058327-BK000.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8935498055710/5058327-BK000-ALT-BACK.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8935043596318/5058327-BK000.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8935498055710/5058327-BK000-ALT-BACK.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Garmin Rino 755t Two Way Radio",
  "product_code": "5058-327",
  "source_url": "https://www.mec.ca/en/product/5058-327/Rino-755t-Two-Way-Radio",
  "tech_specs": {
    "ANT+ compatible\n\nEnsures seamless digital wireless communication between ANT+ devices. For example, data from an ultra-low power wireless sensor can be displayed on a bike computer or smartphone, then downloaded to a PC, etc.": [
      "Yes"
    ],
    "Add maps capability\n\nThese units allow you to add maps, so you can mark and name waypoints and create routes on your PC, and then upload the map of your choice to your GPS.": [
      "Yes"
    ],
    "App compatibility\n\nAn online community where members upload, analyze and share activity data.": [
      "Garmin Connect",
      "BaseCamp",
      "Third party apps"
    ],
    "Area calculation": [
      "Yes"
    ],
    "Auto pause\n\nAutomatically pauses timer when you stop or go below a specified pace.": [
      "No"
    ],
    "Barometric altimeter\n\nBarometer function helps forecast weather trends. An altimeter can provide one line of position for location on a topo map, useful if the GPS isn't working.": [
      "Yes"
    ],
    "Basemap\n\nA basic set of map data that is included with the GPS. Basemap detail may vary from unit to unit.": [
      "Yes"
    ],
    "Batteries": [
      "Lithium-ion (included)"
    ],
    "Battery life": [
      "14 h"
    ],
    "Battery power indicator": [
      "Yes"
    ],
    "Bluetooth": [
      "Yes"
    ],
    "Built-in memory": [
      "4.5GB"
    ],
    "Button lock": [
      "Yes"
    ],
    "Calorie consumption\n\nCalculated based on data from a heart rate monitor.": [
      "No"
    ],
    "Calories in real time\n\nDisplays calorie expenditure during activity, based on heart rate monitor data.": [
      "No"
    ],
    "Chest strap": [
      "Sold separately"
    ],
    "Coded signal\n\nA coded instrument ensures no interference between your chest strap and your watch, necessary if you are training in busy gyms or trails where other signals may be encountered.": [
      "Yes"
    ],
    "Countdown timer": [
      "Yes"
    ],
    "Custom POI\n\nA POI (point of interest) is a specific location that someone may find interesting (i.e., favourite viewpoint, best coffee stop before the trailhead). The custom POI feature allows the user to load only the POI's that interest them onto their GPS unit.": [
      "Yes"
    ],
    "Data card": [
      "microSD card (not included)"
    ],
    "Dimensions": [
      "20.1 x 6.6 x 4.1cm"
    ],
    "Display dimensions": [
      "6.4 x 3.8cm"
    ],
    "Distance/time alarm": [
      "Yes"
    ],
    "Electronic compass\n\nAn electronic compass allows the user to view their heading in situations where they are either standing still or moving too slowly for the GPS to detect.": [
      "Yes"
    ],
    "Floats": [
      "No"
    ],
    "Foot pod\n\nAttaches to your shoe, captures your running data (i.e., pace, distance), and transmits it to your heart rate monitor or GPS.": [
      "Sold separately"
    ],
    "Haptic feedback": [
      "No"
    ],
    "Heart rate in real time\n\nDisplays beats per minute during activity.": [
      "No"
    ],
    "Heart rate monitor": [
      "Sold separately"
    ],
    "Heart rate target zones\n\nDisplays heart rate zones during activity.": [
      "No"
    ],
    "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": [
      "IP X7"
    ],
    "Ideal for": [
      "Backpacking",
      "Camping and hiking",
      "Winter and expedition camping",
      "Backcountry skiing"
    ],
    "Interface": [
      "USB",
      "Wireless"
    ],
    "Interval training": [
      "No"
    ],
    "Low battery warning": [
      "Yes"
    ],
    "Made in": [
      "Taiwan"
    ],
    "Metric/imperial units format": [
      "Yes"
    ],
    "New lap auto start\n\nAutomatically triggers a new lap after reaching a specified difference.": [
      "Yes"
    ],
    "Pace alarm\n\nAn alarm that notifies you if you vary from a pre-set pace.": [
      "No"
    ],
    "Pause timer\n\nPauses the timer when slowing or stopping, and automatically resumes when moving again.": [
      "Yes"
    ],
    "Power meter\n\nDisplays output in watts as you ride.": [
      "Not compatible"
    ],
    "Programmable workouts\n\nWant an easy jog? A fast-paced ride? A workout with lots of variety to keep you on your toes? With programmable workouts you can tailor your training to match whatever you are looking for on a particular day.": [
      "No"
    ],
    "Routes": [
      "250"
    ],
    "Speed/cadence sensor\n\nMonitors pedalling cadence and measures pedalling strokes per minute.": [
      "Sold separately"
    ],
    "Stopwatch": [
      "Yes"
    ],
    "Tide tables": [
      "No"
    ],
    "Touch screen": [
      "Yes"
    ],
    "Track log": [
      "20,000 points, 200 saved tracks"
    ],
    "Unit to unit transfer\n\nShares data wirelessly between compatible units.": [
      "No"
    ],
    "Virtual partner\n\nAllows user to monitor training goals with either a virtual partner or alarms.": [
      "No"
    ],
    "Waypoints\n\nWaypoints consist of a standard set of coordinates (two for land, three for air or space) that identify a specific physical location. A route is navigated between two or more waypoints.": [
      "10000"
    ],
    "Weight": [
      "348g"
    ],
    "WiFi": [
      "No"
    ],
    "Wireless sync": [
      "No"
    ],
    "Workout history": [
      "No"
    ]
  }
}