{
  "categories": [
    "Home",
    "All",
    "Climbing",
    "Mountaineering and ice climbing",
    "Crampons and components",
    "Crampons",
    "Alpinist Auto/Semi-Auto Crampons"
  ],
  "description": "Precise feeling 12-point crampons designed for technical alpine terrain. The front points and secondary snow points add stability and traction on hard snow and alpine ice. The rigid chromoly steel absorbs energy, making them less prone to stress cracks and durable for kicking into hard ice and snow. The design gives them few connecting joints to reduce their overall flex, and the unique heel slide with micro-adjustable linking bar reduces torsional rigidity, so they offer a solid reliable platform when front pointing.Front points and snow points are optimized for stability and traction in hard snow and alpine ice.Chromoly steel provides energy absorption to handle the abuse of ice climbing.Asymmetric design follows the contours of modern boots for a precise fit.Micro-adjustable linking bar allows fine-tuning the length.Automatic and semi-auto toe bail options included for customisation.Comes with dynamic anti-balling plates and crampon case.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8926317838366/5058005-BK000.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8926317838366/5058005-BK000.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Cassin Alpinist Auto/Semi-Auto Crampons",
  "product_code": "5058-005",
  "source_url": "https://www.mec.ca/en/product/5058-005/Alpinist-Auto-Semi-Auto-Crampons",
  "tech_specs": {
    "Antibott included\n\nAnti-snow plates keep snow from balling underfoot.": [
      "Yes"
    ],
    "Attachment system": [
      "Step-in",
      "Hybrid"
    ],
    "Boot sizes\n\nThe manufacturers' recommended boot size. Some crampons can be extended by changing the centre rail.": [
      "36-48"
    ],
    "Front points": [
      "Fixed"
    ],
    "Ideal for": [
      "Alpine climbing and mountaineering"
    ],
    "Made in": [
      "Italy"
    ],
    "Material": [
      "Chromoly steel"
    ],
    "Weight": [
      "970g"
    ]
  }
}