{
  "categories": [
    "Home",
    "All",
    "Cycling",
    "Bike helmets and body armour",
    "Bike helmets",
    "Session MIPS Helmet"
  ],
  "description": "More protection for your irreplaceable brain. Charge hard, knowing the Session MIPS helmet has you covered. If you crash, MIPS technology will reduce the rotational force to your head, helping prevent brain injury more effectively than your average road helmet. Koroyd technology adds extra protection in strategic, zonal impact areas so you can focus on pushing your pace. 15-point ventilation keeps you cool when you're working hard, and other impressive features include a rotary dial adjustment, removable visor, ventilation to prevent glasses fog, and cooling liner pads to wick sweat.MIPS technology reduces rotational forces to the head in the event of a fall, lessening the potential damage to the brain.Zonal Koroyd panels provide consistent energy absorption to disperse impacts in the case of an accident.VaporFit rotary dial adjustment system lets you fine-tune the fit.AirEvac ventilation system pulls warm air from in front of your face to reduce fog build-up on glasses.15 vents provide breathability to keep your head cool.X-Static liner pads with reactive cooling treatment help to pull sweat away from your head.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8947374915614/5058506-MAT00.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8947374915614/5058506-MAT00.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Smith Session MIPS Helmet - Unisex",
  "product_code": "5058-506",
  "source_url": "https://www.mec.ca/en/product/5058-506/Session-MIPS-Helmet",
  "tech_specs": {
    "Approved for\n\nMost helmets are tested and certified for a specific sport. Some helmets are approved for multi-sports, but only after passing the safety tests for both sports (i.e., snowsports and cycling).": [
      "Cycling"
    ],
    "Circumference\n\nThe internal circumference determines the size head that the helmet will fit.": [
      "51-55cm (Small)",
      "55-59cm (Medium)",
      "59-62cm (Large)"
    ],
    "Construction\n\nMicroshell helmets are made of a thin polymer sheet over a foam liner; Hardshell helmets have a hard polymer outer shell and a foam liner; when the liner is being bonded to the outer shell during the manufacturing process, it is Molded in the shell.": [
      "Molded in the shell"
    ],
    "Fit system": [
      "Adjustable dial"
    ],
    "Ideal for": [
      "Mountain biking"
    ],
    "Inner material": [
      "EPS (expanded polystyrene)",
      "Co-polymer"
    ],
    "Made in": [
      "China"
    ],
    "Safety rating\n\nCetification is established by a variety of governing bodies who set impact standards. Most helmets are certified or approved for a specific sport, except in the case of multi-sport helmets (i.e., a snowsports helmet might also be approved for cycling if it meets the cycling safety standards).": [
      "CPSC",
      "EN 1078"
    ],
    "Shell material": [
      "Polycarbonate"
    ],
    "Vents": [
      "Yes"
    ],
    "Weight": [
      "340g (Medium)"
    ]
  }
}