{
  "categories": [
    "Home",
    "All",
    "Camping and hiking",
    "Electronics",
    "GPS Navigation",
    "GPS watches",
    "Descent Mk1 Titanium"
  ],
  "description": "A dive computer, GPS, activity tracker, smartwatch all in one. No matter how you dive – single gas, mixed gas or free – you'll get important info for underwater exploring: dive time, ascent and descent rates, no-deco time, decompression stop information, heart-rate data, heading information and gas data. The EXO antenna connects to both standard GPS satellites and GLONASS satellites for fast and accurate GPS signals wherever you are. Wireless data syncing to Garmin Connect lets you share dives or land-based activities. With detailed dive analysis, day-to-day activity tracking, smart notifications, multi-sport functions, turn-by-turn mapping and round-trip mapping, the Descent Mk1 Titanium is useful above the waves and below.Dive modes support: single gas, multi-gas (blends and up to 6 gases), gauge, apnea, apnea hunt (silent) and plan dive.Customizable alerts (audible and haptic) for time, depth, ascent rate, descent rate and more (available alerts vary with type of dive).3 dive-specific data pages provide core information (dive time, depth, water temperature, compass heading, heart rate, gas mix). Note: for safety reasons, it's not possible to change settings and alter modes while diving.Dive activities start when depth gauge reaches 1.2m.100-metre waterproofing (EN 13319 standard).Access the 3-axis compass by double-tapping the screen.Large internal memory and fast processor handle turn-by-turn and round-trip mapping.Round-trip mapping lets you choose the distance you want to go. Installed maps plot course options that bring you back to where you started.Virtually scratchproof domed sapphire crystal face and titanium bezel.Titanium bracelet has a wear-resistant diamond-like carbon (DLC) coating to add extra durability and corrosion protection.Wi-Fi-enabled for activity uploads to Garmin Connect™ to share dive logs and activities.Garmin low-profile Elevate™ optical heart-rate monitor lets you train without a chest strap, and works underwater.Optical heart-rate sensors measure changes in blood volume under the skin, and work best when worn snugly, 1 to 3 finger-widths above your wrist bone.Strava Segment integration lets you know when your starred segment is about to begin, shows instantaneous data of your performance in the moment as well as how it compares to your PR and the current KOM or QOM, and then provides results once the segment is complete.GroupTrack displays the location and telemetry of your contacts using compatible Garmin devices (only works on land).Multisport mode allows for easy transitions between activities within a single workout.Create custom profiles for cycling, running, swimming, etc.Internal accelerometer and gyroscope track speed and distance when you're stationary, like while running on a treadmill.Physiological metrics include VO2 max, lactate threshold (requires a heart-rate chest strap, sold separately), race predictor, recovery advisor and performance indicator.Navigates routes created on Garmin Connect, backtracks your outbound route, or leads you directly to saved waypoints.UltraTrac™ mode reduces GPS recording rate to conserve battery.Integrated Garmin EXO™ antenna for outstanding signal reception from GPS and GLONASS satellites (GPS will not work underwater, but it will note the location you start and finish your dive).Full altimeter, barometer and compass functionality.Daily activity records steps, sleep patterns and everyday essentials.Smart notifications (emails, texts, alerts and more) via Bluetooth connection to a compatible smartphone.Connect IQ support allows you to download apps, templates, data fields, watch faces and other features. Note: for safety reasons, third-party apps will not work while diving.Automatically syncs activity data to paired smartphones running the free Garmin Connect app.Bluetooth Smart and ANT+ compatibility allows both to be used simultaneously, and syncs with compatible activity sensors.New QuickFit™ strap interface allows for easy strap swaps, in case you need to add the strap extension, want to give your watch a new look, or notice it's time for a thorough clean.Connects to Garmin devices including Virb action cameras, Vector power meters, the Varia radar line and more.In the box: Descent Mk1 with titanium bracelet, black silicone strap, strap extension for use over wetsuits or drysuits, charging/data cable, documentation.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8953816875038/5059933-GRT08.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8953815334942/5059933-GRT08-ALT-MENU.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8953815957534/5059933-GRT08-ALT-GPS.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8953816580126/5059933-GRT08-ALT-FAUXANALOGUE.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8953816875038/5059933-GRT08.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8953815334942/5059933-GRT08-ALT-MENU.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8953815957534/5059933-GRT08-ALT-GPS.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8953816580126/5059933-GRT08-ALT-FAUXANALOGUE.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8953816875038/5059933-GRT08.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8953815334942/5059933-GRT08-ALT-MENU.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8953815957534/5059933-GRT08-ALT-GPS.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8953816580126/5059933-GRT08-ALT-FAUXANALOGUE.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8953816875038/5059933-GRT08.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8953815334942/5059933-GRT08-ALT-MENU.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8953815957534/5059933-GRT08-ALT-GPS.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8953816580126/5059933-GRT08-ALT-FAUXANALOGUE.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Garmin Descent Mk1 Titanium - Unisex",
  "product_code": "5059-933",
  "source_url": "https://www.mec.ca/en/product/5059-933/Descent-Mk1-Titanium",
  "tech_specs": {
    "12/24 hour format": [
      "Yes"
    ],
    "ANT+ compatible\n\nEnsures seamless digital wireless communication between ANT+ devices. For example, data from an ultra-low power wireless sensor can be displayed on a bike computer or smartphone, then downloaded to a PC, etc.": [
      "Yes"
    ],
    "Add maps capability\n\nThese units allow you to add maps, so you can mark and name waypoints and create routes on your PC, and then upload the map of your choice to your GPS.": [
      "Yes"
    ],
    "App compatibility\n\nAn online community where members upload, analyze and share activity data.": [
      "Garmin Connect",
      "Third party apps"
    ],
    "Auto pause\n\nAutomatically pauses timer when you stop or go below a specified pace.": [
      "Yes"
    ],
    "Barometric altimeter\n\nBarometer function helps forecast weather trends. An altimeter can provide one line of position for location on a topo map, useful if the GPS isn't working.": [
      "Yes"
    ],
    "Basemap\n\nA basic set of map data that is included with the GPS. Basemap detail may vary from unit to unit.": [
      "Yes"
    ],
    "Batteries": [
      "Lithium-ion (included)"
    ],
    "Battery life": [
      "20-360 h"
    ],
    "Battery power indicator": [
      "Yes"
    ],
    "Bluetooth": [
      "Yes"
    ],
    "Built-in memory": [
      "16GB"
    ],
    "Button lock": [
      "Yes"
    ],
    "Calorie consumption\n\nCalculated based on data from a heart rate monitor.": [
      "Yes"
    ],
    "Calories in real time\n\nDisplays calorie expenditure during activity, based on heart rate monitor data.": [
      "Yes"
    ],
    "Case diameter": [
      "51mm"
    ],
    "Chest strap": [
      "Sold separately"
    ],
    "Coded signal\n\nA coded instrument ensures no interference between your chest strap and your watch, necessary if you are training in busy gyms or trails where other signals may be encountered.": [
      "Yes"
    ],
    "Countdown timer": [
      "Yes"
    ],
    "Custom POI\n\nA POI (point of interest) is a specific location that someone may find interesting (i.e., favourite viewpoint, best coffee stop before the trailhead). The custom POI feature allows the user to load only the POI's that interest them onto their GPS unit.": [
      "Yes"
    ],
    "Data card": [
      "Not accepted"
    ],
    "Dimensions": [
      "5.1 x 5.1 x 1.8cm"
    ],
    "Distance/time alarm": [
      "Yes"
    ],
    "Electronic compass\n\nAn electronic compass allows the user to view their heading in situations where they are either standing still or moving too slowly for the GPS to detect.": [
      "Yes"
    ],
    "Face material\n\nPolycarbonate is inexpensive and light, with good clarity and wear-resistance. Mineral crystal glass offers greater clarity and significantly greater wear-resistance. Sapphire crystal is better still for clarity and wear-resistance.": [
      "Sapphire crystal"
    ],
    "Foot pod\n\nAttaches to your shoe, captures your running data (i.e., pace, distance), and transmits it to your heart rate monitor or GPS.": [
      "Sold separately"
    ],
    "Haptic feedback": [
      "Yes"
    ],
    "Heart rate in real time\n\nDisplays beats per minute during activity.": [
      "Yes"
    ],
    "Heart rate monitor": [
      "Yes"
    ],
    "Heart rate target zones\n\nDisplays heart rate zones during activity.": [
      "Yes"
    ],
    "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": [
      "IP X8"
    ],
    "Ideal for": [
      "Casual wear",
      "Running, fitness and training",
      "Camping and hiking",
      "Swim training",
      "Road cycling"
    ],
    "Interface": [
      "USB",
      "Wireless"
    ],
    "Interval training": [
      "Yes"
    ],
    "Low battery warning": [
      "Yes"
    ],
    "Lug width": [
      "26mm"
    ],
    "Made in": [
      "Taiwan"
    ],
    "Metric/imperial units format": [
      "Yes"
    ],
    "New lap auto start\n\nAutomatically triggers a new lap after reaching a specified difference.": [
      "Yes"
    ],
    "Pace alarm\n\nAn alarm that notifies you if you vary from a pre-set pace.": [
      "Yes"
    ],
    "Pause timer\n\nPauses the timer when slowing or stopping, and automatically resumes when moving again.": [
      "Yes"
    ],
    "Power meter\n\nDisplays output in watts as you ride.": [
      "Sold separately"
    ],
    "Programmable workouts\n\nWant an easy jog? A fast-paced ride? A workout with lots of variety to keep you on your toes? With programmable workouts you can tailor your training to match whatever you are looking for on a particular day.": [
      "Advanced"
    ],
    "Replaceable wrist strap": [
      "Yes"
    ],
    "Routes": [
      "30"
    ],
    "Snooze": [
      "No"
    ],
    "Speed/cadence sensor\n\nMonitors pedalling cadence and measures pedalling strokes per minute.": [
      "Sold separately"
    ],
    "Stopwatch": [
      "Yes"
    ],
    "Tide tables": [
      "No"
    ],
    "Touch screen": [
      "No"
    ],
    "Track log": [
      "200 hours"
    ],
    "Unit to unit transfer\n\nShares data wirelessly between compatible units.": [
      "No"
    ],
    "Virtual partner\n\nAllows user to monitor training goals with either a virtual partner or alarms.": [
      "Yes"
    ],
    "Waypoints\n\nWaypoints consist of a standard set of coordinates (two for land, three for air or space) that identify a specific physical location. A route is navigated between two or more waypoints.": [
      "1000"
    ],
    "Weight": [
      "145g"
    ],
    "WiFi": [
      "Yes"
    ],
    "Wireless sync": [
      "Yes"
    ],
    "Workout history": [
      "Yes"
    ],
    "Wrist strap material": [
      "Titanium"
    ]
  }
}