{
  "categories": [
    "Home",
    "All",
    "Footwear",
    "Socks",
    "Ski socks",
    "GFX Compression Hybrid DLX-Wool Ski Socks"
  ],
  "description": "A lightweight and low-profile padded ski sock for maximum comfort on long days. Made with merino blend yarns, the GFX Compression Hybrid DLX-Wool Ski Socks keep your feet warm and comfortable while maintaining their fit and shape. These socks combine the lightweight performance of the Ski Pro Fit series with the cushy padding of the Ski Genuflex series to hit the sweet spot between performance and comfort.Made of an engineered blend of merino wool, nylon and spandex for exceptional moisture management.Merino wool is naturally antimicrobial to help resist odours.Seamless toe and wicking yarns keep their shape wash after wash.Graduated compression for all-day performance, warmth and reduced muscle fatigue.Strategic low-profile padding in the toes, mid-sole, heel, ankle and shin provide warmth and big comfort on long days.Small fits Euro size 36-39; Medium fits 40-43; Large fits 44-47; XL fits 48 and up.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9029597560862/5060978-BK031.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9029597560862/5060978-BK031.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Dissent Labs GFX Compression Hybrid DLX-Wool Ski Socks - Unisex",
  "product_code": "5060-978",
  "source_url": "https://www.mec.ca/en/product/5060-978/GFX-Compression-Hybrid-DLX-Wool-Ski-Socks",
  "tech_specs": {
    "Additional feature(s)": [
      "Active compression",
      "Seamless toe"
    ],
    "Cuff height": [
      "Knee"
    ],
    "Cushioning\n\nLayers of cushioning, in some athletic socks, are knit in to reduce impact. Mapped socks are activity-specific and will offer cushioning in common pressure areas.": [
      "Mapped"
    ],
    "Fabric content": [
      "65% nylon",
      "25% Lycra Spandex",
      "10% merino wool"
    ],
    "Ideal for": [
      "Backcountry skiing",
      "Downhill skiing",
      "Snowboarding"
    ],
    "Made in": [
      "Taiwan"
    ],
    "Thickness": [
      "Thin"
    ]
  }
}