{
  "categories": [
    "Home",
    "All",
    "Cycling",
    "Bike components",
    "Tires, tubes, wheels and hubs",
    "Bike tires",
    "Wrathchild Studded TR Fatbike 26\"x4.6 Folding"
  ],
  "description": "From loose snow to icy freeze-thaw and everything in between, these aggressive tires turn challenging winter conditions into a real winter wonderland. The Wrathchild's deep center lugs and tall side lugs offer amazing traction, giving you fast acceleration and braking. Is the trail frozen solid? No problem. The 224 XL studs give you all the grip you'll need to ride as long as your heart desires.224 XL concave studs feature carbide tips for durability.Deep lugs provide accelerating, braking and cornering traction.Open tread pattern sheds snow.Tubeless ready.120 TPI tire casing stays flexible in the cold.Compatible with rim widths of 65 to 102mm.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8993841905694/5061318-BK000.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8993841905694/5061318-BK000.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "45NRTH Wrathchild Studded TR Fatbike 26 x 4.6 Folding Tire",
  "product_code": "5061-318",
  "source_url": "https://www.mec.ca/en/product/5061-318/Wrathchild-Studded-TR-Fatbike-26%22x4-6-Folding",
  "tech_specs": {
    "Bead\n\nThe bead holds the tire onto the rim. Beads may be hoops of wire, or made of a flexible material which allows them to be folded compactly. Folding tires are easier to store or pack on trips.": [
      "Folding"
    ],
    "ETRTO\n\nISO/ETRTO universal tire sizing system number for matching the correct tire to the rim.": [
      "110-559"
    ],
    "Ideal for": [
      "Mountain biking"
    ],
    "Made in": [
      "China"
    ],
    "TPI\n\nThreads per inch. Tires with a higher TPI tend to be more supple and lighter, with less rolling resistance, but are less durable.": [
      "120"
    ],
    "Tire size": [
      "26 X 4.6in."
    ],
    "Tire type": [
      "Clincher or Tubeless"
    ],
    "Wheel position": [
      "Rear",
      "Front"
    ]
  }
}