{
  "categories": [
    "Home",
    "All",
    "Camping and hiking",
    "Electronics",
    "Batteries",
    "Rechargeable batteries",
    "Eneloop Charger With 4 AA Rechargeable Batter"
  ],
  "description": "Better for the planet, better for your wallet, and better than you thought a rechargeable battery could be. Panasonic’s Eneloop line of rechargeable batteries are widely regarded as some of the best on the market. Gone are the days of reaching for your device, only to find the rechargeable batteries are dead: the Eneloops retain more than 70% of their capacity after 10 years. Paired with an efficient and compact charger, this 4-pack offers AA power for years to come.Efficiently recharge single or multiple AA or AAA batteries.Auto-shutoff turns off power once battery is full, or if it detects a damaged cell.LED power indicator lets you know when your batteries are ready.Able to be recharged up to 2,100 times.Retains more than 70% capacity after 10 years in storage. Most competitors discharge completely after 2 years.Pre-charged with solar energy and ready to use.Excellent cold-weather performance (0ºC), and will work in temperatures as low as -20ºC.Recharge whenever you like with no negative impact on the capacity.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8960577568798/5061248-NOC02.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8960577568798/5061248-NOC02.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Panasonic Eneloop Charger With 4AA Rechargeable Battery",
  "product_code": "5061-248",
  "source_url": "https://www.mec.ca/en/product/5061-248/Eneloop-Charger-With-4-AA-Rechargeable-Batter",
  "tech_specs": {
    "Battery power indicator": [
      "Yes"
    ],
    "Charges": [
      "AA",
      "AAA"
    ],
    "Charges single batteries": [
      "Yes"
    ],
    "Ideal for": [
      "Everyday use"
    ],
    "Made in": [
      "Japan"
    ],
    "Male plug type(s)\n\nTypes of outlet this device can be plugged into.": [
      "Type A"
    ],
    "Quick charge\n\nCharges batteries faster, at a higher power, but will reduce number of potential recharge cycles.": [
      "No"
    ]
  }
}