{
  "categories": [
    "Home",
    "All",
    "Camping and hiking",
    "Headlamps and lighting",
    "Lanterns",
    "Electric and LED lanterns",
    "ReMoji Lantern"
  ],
  "description": "Looking more like a river rock than a lantern, the ReMoji is a compact and easy-to-love little gadget. The rounded frosted globe spreads an even glow that's great for picnic tables, camp kitchens, adventure vans or anywhere you need light. USB charging means you can top up your lantern from almost anywhere with no need for batteries. With both a collapsible hook system and a magnetic back, the ReMoji has no shortages of mounting options.1 LED behind a frosted globe provides up to 100 lumens of even lighting, great for around camp or power outages at home.Smooth dimming feature lets you dial in the perfect brightness for both the lantern and the flashlight.Simple USB charging means you can top up your light nearly anywhere.LED charging indicator lets you know how your battery is doing.1-button interface is easy to use.Collapsible double hook for hanging in the tent or car.Magnetic back provides even more mounting options.IPX4 waterproofing means the light keeps shining even when Mother Nature has other ideas.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8976508026910/5061172-BK000.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8976508026910/5061172-BK000.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Black Diamond ReMoji Lantern",
  "product_code": "5061-172",
  "source_url": "https://www.mec.ca/en/product/5061-172/ReMoji-Lantern",
  "tech_specs": {
    "Batteries": [
      "Lithium-ion (included)"
    ],
    "Burn time": [
      "2 - 16 h"
    ],
    "Glass globe": [
      "No"
    ],
    "Ideal for": [
      "Backpacking",
      "Emergency preparedness"
    ],
    "Made in": [
      "China"
    ],
    "Max light output\n\nThe total quantity of light emitted in every direction from a source of light; measured in lumens.": [
      "100 lumens"
    ],
    "Product sustainability": [
      "Rechargeable batteries"
    ],
    "Rechargeability\n\nRechargeable lights give you hassle-free recharging with almost any power source. Replaceable batteries provide instant power, but you’ll need to bring extra batteries, recycle used ones and buy new ones.": [
      "Rechargeable"
    ],
    "Red light mode": [
      "No"
    ],
    "Regulated output\n\nOn regulated lights brightness is consistent, and does not decrease gradually as the batteries are drained.": [
      "No"
    ],
    "Uses mantels": [
      "No"
    ],
    "Weight": [
      "86g"
    ]
  }
}