{
  "categories": [
    "Home",
    "All",
    "Cycling",
    "Bike accessories",
    "Bike lights",
    "Rear bike lights",
    "Parkway Light Set"
  ],
  "description": "Stay visible on those low-light commutes. The Parkway Set bundles 2 compact and efficient LED bike lights, 1 front and 1 back. With this powerful duo, you're ready to roll from dusk til dawn.Headlight has 4 modes: high (5 hours at 110 lumens), medium (10 hours at 50 lumens), low (20 hours at 25 lumens) and flash (30 hours).Tail light has 3 modes a steady mode – 36 hours, slow flash – 88 hours and quick flash – 75 hours runtime.Both lights use easy to find AAA batteries.Both lights use a tool-free strap mount that's easy to connect to your bike.O-ring seal makes this light ready for heavy rain – it's waterproof, but not submersible.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8999553105950/5061910-BK000.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8999553105950/5061910-BK000.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "MEC Parkway Light Set",
  "product_code": "5061-910",
  "source_url": "https://www.mec.ca/en/product/5061-910/Parkway-Light-Set",
  "tech_specs": {
    "Batteries": [
      "5 AAA (3 front, 2 rear; included)"
    ],
    "Boost mode\n\nBriefly increases the light output to maximum brightness and distance.": [
      "No"
    ],
    "Flash mode": [
      "Yes"
    ],
    "Helmet attachment\n\nIncludes a bracket or mounting system that attaches to most bike helmets.": [
      "No"
    ],
    "Ideal for": [
      "Cycle commuting"
    ],
    "Included mounts": [
      "Handlebar mount",
      "Seat post mount"
    ],
    "Light source": [
      "LED"
    ],
    "Made in": [
      "China"
    ],
    "Max light output\n\nThe total quantity of light emitted in every direction from a source of light; measured in lumens.": [
      "110 lumens"
    ],
    "Rechargeability\n\nRechargeable lights give you hassle-free recharging with almost any power source. Replaceable batteries provide instant power, but you’ll need to bring extra batteries, recycle used ones and buy new ones.": [
      "Non-rechargeable"
    ],
    "Red light mode": [
      "Yes"
    ],
    "Regulated output\n\nOn regulated lights brightness is consistent, and does not decrease gradually as the batteries are drained.": [
      "No"
    ],
    "Type\n\nMost Canadian municipalities require a white front light and a red rear light.": [
      "Front",
      "Rear"
    ]
  }
}