{
  "categories": [
    "Home",
    "All",
    "Cycling",
    "Cycling footwear",
    "Cycling shoes",
    "Ragnarok Transition Shoes"
  ],
  "description": "Extend your riding season indefinitely with this performance-oriented shoe from 45NRTH, a dedicated cold-weather cycling apparel company. Purpose-built for riding fast in cold, wet conditions, the Ragnarok boasts a durable upper backed with a waterproof-breathable membrane that keeps you dry on the wettest days. An adjustable neoprene cuff provides added protection and unhindered ankle mobility, while the BOA® closure system lets you quickly dial in the fit. A stiffened midsole ensures efficient power transfer as you stomp the pedals and the winter-specific outsole contains micro-glass inserts designed to grip ice. The Ragnarok is built on a wide performance last, providing a stable platform whether you're ripping winter trails, training for cyclocross season or powering through your daily commute.Hardwearing synthetic leather upper is perforated for added breathability.Waterproof-breathable membrane construction.Neoprene ankle cuff offers protection against the elements without compromising mobility.BOA® closure system offers a refined fit and easy adjustment on the fly.Nylon composite midsole offers support, impact resistance and efficient power transfer.Protective toecap.Rubber outsole features micro-glass inserts for grip on icy surfaces.Built on a wide performance last for a comfortable, stable platform.Compatible with 2-bolt SPD cleat interfaces.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8993842003998/5061344-BK000.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8993842003998/5061344-BK000.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "45NRTH Ragnarok Transition Shoes - Unisex",
  "product_code": "5061-344",
  "source_url": "https://www.mec.ca/en/product/5061-344/Ragnarok-Transition-Shoes",
  "tech_specs": {
    "Closure": [
      "Ratchet cable"
    ],
    "Ideal for": [
      "Cycle commuting",
      "Cyclocross",
      "Mountain biking"
    ],
    "Made in": [
      "China"
    ],
    "Outsole": [
      "Rubber"
    ],
    "Pedal compatibility": [
      "2-hole clipless"
    ],
    "Upper material": [
      "Synthetic leather"
    ],
    "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": [
      "Yes"
    ],
    "Weight": [
      "950g (44)"
    ]
  }
}