{
  "categories": [
    "Home",
    "All",
    "Travel gear",
    "Books and maps",
    "Guidebooks",
    "Nepal 11th Edition"
  ],
  "description": "Lonely Planet’s Nepal is your passport to the most relevant, up-to-date advice on what to see and skip, and what hidden discoveries await you. Explore the historic temples of old Kathmandu, search for rhinos and tigers in the dawn mist of Chitwan National Park, and trek in the shadow of the world’s highest mountain on an Everest Base Camp expedition – all with your trusted travel companion. Get to the heart of Nepal – what adventure will you find?Inside Lonely Planet’s Nepal:Colour maps and images throughout.Highlights and itineraries help you tailor your trip to your personal needs and interests.Insider tips to save time and money and get around like a local, avoiding crowds and trouble spots.Essential info at your fingertips: hours of operation, phone numbers, websites, transit tips, prices.Honest reviews for all budgets: eating, sleeping, sightseeing, going out, shopping, hidden gems that most guidebooks miss.Cultural insights provide a richer, more rewarding travel experience, covering history, people, music, landscapes, wildlife, cuisine, politics.Covers Kathmandu, Around the Kathmandu Valley, Pokhara & Around, The Terai & Mahabharat Range.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8981360640030/5062135-NOC02.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8981360640030/5062135-NOC02.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Lonely Planet Nepal 11th Edition",
  "product_code": "5062-135",
  "source_url": "https://www.mec.ca/en/product/5062-135/Nepal-11th-Edition",
  "tech_specs": {
    "Author": [
      "Lonely Planet"
    ],
    "Edition": [
      "11th"
    ],
    "ISBN": [
      "9781786570574"
    ],
    "Ideal for": [
      "Travel"
    ],
    "Language": [
      "English"
    ],
    "Made in": [
      "Singapore"
    ],
    "Pages": [
      "416"
    ],
    "Published": [
      "2018"
    ],
    "Regionality": [
      "Asia"
    ]
  }
}