{
  "categories": [
    "Home",
    "All",
    "Packs and bags",
    "Luggage",
    "Travel packs",
    "Farpoint 70L Backpack"
  ],
  "description": "A lightweight travel pack for frequent flyers and globetrotters. An integrated daypack zips off the front for hands-free exploring or trips to the local market. Durable fabrics in high-wear areas stand up to being strapped to van-taxi roof racks or tossed into Thai long-tails. The padded hipbelt and harness let you comfortably shoulder the load when your itinerary includes a hut-to-hut trek around Mont Blanc or the Milford Track. If you have to check your bag, the harness and hipbelt quickly stow away behind a zippered panel. Travel-friendly features include lockable zippers, a padded laptop sleeve, and 2 front compression straps that help you slim it down if you've managed to pare down your gear on the road. Or if you're into souvenirs, feel free to toss 'em in – the Farpoint is designed to carry loads up to 50 pounds.Made of lightweight 210-denier ripstop nylon with strong 600-denier packcloth reinforcements and bottom panel.Harness and hipbelt zip behind a panel for protection when you check your bag.Foam-padded shoulder straps, back panel and hipbelt have soft mesh contact surfaces.Padded top and side handles provide comfortable carry in suitcase mode.Large U-shaped zippered opening provides easy access to the main compartment.Interior mesh pockets and compression straps keep your stuff organized.Removable straps let you carry a sleeping pad, yoga mat or jacket on the bottom.Detachable 13L day pack has a padded sleeve for your 15in. laptop and tablet, a soft lined pocket for your sunglasses and front mesh pckets for water bottles.Main compartment and daypack have lockable zippers.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9005530513438/5063804-VOG01.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9005530513438/5063804-VOG01.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Osprey Farpoint 70L Backpack - Men's",
  "product_code": "5063-804",
  "source_url": "https://www.mec.ca/en/product/5063-804/Farpoint-70L-Backpack",
  "tech_specs": {
    "Access\n\nThe location of all access points into the main compartment of the pack.": [
      "Front"
    ],
    "Additional feature(s)": [
      "Removable daypack included"
    ],
    "Carry-on sized\n\nSize restrictions vary among airlines. Just to be sure, check with your carrier for their specific restrictions.": [
      "No"
    ],
    "Depth": [
      "33cm"
    ],
    "Hipbelt": [
      "Padded"
    ],
    "Ideal for": [
      "Travel"
    ],
    "Length": [
      "61cm (Small/Medium)",
      "66cm (Medium/Large)"
    ],
    "Made in": [
      "Vietnam"
    ],
    "Main fabric": [
      "210-denier ripstop nylon"
    ],
    "Padded sleeve fits most\n\nA padded slot to fit electronics or laptops, it may be partially or fully padded on each side.": [
      "15-inch laptop",
      "tablet"
    ],
    "Secondary fabric": [
      "600-denier nylon"
    ],
    "Ventilated back panel": [
      "No"
    ],
    "Volume": [
      "67L (Small/Medium)",
      "70L (Medium/Large)"
    ],
    "Weight": [
      "1.7kg (Small/Medium)",
      "1.78kg (Medium/Large)"
    ],
    "Width": [
      "33cm (Small/Medium)",
      "35cm (Medium/Large)"
    ]
  }
}