{
  "categories": [
    "Home",
    "All",
    "Camping and hiking",
    "Tools and accessories",
    "Maps and guidebooks",
    "Maps",
    "Trail and topographic maps",
    "PoMo to PoCo Trail Map"
  ],
  "description": "This is the must-have trail map for anyone walking, hiking or biking the trails, backroads and dykes around Port Moody and Port Coquitlam. Use this map to find the best waterfalls, lakes, viewpoints, peaks, singletrack and old-growth forests in the region. This detailed, accurate trail map has 20m contour intervals and covers recreational areas in town, residential areas and the entire backcountry.Map area extends from Indian Arm area to Pitt Meadows (W to E) and Lougheed Hwy to Coquitlam Lake/Widgeon Lake (S to N).Includes Belcarra Regional Park, Indian Arm Provincial Park, Pinecone Burke Provincial Park, Minnekhada Regional Park, Widgeon Marsh Regional Park Reserve and Pitt-Addington Marsh WMA.Shows Rocky Point Park, Town Centre Park, Bert Flinn Park, Coquitlam River Park, Ridge Park, Eagle Mountain Park, North Hoy Creek Park, Noons Creek Park & many more.Details Buntzen Lake trails (including Diez Vistas Trail), Eagle Mountain area trails & Sasamat Lake Trails.Shows Eagle and Burke mountain bike trail networks and cycling routes.Includes Widgeon Slough paddling route, Widgeon Creek Valley trails and Pitt River/Pitt Lake dyke walks.Includes the Coquitlam Crunch Trail and the entire Burke-Widgeon Connector Mountaineering Route.Double-sided map shows all backroads and trails for the entire map area.1:18,000 scale main maps with one 1:20,000 map.All Skytrain stations, streets and roads to show access to all parks and trails.Waterproof and tear-resistant – if cared for properly, this map will last for many years.UTM grid (with 1km gridlines) as well as latitude/longitude grid for easy GPS use.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8993070710814/5063977-NOC02.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8993070710814/5063977-NOC02.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "PoMo to PoCo Trail Map",
  "product_code": "5063-977",
  "source_url": "https://www.mec.ca/en/product/5063-977/PoMo-to-PoCo-Trail-Map",
  "tech_specs": {
    "Ideal for": [
      "Cycling",
      "Day hiking",
      "Backpacking",
      "Watersports"
    ],
    "Language": [
      "English"
    ],
    "Made in": [
      "Canada"
    ],
    "Published": [
      "2018"
    ],
    "Regionality": [
      "British Columbia"
    ],
    "Scale": [
      "1:18,000"
    ],
    "Tearproof": [
      "Yes"
    ],
    "Waterproof": [
      "Yes"
    ]
  }
}