{
  "categories": [
    "Home",
    "All",
    "Cycling",
    "Bike components",
    "Tires, tubes, wheels and hubs",
    "Bike wheels",
    "Wheelsets",
    "AR29 X Wheelset"
  ],
  "description": "Get ready to smash some KOMs with these carbon wheels. Ideal for riders who value lightweight components that don't come at the cost of durability. The 29mm rim depth feels stable when the wind picks up. A 19mm internal width ensures they play nice with modern tire widths. For the ultimate riding experience, the rims are tubeless ready, which not only reduces the chances of punctures, but also reduces rolling resistance. When getting out of the saddle, the snappy yet smooth ride helps squeeze every last watt out of your legs. Premium hubs, spokes and nipples drive the weight down, so you get to the top of the climb first.Tubeless ready rim allows for lower pressure, reduced rolling resistance and improved comfort.Rim shape is optimized for crosswind stability.Rim depth of 29mm provides aero advantages while being light.Internal width of 19mm and external width of 27mm allows air to flow smoothly.Sapim CX-Sprint spokes with alloy nipples are light and strong.20 spokes laced radially in the front, and 24 spokes in a 2-cross pattern in the rear.Reynolds Allroads hubs features fast and smooth rolling bearings.10° of hub engagement helps you close the gap when responding to an attack.Comes with a Shimano/SRAM 11-speed freehub body.CTG2 brake track is designed with heat resistance and durable performance in mind.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8998343704606/5064643-BK000.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8998343704606/5064643-BK000.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Reynolds Cycling AR29 X Wheelset",
  "product_code": "5064-643",
  "source_url": "https://www.mec.ca/en/product/5064-643/AR29-X-Wheelset",
  "tech_specs": {
    "Brake compatibility": [
      "Rim brakes"
    ],
    "Front hub width\n\nThe hub width must fit the inside distance between the two fork ends (dropouts).": [
      "100mm"
    ],
    "Hub (front)": [
      "Reynolds Allroad"
    ],
    "Hub (rear)\n\nThe hub affects a bike’s rolling efficiency. Internally geared hubs require significantly less maintenance.": [
      "Reynolds Allroad"
    ],
    "Ideal for": [
      "Performance and race road cycling",
      "Sport road cycling"
    ],
    "Made in": [
      "Taiwan"
    ],
    "Material": [
      "Carbon fibre"
    ],
    "Rear hub width": [
      "130mm"
    ],
    "Retention device": [
      "Quick-release"
    ],
    "Rims": [
      "Reynolds AR29 X"
    ],
    "Size": [
      "700C"
    ],
    "Spokes": [
      "Sapim CX-Sprint"
    ],
    "Tire type": [
      "Tubeless",
      "Clincher"
    ],
    "Valve compatibility\n\nThe type of tube valve the rim will accommodate. Most Schrader wheels can be retrofitted to fit Presta valves.": [
      "Presta"
    ],
    "Weight": [
      "1.39kg"
    ]
  }
}