{
  "categories": [
    "Home",
    "All",
    "Clothing",
    "Clothing accessories",
    "Gloves and mittens",
    "Gloves",
    "Montana Futurelight Etip Gloves"
  ],
  "description": "No cold fingers on pow days. Windproof, waterproof insulated gloves keep hands toasty and dry whether you're riding the chair, bombing down black diamonds or breaking trail in the backcountry. Waterproof fabric, a DWR finish, taped seams and a FUTURELIGHT™ insert block out snow and water. HeatSeeker insulation and a fleece lining keeps fingers cozy on extra-cold days.Outer shell is waterproof and windproof DryVent 2L with DWR finish and fully taped seams for breathable weather protection.FUTURELIGHT waterproof-breathable insert keeps water out.Polyurethane synthetic leather palms for durability and grip.Etip™ touchscreen compatible fingers allow you to use your devices without removing gloves.200g Heakseeker™ ECO polyester insulation (50% recycled content) on the backs.100g Heatseeker™ ECO insulation on palm.High-pile polyester fleece lining is soft against the skin.Cinchable wrist seals heat in.\n\n        Sustainability\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                      Recycled content",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9151306989598/6001832-BK276.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9151306989598/6001832-BK276.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "The North Face Montana Futurelight Etip Gloves - Men's",
  "product_code": "6001-832",
  "source_url": "https://www.mec.ca/en/product/6001-832/Montana-Futurelight-Etip-Gloves",
  "tech_specs": {
    "Hand warmer pocket\n\nThe gloves or mitts feature a small pocket to insert a heater pack for extra warmth.": [
      "No"
    ],
    "Ideal for": [
      "Downhill skiing",
      "Backcountry skiing",
      "Snowboarding"
    ],
    "Insulation": [
      "Heavy"
    ],
    "Liner fabric": [
      "100% polyester"
    ],
    "Liner type": [
      "Sewn-in"
    ],
    "Made in": [
      "Vietnam"
    ],
    "Main fabric": [
      "100% nylon"
    ],
    "Palm material\n\nThe type of material used on the palm of the glove. Grippy palms have a raised silicone or polyurethane pattern to improve grip and are most often seen on cycling and paddling handwear.": [
      "Synthetic leather"
    ],
    "Product sustainability": [
      "Recycled content"
    ],
    "Touchscreen compatible": [
      "Yes"
    ],
    "Type": [
      "Mittens"
    ],
    "Waterproof": [
      "Yes"
    ],
    "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": [
      "Windproof"
    ]
  }
}