{
  "categories": [
    "Home",
    "All",
    "Clothing",
    "Jackets",
    "Insulated jackets",
    "Synthetic jackets",
    "Lone Mountain 3-in-1 Jacket"
  ],
  "description": "When the forecast call for a little of everything, the Lone Mountain 3-in-1 is straightforward solution. By itself, the waterproof-breathable H2No® shell shrugs off showers and blocks rude winds. Add the nicely insulated inner layer when you need core warmth for mountain or town weather. It's insulated with a soft, efficient layer of THERMOLITE® polyester and lined in fleece through the body, with smooth taffeta in the arms.External layer attaches to insulated layer via solid zippers and snaps at the cuffs and collar.H2No Performance Standard 2-layer waterproof breathable outer shell with DWR finish and fully welded seams.Shell hood and sleeves are lined in polyester taffeta to slide easily over layers.Hood has 2-way adjustments.Fully welded seams keep the promise of waterproofness.Shell has an exterior storm flap, interior wind-flap closure and zip-through collar with microfleece-lined chin flap and collar.Inner jacket uses recycled polyester (70% recycled) and is lined with smooth polyester fleece (70% recycled); sleeves are lined with recycled polyester taffeta.Diamond quilt pattern secures 60g ThermoLite polyester (92% recycled) in body and 80g ThermoLite polyester insulation in the sleeves.Shell has one headphone compatible chest pocket, and 2 hand pockets.Zip-out jacket has 2 handwarmer pockets lined with micro-polyester brushed jersey.Snap closes at wrists.Shell has an adjustable hem for maximum weather protection.Hip length.\n\n        Sustainability\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                      Recycled content\n\n\n\n\n\n\nFairTrade\n\n\n\n\n\n\n\n\n\n\n\n                      Certified Fair Trade",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9130060382238/6001746-FRG00.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9130060382238/6001746-FRG00.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Patagonia Lone Mountain 3-in-1 Jacket - Men's",
  "product_code": "6001-746",
  "source_url": "https://www.mec.ca/en/product/6001-746/Lone-Mountain-3-in-1-Jacket",
  "tech_specs": {
    "Additional feature(s)": [
      "3-in-1 jacket system"
    ],
    "Construction": [
      "2-layer",
      "Quilted"
    ],
    "Durable water repellency\n\nUsually referred to as DWR. A treatment made to fabrics that causes water to bead and run off instead of soaking through.": [
      "Yes"
    ],
    "Face fabric": [
      "Nylon",
      "Polyester"
    ],
    "Hood": [
      "Adjustable"
    ],
    "Ideal for": [
      "Casual wear"
    ],
    "Insulation": [
      "60g/sq. m polyester (body)",
      "80g/sq. m polyester (arms)"
    ],
    "Length": [
      "Hip-length"
    ],
    "Made in": [
      "Vietnam"
    ],
    "Pockets": [
      "2 handwarmer",
      "1 external chest",
      "2 front"
    ],
    "Product sustainability": [
      "Recycled content",
      "Certified Fair Trade"
    ],
    "Technology": [
      "H2No",
      "Thermogreen"
    ],
    "Type": [
      "Insulated synthetic",
      "Waterproof-breathable"
    ],
    "Waterproofness\n\nWaterproof garments use waterproof-breathable technologies and are fully seam-taped. Water-resistant garments use waterproof-breathable technologies but their seams are not taped. Water-resistant garments repel water and protect against wind but are not made of waterproof fabric.": [
      "Waterproof with fully taped seams"
    ],
    "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": [
      "Windproof"
    ]
  }
}