{
  "categories": [
    "Home",
    "All",
    "Camping and hiking",
    "Hiking footwear",
    "Hiking shoes",
    "Konseal FL Gore-Tex Approach Shoes"
  ],
  "description": "Push higher and travel lighter in the vertical world. The light and agile Konseal FL GTX shoe is designed for technical approaches and day hikes where speed and weather protection are key. The sticky sole provides traction in any terrain, with a climbing zone to inspire confidence when the trail approaches 5th class.Breathable ripstop mesh upper is lightweight and durable.Waterproof-breathable GORE-TEX® membrane shelter feet from the elements.Durable TPU film overlay, raised synthetic nubuck sidewalls, and rubber toecap resist abrasion and protect feet from trail bumps.Gusseted tongue keeps trail debris out.Ortholite™ footbed delivers maximum comfort, breathability and arch support.Injected EVA midsole cushions underfoot and an integrated TPU chassis adds stability and support in technical terrain.Vibram® MegaGrip™ rubber outsole provides confident footing in varied terrain.Tread pattern has climbing zone under toes and mid- and rear-foot lugs for travel on trails.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9041722408990/6001086-BPI00.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9041722408990/6001086-BPI00.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Arc'teryx Konseal FL Gore-Tex Approach Shoes - Men's",
  "product_code": "6001-086",
  "source_url": "https://www.mec.ca/en/product/6001-086/Konseal-FL-Gore-Tex-Approach-Shoes",
  "tech_specs": {
    "Closure": [
      "Lace-up"
    ],
    "Ideal for": [
      "Day hiking"
    ],
    "Made in": [
      "China"
    ],
    "Rand\n\nRubber on the toe and around the boot improves durability. It can also increase grip while scrambling.": [
      "Toecap"
    ],
    "Removable insole": [
      "Yes"
    ],
    "Upper material": [
      "Synthetic",
      "Synthetic leather",
      "TPU"
    ],
    "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": [
      "Yes"
    ],
    "Weight": [
      "700g (9)"
    ]
  }
}