{
  "categories": [
    "Home",
    "All",
    "Camping and hiking",
    "Hiking footwear",
    "Hiking shoes",
    "Aerios FL Mid Gore-Tex Light Hiking Shoes"
  ],
  "description": "The mind of a trail runner meets the body of a hiking shoe, the Aerios FL mid-height shoe is designed for rapid travel in remote and varied conditions. The highly durable fabric upper offers a snug and secure fit, like a running shoe, and the TPU overlay and toecap protects the high-wear areas. An integrated TPU shank keeps your feet stable and supported in uneven terrain.Cordura® mesh upper is durable and breathable.Waterproof-breathable GORE-TEX® membrane shelter feet from the elements.Durable TPU film overlay and TPU toecap resist abrasion and protect feet from trail bumps.Mid-height ankle provides support without adding much weight.3D moulded Ortholite™ footbed delivers maximum comfort, breathability and arch support.Compressed EVA midsole cushions underfoot and an integrated TPU shank adds stability on technical trails.Vibram® MegaGrip™ rubber outsole provides confident footing in varied terrain.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9041723129886/6001267-BSB01.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9041723129886/6001267-BSB01.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Arc'teryx Aerios FL Mid Gore-Tex Light Hiking Shoes - Women's",
  "product_code": "6001-267",
  "source_url": "https://www.mec.ca/en/product/6001-267/Aerios-FL-Mid-Gore-Tex-Light-Hiking-Shoes",
  "tech_specs": {
    "Closure": [
      "Lace-up"
    ],
    "Ideal for": [
      "Day hiking"
    ],
    "Made in": [
      "China"
    ],
    "Rand\n\nRubber on the toe and around the boot improves durability. It can also increase grip while scrambling.": [
      "Toecap"
    ],
    "Removable insole": [
      "Yes"
    ],
    "Upper material": [
      "Synthetic"
    ],
    "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": [
      "Yes"
    ],
    "Weight": [
      "640g (7)"
    ]
  }
}