{
  "categories": [
    "Home",
    "All",
    "Kids",
    "Baby (0-2 yrs)",
    "Baby clothing",
    "Baby outerwear",
    "Baby jackets",
    "Baby insulated jackets",
    "Baby Down Sweater"
  ],
  "description": "Serious warmth for keeping spirits high. The Patagonia Baby Down Sweater provides a layer of warm, windproof insulation that's great for kids who won't be generating a lot of heat when riding in a sled or baby carrier. The weather-resistant outer fabric is extremely light and has a good amount of abrasion resistance. Quilted construction keeps the down in place and elastic at the back hem seals out drafts.Shell and lining are recycled polyester with a DWR (durable water repellent) finish to keep it water-resistant and windproof.Insulated with premium 700-fill-power recycled down reclaimed from down products.Quilted construction secures the down in place.2 zippered handwarmer pockets with reflective pulls.Full-length zipper has a wind flap and zipper garage.Elastic at back hem traps warm air.Internal hand-me-down ID label.\n\n        Sustainability\n\n\n\n\n\n\n\n\nBluesign\n\n\n\n\n\n\n\n\n\n\n\n                      Bluesign® Approved Material\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                      Recycled content",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9137039376414/6002932-WLB05.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9137039376414/6002932-WLB05.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Patagonia Baby Down Sweater - Infants to Children",
  "product_code": "6002-932",
  "source_url": "https://www.mec.ca/en/product/6002-932/Baby-Down-Sweater",
  "tech_specs": {
    "Construction": [
      "Sewn-through"
    ],
    "Durable water repellency\n\nUsually referred to as DWR. A treatment made to fabrics that causes water to bead and run off instead of soaking through.": [
      "Yes"
    ],
    "Face fabric": [
      "30-denier recycled polyester"
    ],
    "Ideal for": [
      "Casual wear"
    ],
    "Insulation": [
      "700 fill-power recycled goose and duck down blend"
    ],
    "Lining/backer": [
      "Recycled polyester"
    ],
    "Made in": [
      "Sri Lanka"
    ],
    "Pockets": [
      "2 handwarmer"
    ],
    "Product sustainability": [
      "Bluesign® Approved Material",
      "Recycled content"
    ],
    "Technology": [
      "Traceable Down"
    ],
    "Type": [
      "Insulated down"
    ],
    "Waterproofness\n\nWaterproof garments use waterproof-breathable technologies and are fully seam-taped. Water-resistant garments use waterproof-breathable technologies but their seams are not taped. Water-resistant garments repel water and protect against wind but are not made of waterproof fabric.": [
      "Water-resistant"
    ],
    "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": [
      "Wind-resistant"
    ]
  }
}