{
  "categories": [
    "Home",
    "All",
    "Ski and snowboard gear",
    "Downhill skiing gear",
    "Downhill skis",
    "QST Lux 92 Skis"
  ],
  "description": "All the fun of a backside ski in a frontside package. Salomon’s freeski DNA runs through the QST 92, making it an all-mountain monster ready to tackle it all. Stable with some pop, the ski adds confidence at speed. The sidecut is focused for power and edge grip while its rubber edging smooths the ride and improves contact with the snow. A Koroyd tip cuts through chatter but keeps you in control on piste or off.Internally milled wood core offers great stability and rebound.Power transfer platform underfoot offers great edging on hard snow.Carbon layer and flax laminate keeps the weight low while increasing the ski's dampness.All-Terrain Rocker 2.0 offers a mix of precision and manoeuvrability.Sandwich construction features ABS sidewall all around the ski for increase durability and strength.5-point sidecut improves steering in mixed snow and feels quick and agile.Koroyd Tip is lightweight and reduces vibration without sacrificing control.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9055728500766/6003803-NOC02.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9055728500766/6003803-NOC02.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Salomon QST Lux 92 Skis - Women's",
  "product_code": "6003-803",
  "source_url": "https://www.mec.ca/en/product/6003-803/QST-Lux-92-Skis",
  "tech_specs": {
    "Ability\n\nBeginner: new or getting back into skiing.  Intermediate: confident with turning and stopping.  Advanced: highly confident carver. Expert: steeps, drops, park, double blacks -- bring it on.": [
      "Intermediate",
      "Advanced",
      "Expert"
    ],
    "Bindings included": [
      "No"
    ],
    "Construction\n\nSandwich and combination construction is generally used for big freeride-style skis while the lighter structural cap type of construction is more commonly found on cross-country skis.": [
      "Sandwich"
    ],
    "Core": [
      "Wood"
    ],
    "Dimension": [
      "128-92-111mm (153cm)",
      "129-92-112mm (161cm)",
      "130-92-113mm (169cm)",
      "131-92-114mm (177cm)"
    ],
    "Ideal for": [
      "Downhill skiing"
    ],
    "Made in": [
      "Bulgaria"
    ],
    "Rocker/camber profile": [
      "Rocker tip",
      "Rocker tail"
    ],
    "Snow conditions": [
      "Mixed"
    ],
    "Terrain": [
      "On-Piste",
      "Off-Piste"
    ],
    "Turning radius": [
      "15m (153cm)",
      "16m (161cm)",
      "17m (169cm)",
      "18m (177cm)"
    ],
    "Weight": [
      "1.49kg (153cm)",
      "1.61kg (161cm)",
      "1.73kg (169cm)"
    ]
  }
}