{
  "categories": [
    "Home",
    "All",
    "Ski and snowboard gear",
    "Cross country skiing gear",
    "Cross country skate",
    "Skate ski boots",
    "RS8 Prolink Boots"
  ],
  "description": "Push off with confidence in Salomon's RS Prolink boot. With an ultra-supportive cuff, this boot provides solid lateral support in a trim but comfortable performance fit. Race-inspired graphics make you go faster (or at least feel that way) and suit skating enthusiasts who want proven performance.Skating flex uppers provide a precise fit.Thermomouldable liners use foam and LYCRA to achieve a custom fit.3-D mesh interior fabric wicks sweat to improve breathability.Exterior soft shell fabric is highly breathable and stretches to move with you.One-pull Quicklace system tightens precisely with polygliding hooks and a tough Kevlar lace.Lace cover with central zip.Adjustable heel strap keeps your heel in place.Active Energizer cuff offers progresive support that allows your muscles to relax and provide fast ski return.Fibreglass reinforced plastic chassis for strong heel support and torsional rigidity.Prolink soles are NNN compatible and provide a low-profile boot–binding connection for exceptional snow feel.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9053385949214/6003903-NOC02.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9053385949214/6003903-NOC02.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Salomon RS8 Prolink Boots - Unisex",
  "product_code": "6003-903",
  "source_url": "https://www.mec.ca/en/product/6003-903/RS8-Prolink-Boots",
  "tech_specs": {
    "Boot/binding compatibility\n\nThe boot and binding systems must match for best performance and safe use.": [
      "NNN"
    ],
    "Hinged/high cuff": [
      "Yes"
    ],
    "Ideal for": [
      "Skate ski racing",
      "Fitness skate skiing"
    ],
    "Insulated": [
      "No"
    ],
    "Lace cover": [
      "Yes"
    ],
    "Made in": [
      "Romania"
    ],
    "Thermoformable inner boot": [
      "Yes"
    ],
    "Weight": [
      "1.18kg (UK 8)"
    ]
  }
}