{
  "categories": [
    "Home",
    "All",
    "Ski and snowboard gear",
    "Downhill skiing gear",
    "Downhill ski boots",
    "Panterra 75 W GW Ski Boots"
  ],
  "description": "Test your turns without regrets. The Panterra 75 GW prioritizes comfort for female skiers without compromising stability. With a softer flex, these accessible boots move with less effort, so you can ski all day. The sculpted liners can be skied out of the box, or thermo-moulded for an instantly personalized fit.  Using the boot's micro-adjust buckles, you can tweak your boot tightness whenever you need to. As long as the lifts are running, keep skiing in comfort.Lightweight PU shell construction reduces weight.Power Cage design transmits power to the ski and stabilizes the leg.Cabrio 3 piece shell design flexes consistently and absorbs shock.Variable Volume Fit allows adjustment of the forefoot width.Contour 4 Fit Technology fits securely while allowing extra room where needed.My Fit system offers customizable fit at the shell and liner.Adjustable rear cuff lets you customize the boot's height to your calf.Dynalink heel strap keeps the foot from sliding.Grip Walk soles allow nearly-normal walking with a rockered design.Dura-grip replaceable heels and toes.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9055747538974/6004297-BK058.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9055747538974/6004297-BK058.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Dalbello Panterra 75 W GW Ski Boots",
  "product_code": "6004-297",
  "source_url": "https://www.mec.ca/en/product/6004-297/Panterra-75-W-GW-Ski-Boots",
  "tech_specs": {
    "Boot/binding compatibility\n\nThe boot and binding systems must match for best performance and safe use.": [
      "GripWalk"
    ],
    "Buckles": [
      "4"
    ],
    "Flex index\n\nIndicates how stiff the boots are when flexed forward.  Flex ranges from 50 (soft) to 130 (very stiff). Note: There is currently no industry standardized test.": [
      "75"
    ],
    "Hike mode\n\nA mechanism that allows to release the boot cuff to switch to tour mode.": [
      "Yes"
    ],
    "Ideal for": [
      "Downhill skiing"
    ],
    "Lace-up option": [
      "No"
    ],
    "Last width\n\nThe width of the interior of the boot shell across the widest part of the forefoot.": [
      "99-101mm"
    ],
    "Lower shell material": [
      "Polyurethane"
    ],
    "Made in": [
      "Italy"
    ],
    "Range of motion\n\nThe range of motion of the boot when in hike mode.": [
      "50º"
    ],
    "Shell cuff material": [
      "Polyurethane"
    ],
    "Sole type\n\nAlpine Touring: with tread; compatible with DIN touring bindings. Alpine Touring Tech (Tech): with tread; compatible with G3 Onyx and Dynafit. Downhill: without tread; compatible with freeride/downhill bindings.": [
      "Downhill"
    ],
    "Thermoformable inner boot": [
      "Yes"
    ],
    "Weight": [
      "1.75kg (24.5)"
    ]
  }
}