{
  "categories": [
    "Home",
    "All",
    "Ski and snowboard gear",
    "Downhill skiing gear",
    "Downhill skis",
    "Sprayer Skis + Bindings"
  ],
  "description": "Jib the park before cutting over to slay the sidecountry on a ski that responds as fast as you do. Rossignol’s Sprayer model is an agile all-mountain freestyle twin tip that gives you durability while you reach your peak. A wood and fibreglass core extends play time while traditional camber and an extended sidecut deliver power and edge grip while still improving rotation at lower speeds. A rounded jib tip with a rubber layer for shock absorption has you ready to tackle park and pipe or ski switch.Cap construction.Wood core with fibreglass reinforcement gives you flexibility.Extended sidecut improves grip and handling as well as rotation at lower speeds.Rounded jib tip has a rounder tip shape and rubber layer for pipe and park transitions and skiing switch while giving you great shock absorption and durability.Includes Look XPress 10 lightweight and tool-free bindings with a 2.5-10 DIN range.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9049364168734/6004483-NOC02.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9049364168734/6004483-NOC02.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Rossignol Sprayer Skis + Bindings - Boys' - Children to Youths",
  "product_code": "6004-483",
  "source_url": "https://www.mec.ca/en/product/6004-483/Sprayer-Skis-%2B-Bindings",
  "tech_specs": {
    "Ability\n\nBeginner: new or getting back into skiing.  Intermediate: confident with turning and stopping.  Advanced: highly confident carver. Expert: steeps, drops, park, double blacks -- bring it on.": [
      "Intermediate",
      "Beginner"
    ],
    "Bindings included": [
      "Yes"
    ],
    "Construction\n\nSandwich and combination construction is generally used for big freeride-style skis while the lighter structural cap type of construction is more commonly found on cross-country skis.": [
      "Structural cap"
    ],
    "Core": [
      "Wood"
    ],
    "Dimension": [
      "127-72-108mm (168cm)"
    ],
    "Ideal for": [
      "Downhill skiing"
    ],
    "Made in": [
      "Spain"
    ],
    "Rocker/camber profile": [
      "Full camber"
    ],
    "Snow conditions": [
      "Mixed",
      "Groomed"
    ],
    "Terrain": [
      "On-Piste"
    ],
    "Turning radius": [
      "14m (168cm)"
    ]
  }
}