{
  "categories": [
    "Home",
    "All",
    "Clothing",
    "Clothing accessories",
    "Gloves and mittens",
    "Mitts",
    "Heat Mitts 4.0 (Batteries Sold Separately)"
  ],
  "description": "A battery-powered heating element hidden in your mitts is technology's answer to winter's coldest days. A durable, waterproof shell with Primaloft® insulation and fleece lining keeps your hands warm in cool conditions, but for deeply cold days, connect Lenz's lithium battery packs to heat fingers and keep your manual dexterity. Heating elements keep you warm and cozy while skiing, snowshoeing or climbing – plus, the index area and thumb are touchscreen-compatible, so you can take a photo at the viewpoint without taking off your mitts.Waterproof polyester, leather and nylon shell has 4-way stretch for full dexterity.Polyester fleece lining adds warmth without excess bulk.Goat leather palm for durability and grip.Primaloft® insulation in backs of hands.Integrated heat element on top of the fingers and thumb keeps your hands warm.Touchscreen-compatible index and thumb let you cycle songs without removing mitts.Compatible with Lenz Lithium Pack rcB 1200 and rcB 1800 (sold separately).",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9064218951710/6004234-BK000.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9064218951710/6004234-BK000.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Lenz Heat Mitts 4.0 (Batteries Sold Separately) - Women's",
  "product_code": "6004-234",
  "source_url": "https://www.mec.ca/en/product/6004-234/Heat-Mitts-4-0-%28Batteries-Sold-Separately%29",
  "tech_specs": {
    "Additional feature(s)": [
      "Goggle wipe",
      "Heated"
    ],
    "Ideal for": [
      "Backcountry skiing",
      "Snow and ice climbing",
      "Downhill skiing",
      "Snowboarding"
    ],
    "Insulation": [
      "Heavy"
    ],
    "Liner fabric": [
      "100% polyester"
    ],
    "Liner type": [
      "Sewn-in"
    ],
    "Made in": [
      "China"
    ],
    "Main fabric": [
      "55% polyester",
      "40% leather",
      "5% nylon"
    ],
    "Palm material\n\nThe type of material used on the palm of the glove. Grippy palms have a raised silicone or polyurethane pattern to improve grip and are most often seen on cycling and paddling handwear.": [
      "Leather"
    ],
    "Touchscreen compatible": [
      "Yes"
    ],
    "Type": [
      "Gloves"
    ],
    "Waterproof": [
      "Yes"
    ],
    "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": [
      "Windproof"
    ]
  }
}