{
  "categories": [
    "Home",
    "All",
    "Clothing",
    "Clothing accessories",
    "Sunglasses",
    "Casual sunglasses",
    "Suspect Sunglasses"
  ],
  "description": "With a solid frame, slightly sporty wrap and casual style, the Suspect are at home on a morning ride or afternoon meeting.Designed for medium sized faces.Polarized lenses cut glare from water, ice, sand, snow and pavement for clear vision and reduced eye strain.Full-frame and thick temples help block light coming in from odd angles.Tough Grilamid thermoplastic framesPolycarbonate material used in the lenses is lightweight and shatter resistant.Microfibre cleaning/storage bag included.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9034570792990/6004951-MBB01.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9034570792990/6004951-MBB01.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Suncloud Suspect Sunglasses - Unisex",
  "product_code": "6004-951",
  "source_url": "https://www.mec.ca/en/product/6004-951/Suspect-Sunglasses",
  "tech_specs": {
    "100% UVA protected": [
      "Yes"
    ],
    "100% UVB protected": [
      "Yes"
    ],
    "Fits over most eyewear\n\nThese optics are designed to fit comfortably over most eyewear.": [
      "No"
    ],
    "Frame material\n\nTR90 thermoplastic offers good resistance to chemicals and torsion. Propionate is a light, nylon-based, hypoallergenic plastic that's very strong and offers more transparency and gloss than other plastics.": [
      "Grilamid"
    ],
    "Ideal for": [
      "Casual wear"
    ],
    "Interchangeable lenses\n\nInterchangeable lenses let you change lenses to suit differing light conditions or activities.": [
      "No"
    ],
    "Lens material": [
      "Polycarbonate"
    ],
    "Lens performance\n\nFixed tints provide a constant degree of darkness. Photochromic lenses adjust to changing light levels. Polarized lenses absorb horizontal reflected glare to improve clarity around surfaces like snow or water.": [
      "Polarized",
      "Fixed tint"
    ],
    "Made in": [
      "China"
    ],
    "Visible Light Transmission\n\n0-10% – very heavy tint, too dark for most needs. \n10-30% – heavy tint for bright sunny days.\n20-60% – light tint, great for cloudy, overcast conditions and shady trails. \n60-80% – very light tint (often coloured), for improving contrast in low-light conditions, think dawn or dusk. \n80-100% – little to no tint, this what you want in the dark.": [
      "15%"
    ]
  }
}