{
  "categories": [
    "Home",
    "All",
    "Ski and snowboard gear",
    "Snowboarding gear",
    "Snowboard boots",
    "Kiana Toast Focus Boa Snowboard Boots"
  ],
  "description": "These amazing boots provide up to 18 hours of warmth and three different heating modes, then recharge for the next day via USB. They have a medium flex designed to perform in all terrain types, with a top-quality thermomoldable liner for optimal comfort and control. Dual-zone BOA® lacing system lets you make precise, independent fit adjustments to the upper and lower portions of the boot, while an Ortholite footbed creates a cool, dry inner climate.Onboard heating technology provides up to 18 hours of warmth and three different heating modes (from quick heat blast to long, slow warmth).Liners charge via USB.Versatile medium flex for all-conditions riding.Deluxe thermomoldable liner is machine washable, extra-warm and extra-soft.Cat-Tongue material at base of heel grips your socks for increased heel hold.Dual-zone BOA® lacing system allows precise, independent adjustments to the top and bottom portions of the boot.Cushioning Ortholite footbed wicks moisture for a drier, more comfortable fit.Premium EVA midsole provides outstanding rebound and comfort.Grippy rubber outsole is low profile for comfortable riding and walking.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9055732170782/6004055-BK000.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9055732170782/6004055-BK000.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Salomon Kiana Toast Focus Boa Snowboard Boots - Women's",
  "product_code": "6004-055",
  "source_url": "https://www.mec.ca/en/product/6004-055/Kiana-Toast-Focus-Boa-Snowboard-Boots",
  "tech_specs": {
    "Ideal for": [
      "Snowboarding"
    ],
    "Made in": [
      "Vietnam"
    ],
    "Thermoformable inner boot": [
      "Yes"
    ],
    "Weight": [
      "2.12kg (24)"
    ]
  }
}