{
  "categories": [
    "Home",
    "All",
    "Camping and hiking",
    "Headlamps and lighting",
    "Lanterns",
    "Electric and LED lanterns",
    "Volt Lantern"
  ],
  "description": "A compact lighting solution that pulls triple-duty as a lantern, a flashlight and a powerbank. Versatility is a wonderful thing when space is at a premium. With its compact design providing both a wide even light – that works well around camp, and a focused beam – that lets you put the light exactly where you want it, it is easy to make room for the Volt. Lighting isn’t the only way the Volt gives you options, this little lantern can be powered by its USB chargeable battery, or by 3 AAs. An integrated USB power port even let’s you use the internal battery to charge your USB-powered devices.LEDs tucked behind a frosted globe provides up to 200 lumens of even lighting, great around camp or power outages.1 LED flashlight produces a focused beam, great when you need to see things that are a bit further away.Smooth dimming feature lets you dial in the perfect brightness for both the lantern and the flashlight.1-button interface is easy to use.USB recharging makes it easy to charge your light’s internal battery or use 3 AA batteries when you are away from the convenience of USB ports.USB type-A power port lets you top up your USB powered devices from the internal battery pack.AA batteries are easy to find almost anywhere in the world.Collapsible hanging hook tucks out of the way when you don’t need it and is there when you do need it.Textured case is easy to hold on to in nearly any conditions.IPX4 waterproofing keeps your light shining in heavy downpours, sleet, snow or pretty much any condition that is less than ideal.Multiple setting, 3-level LED power meter lets you know how your batteries are doing both in use and when charging.Lock-out mode prevents accidental activation, so you don’t pull out a dead lantern when you need it.Dimensions: 8 x 3 x 10 cm.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9060416946206/6005158-GRA00.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9060416847902/6005158-DEN00.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9060416946206/6005158-GRA00.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9060416847902/6005158-DEN00.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9060416946206/6005158-GRA00.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9060416847902/6005158-DEN00.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9060416946206/6005158-GRA00.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9060416847902/6005158-DEN00.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Black Diamond Volt Lantern",
  "product_code": "6005-158",
  "source_url": "https://www.mec.ca/en/product/6005-158/Volt-Lantern",
  "tech_specs": {
    "Batteries": [
      "Lithium-ion 2600mAh (included)"
    ],
    "Glass globe": [
      "No"
    ],
    "Ideal for": [
      "Backpacking"
    ],
    "Made in": [
      "China"
    ],
    "Max light output\n\nThe total quantity of light emitted in every direction from a source of light; measured in lumens.": [
      "200 lumens"
    ],
    "Product sustainability": [
      "Rechargeable batteries"
    ],
    "Rechargeability\n\nRechargeable lights give you hassle-free recharging with almost any power source. Replaceable batteries provide instant power, but you’ll need to bring extra batteries, recycle used ones and buy new ones.": [
      "Rechargeable"
    ],
    "Red light mode": [
      "No"
    ],
    "Regulated output\n\nOn regulated lights brightness is consistent, and does not decrease gradually as the batteries are drained.": [
      "No"
    ],
    "Weight": [
      "224g"
    ]
  }
}