{
  "categories": [
    "Home",
    "All",
    "Camping and hiking",
    "Electronics",
    "GPS Navigation",
    "Handheld GPS",
    "GPSMAP 66i GPS"
  ],
  "description": "Smartphone convenience in a rugged package, ready for life’s adventures, and misadventures. The 66i merges Garmin’s background in handheld GPS, with their inReach satellite communication, blending these technologies into a compact device for navigation and communication way, way off-grid. The Iridium satellite network lets you send and receive text messages and emails anywhere on the planet (subscription required). Each message contains your GPS location data, so followers can track your adventures. If things take a turn for the worse, a dedicated SOS button means that help is never out of range. Preloaded with TOPO maps for Canada and the US, the 66i helps smooth out bumps in backcountry navigation, and you can plan your trip on a computer or phone with the free Garmin Explore™ app. Use Explore to map your adventure then send your planned routes and tracks to your 66i, no cell network required. Explore is not the only app that makes life with the 66i better, the free Connect™ app works with your smartphone and opens up a whole new side of the 66i. Connect lets you review activities, set-up live tracking sessions, monitor weather, review satellite imagery, receive notifications and more.Preloaded with Canadian and US topographical maps.BirdsEye Satellite Imagery allows you to download detailed satellite images (over Wi-Fi or cellular) right onto your 66i (no subscription required).Garmin Explore website and app let you synch routes, tracks and waypoints to your device. You can download map data to your phone and use your phone to plan routes and tracks, and then send those plans to your 66i, all without cell reception.LiveTrack™ (through a connected smartphone) and MapShare® (through your Iridium subscription) allows you to share your location and more, with friends, family, or followers.World SOS coverage that gives you a confirmation message from the rescue centre, letting you know help is on the way. 2-way texting allows you to stay in contact with rescue personnel.SOS messages are received by GEOS, a worldwide emergency response center with 24/7/365 staffing.SOS button has a hard-plastic cover, to prevent an accidental activation.Uses Iridium’s constellation of 66 satellites for coverage of the earth's entire surface. Messages are buffered for up to a day.Iridium’s worldwide coverage lets you send texts and emails from anywhere in the world, how many you send and how detailed they are, depends on what level plan you have.Messages have your GPS location embedded, letting your rescuers, friends, family or followers know exactly where you are.SOS/PLB functionality and all off-grid communication requires a separate satellite plan to activate, GPS functionality works all the time, no plan required.Monthly plans are available, as well as seasonal hibernation options that allow you to pay a minimal fee during months when you are not using the device.Active weather provides real-time radar tracking, via a connected smartphone running Garmin Connect. When not connected to your phone’s cellular network, detailed weather forecasts for your location, a specific waypoint, or a GPS coordinate, can be accessed via your Iridium satellite plan.Free Garmin Connect mobile app allows you to customize your 66i experience, choosing which widgets to show and when, reviewing stored activity data, selecting which apps can push notifications, loading and synching geocaching data and more.Smart notifications (emails, texts, alerts, etc.) come in via Bluetooth connection to your smartphone.Connect IQ support allows you to download apps, templates, data fields and other features.Preloaded with a free trial of the Wikiloc app, that has more than 9 million trails available.Connects to GPS and Galileo satellite constellations for fast signal acquisition and a strong connection nearly anywhere.Satellite caching allows your 66i to save an extended predicted orbit path (EPO) file, this way it knows where to look for satellites when you turn it on, meaning a fast and accurate satellite signal.Bluetooth Smart, ANT+ and Wi-Fi compatibility let you explore smarter with compatible activity sensors and accessories.Barometric altimeter helps you track your ascents, descents and total elevation changes.Tilt compensated 3-axis electronic compass shows your heading even when you are stationary, ensuring that you are always facing the right direction.Rechargeable internal battery pack delivers up to 35 hours of battery life with 10-minute logging, or 200 hours with 30-minute logging.Large 3 in. screen is bright and clear making it easy to read in all conditions, even direct sun.16GB of internal memory can be increased via MicroSD cards (not included).IPX7 waterproofing protects your 66i from even the heaviest downpours.Built-in LED flashlight helps you get back safe if you get caught out after dark, there is even an S.O.S. mode should things take turn for the worse.In the box: GPSMAP 66i preloaded with TOPO Canada and US maps, BirdsEye satellite imagery access (no subscription required), USB cable, carabiner clip and documentation.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9037373308958/6005195-NOC02.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9037755580446/6005195-NOC02-ALT-LEFT.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9037755678750/6005195-NOC02-ALT-TOPO.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9037755777054/6005195-NOC02-ALT-RIGHT.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9037756006430/6005195-NOC02-ALT-TEXT.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9037756137502/6005195-NOC02-ALT-NAVIGATION.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9037373308958/6005195-NOC02.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9037755580446/6005195-NOC02-ALT-LEFT.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9037755678750/6005195-NOC02-ALT-TOPO.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9037755777054/6005195-NOC02-ALT-RIGHT.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9037756006430/6005195-NOC02-ALT-TEXT.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9037756137502/6005195-NOC02-ALT-NAVIGATION.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9037373308958/6005195-NOC02.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9037755580446/6005195-NOC02-ALT-LEFT.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9037755678750/6005195-NOC02-ALT-TOPO.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9037755777054/6005195-NOC02-ALT-RIGHT.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9037756006430/6005195-NOC02-ALT-TEXT.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9037756137502/6005195-NOC02-ALT-NAVIGATION.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9037373308958/6005195-NOC02.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9037755580446/6005195-NOC02-ALT-LEFT.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9037755678750/6005195-NOC02-ALT-TOPO.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9037755777054/6005195-NOC02-ALT-RIGHT.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9037756006430/6005195-NOC02-ALT-TEXT.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9037756137502/6005195-NOC02-ALT-NAVIGATION.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Garmin GPSMAP 66i GPS",
  "product_code": "6005-195",
  "source_url": "https://www.mec.ca/en/product/6005-195/GPSMAP-66i-GPS",
  "tech_specs": {
    "ANT+ compatible\n\nEnsures seamless digital wireless communication between ANT+ devices. For example, data from an ultra-low power wireless sensor can be displayed on a bike computer or smartphone, then downloaded to a PC, etc.": [
      "Yes"
    ],
    "Add maps capability\n\nThese units allow you to add maps, so you can mark and name waypoints and create routes on your PC, and then upload the map of your choice to your GPS.": [
      "Yes"
    ],
    "App compatibility\n\nAn online community where members upload, analyze and share activity data.": [
      "Garmin Explore"
    ],
    "Area calculation": [
      "Yes"
    ],
    "Auto pause\n\nAutomatically pauses timer when you stop or go below a specified pace.": [
      "No"
    ],
    "Barometric altimeter\n\nBarometer function helps forecast weather trends. An altimeter can provide one line of position for location on a topo map, useful if the GPS isn't working.": [
      "Yes"
    ],
    "Basemap\n\nA basic set of map data that is included with the GPS. Basemap detail may vary from unit to unit.": [
      "Yes"
    ],
    "Batteries": [
      "Lithium-ion (included)"
    ],
    "Battery life": [
      "35-200 h"
    ],
    "Battery power indicator": [
      "Yes"
    ],
    "Bluetooth": [
      "Yes"
    ],
    "Built-in memory": [
      "16GB"
    ],
    "Button lock": [
      "Yes"
    ],
    "Calorie consumption\n\nCalculated based on data from a heart rate monitor.": [
      "No"
    ],
    "Calories in real time\n\nDisplays calorie expenditure during activity, based on heart rate monitor data.": [
      "No"
    ],
    "Chest strap": [
      "Sold separately"
    ],
    "Coded signal\n\nA coded instrument ensures no interference between your chest strap and your watch, necessary if you are training in busy gyms or trails where other signals may be encountered.": [
      "Yes"
    ],
    "Countdown timer": [
      "Yes"
    ],
    "Custom POI\n\nA POI (point of interest) is a specific location that someone may find interesting (i.e., favourite viewpoint, best coffee stop before the trailhead). The custom POI feature allows the user to load only the POI's that interest them onto their GPS unit.": [
      "Yes"
    ],
    "Data card": [
      "microSD card (not included)"
    ],
    "Dimensions": [
      "16.3 x 6.6 x 3.5cm"
    ],
    "Display dimensions": [
      "6.3 x 3.8cm"
    ],
    "Distance/time alarm": [
      "No"
    ],
    "Electronic compass\n\nAn electronic compass allows the user to view their heading in situations where they are either standing still or moving too slowly for the GPS to detect.": [
      "Yes"
    ],
    "Floats": [
      "No"
    ],
    "Foot pod\n\nAttaches to your shoe, captures your running data (i.e., pace, distance), and transmits it to your heart rate monitor or GPS.": [
      "Not compatible"
    ],
    "Haptic feedback": [
      "No"
    ],
    "Heart rate in real time\n\nDisplays beats per minute during activity.": [
      "No"
    ],
    "Heart rate monitor": [
      "Sold separately"
    ],
    "Heart rate target zones\n\nDisplays heart rate zones during activity.": [
      "No"
    ],
    "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": [
      "IP X7"
    ],
    "Ideal for": [
      "Emergency preparedness",
      "Backpacking",
      "Winter and expedition camping",
      "Alpine climbing and mountaineering"
    ],
    "Interface": [
      "USB",
      "NMEA 0183"
    ],
    "Interval training": [
      "No"
    ],
    "Low battery warning": [
      "Yes"
    ],
    "Made in": [
      "Taiwan"
    ],
    "Metric/imperial units format": [
      "Yes"
    ],
    "New lap auto start\n\nAutomatically triggers a new lap after reaching a specified difference.": [
      "Yes"
    ],
    "Pace alarm\n\nAn alarm that notifies you if you vary from a pre-set pace.": [
      "No"
    ],
    "Pause timer\n\nPauses the timer when slowing or stopping, and automatically resumes when moving again.": [
      "Yes"
    ],
    "Power meter\n\nDisplays output in watts as you ride.": [
      "Not compatible"
    ],
    "Programmable workouts\n\nWant an easy jog? A fast-paced ride? A workout with lots of variety to keep you on your toes? With programmable workouts you can tailor your training to match whatever you are looking for on a particular day.": [
      "No"
    ],
    "Routes": [
      "250"
    ],
    "Snooze": [
      "No"
    ],
    "Speed/cadence sensor\n\nMonitors pedalling cadence and measures pedalling strokes per minute.": [
      "Sold separately"
    ],
    "Stopwatch": [
      "Yes"
    ],
    "Tide tables": [
      "No"
    ],
    "Touch screen": [
      "No"
    ],
    "Track log": [
      "20,000 points, 250 saved tracks"
    ],
    "Unit to unit transfer\n\nShares data wirelessly between compatible units.": [
      "Yes"
    ],
    "Virtual partner\n\nAllows user to monitor training goals with either a virtual partner or alarms.": [
      "No"
    ],
    "Waypoints\n\nWaypoints consist of a standard set of coordinates (two for land, three for air or space) that identify a specific physical location. A route is navigated between two or more waypoints.": [
      "10,000"
    ],
    "Weight": [
      "241g"
    ],
    "WiFi": [
      "Yes"
    ],
    "Wireless sync": [
      "Yes"
    ],
    "Workout history": [
      "Yes"
    ]
  }
}