{
  "categories": [
    "Home",
    "All",
    "Cycling",
    "Bike accessories",
    "Bike lights",
    "Front bike lights",
    "Plus Twinpack Light Set"
  ],
  "description": "This set of super-bright lights lets you add a lot of visibility without adding a lot of weight. With USB charging and 5 different modes, it's a worthwhile addition to your kit. Knog developed a clever magnetic mount that lets you swap your Plus light from your bike to you, or just off your bike with a click. An integrated clip lets you attach the lights to you clothing or your 4-legged friend on low-light outings.  Weighing in at a paltry 12 grams a piece these little lights won’t slow you down or tug at your kit.Magnetic mount lets you attach your light to the bike mount base with little more than a magnetic click. Mount base includes multiple different sized o-rings for mounting to bars, posts, stays or even your helmet vents.Integrated clip lets you attach the lights to you, your pack, your pooch, really anything you want easily seen.5 different modes: steady, strobe, pulse, fancy flash and eco flash.Front light is 40 lumens and the rear light is 20 lumens.Waterproof design means that if you are willing to ride in it, the Plus will keep shining.Simple 1-button interface lets you cycle through modes with a short press or lock the light (so it won’t turn on in your bag) with a long press.Integrated USB plug (type-A) means you don’t need to tote around a cable to charge your light.Easy USB charging means there are no longer any reasons to have dim light.In the box: Plus Rear, Plust Front, 4x interchangeable straps for bars/seat posts 22-27mm / 28-32mm+ and 2x magnetic mount bases.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9044929740830/6006170-BK000.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9044929740830/6006170-BK000.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Knog Plus Twinpack Light Set",
  "product_code": "6006-170",
  "source_url": "https://www.mec.ca/en/product/6006-170/Plus-Twinpack-Light-Set",
  "tech_specs": {
    "Batteries": [
      "Li-polymer (included)"
    ],
    "Boost mode\n\nBriefly increases the light output to maximum brightness and distance.": [
      "No"
    ],
    "Burn Time - steady": [
      "2 h"
    ],
    "Burn time - flash": [
      "40-8.5 h"
    ],
    "Charge time\n\nThe amount of time it takes to fully charge the battery. Applies to lithium and NiMH type batteries. Does not apply to rechargeable or non-rechargeable AA or AAA batteries.": [
      "4 h"
    ],
    "Flash mode": [
      "Yes"
    ],
    "Helmet attachment\n\nIncludes a bracket or mounting system that attaches to most bike helmets.": [
      "Yes"
    ],
    "Ideal for": [
      "Sport road cycling",
      "Cycle commuting"
    ],
    "Included mounts": [
      "Horizontal mount",
      "Seat post mount"
    ],
    "Light modes\n\nThe number of lighting levels/modes the light has (i.e., low, med, high, flash).": [
      "5 modes"
    ],
    "Light source": [
      "LED"
    ],
    "Made in": [
      "China"
    ],
    "Max light output\n\nThe total quantity of light emitted in every direction from a source of light; measured in lumens.": [
      "40 lumens"
    ],
    "Product sustainability": [
      "Rechargeable batteries"
    ],
    "Rechargeability\n\nRechargeable lights give you hassle-free recharging with almost any power source. Replaceable batteries provide instant power, but you’ll need to bring extra batteries, recycle used ones and buy new ones.": [
      "Rechargeable"
    ],
    "Red light mode": [
      "Yes"
    ],
    "Regulated output\n\nOn regulated lights brightness is consistent, and does not decrease gradually as the batteries are drained.": [
      "No"
    ],
    "Type\n\nMost Canadian municipalities require a white front light and a red rear light.": [
      "Front",
      "Rear"
    ],
    "Weight": [
      "24g"
    ]
  }
}