{
  "categories": [
    "Home",
    "All",
    "Climbing",
    "Rock climbing",
    "Ropes, cords and slings",
    "Dynamic climbing ropes",
    "9.0 Crag Sender Dry Rope"
  ],
  "description": "A super light, triple certified rope for when every gram matters. With a soft hand and thin diameter, this rope is well suited to hard onsight attempts, tough redpoints and speedy alpine tours. For extended top-roping sessions you may want to choose a thicker, workhorse rope.Dry treatment on both sheath and core protects against water and dirt.Coated yarns allow individual fibres to glide over each other, reducing internal friction and fully utilizing each yarn when loaded, for extra durability.Comes lap-coiled by the factory, so ready to climb.High sheath percentage increases durability.\n\n        Sustainability\n\n\n\n\n\n\n\n\nBluesign\n\n\n\n\n\n\n\n\n\n\n\n                      Bluesign® Approved Material",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9110481338398/6007978-ISR07.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9110481338398/6007978-ISR07.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Mammut 9.0 Crag Sender Dry Rope",
  "product_code": "6007-978",
  "source_url": "https://www.mec.ca/en/product/6007-978/9-0-Crag-Sender-Dry-Rope",
  "tech_specs": {
    "Diameter": [
      "9.0mm"
    ],
    "Dynamic elongation\n\nMaximum elongation in the first UIAA test fall, where a weight is attached to the rope and then dropped. Higher numbers indicate stretchier ropes.": [
      "31%"
    ],
    "Halfway pattern change": [
      "No"
    ],
    "Ideal for": [
      "Rock climbing",
      "Snow and ice climbing"
    ],
    "Impact force\n\nThe amount of force, in kN, that the first UIAA fall puts on the falling object. Less impact force puts less force on the climber, belayer, and protection during a fall.": [
      "8.5kN"
    ],
    "Length": [
      "70m"
    ],
    "Linear weight": [
      "54g/m"
    ],
    "Made in": [
      "Czech Republic"
    ],
    "Product sustainability": [
      "Bluesign® Approved Material"
    ],
    "Static elongation\n\nIn controlled tests, a weight is suspended from the rope (not dropped). Higher numbers indicate stretchier ropes.": [
      "7.8%"
    ],
    "Treatment\n\nDry ropes have a water-resistant treatment on both core and sheath. Dry (UIAA certified) ropes have both core and sheath treated, plus meet the UIAA Water Repellent standard by passing a stringent test where a soaked rope cannot absorb more than 5% of the rope's weight.": [
      "Dry (UIAA certified)"
    ],
    "Type": [
      "Single (‹ 9.6mm)",
      "Half",
      "Twin"
    ],
    "UIAA fall rating\n\nIndicates the number of consecutive falls a rope withstood during testing in a controlled environment. The number is for reference only, and does not indicate the number of falls a rope will withstand during actual use or over its lifespan.": [
      "5-6"
    ],
    "Weight": [
      "3.78kg"
    ]
  }
}