{
  "categories": [
    "Home",
    "All",
    "Watersports",
    "PFDs, helmets and safety equipment",
    "Paddling helmets",
    "Strutter Helmet"
  ],
  "description": "An icon in the world of whitewater. This ultralight helmet takes inspiration from the classic baseball cap, delivering a brilliant balance of safety and style. Using a blended nylon-fiberflass shell, this helmet is low bulk with great elastic properties.Long fibre thermoplastic (LFT) shell combines polyamide and fiberglass for great elasticity and rigidity.EVA liner is crack resistant and absorbs shock from impacts without excess bulk.Occigrip dial lets you customize the height and reach of the helmet for a comfortable fit.Comfort pads are soft, anti-allergenic and moisture wicking.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9091431596062/6008565-DIB03.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9091431596062/6008565-DIB03.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "SWEET PROTECTION Strutter Helmet - Unisex",
  "product_code": "6008-565",
  "source_url": "https://www.mec.ca/en/product/6008-565/Strutter-Helmet",
  "tech_specs": {
    "Approved for\n\nMost helmets are tested and certified for a specific sport. Some helmets are approved for multi-sports, but only after passing the safety tests for both sports (i.e., snowsports and cycling).": [
      "Paddling"
    ],
    "Construction\n\nMicroshell helmets are made of a thin polymer sheet over a foam liner; Hardshell helmets have a hard polymer outer shell and a foam liner; when the liner is being bonded to the outer shell during the manufacturing process, it is Molded in the shell.": [
      "Hardshell"
    ],
    "Fit system": [
      "Adjustable dial",
      "Interchangeable foam pads"
    ],
    "Ideal for": [
      "Whitewater kayaking",
      "Whitewater canoeing"
    ],
    "Inner material": [
      "EVA"
    ],
    "Made in": [
      "China"
    ],
    "Safety rating\n\nCetification is established by a variety of governing bodies who set impact standards. Most helmets are certified or approved for a specific sport, except in the case of multi-sport helmets (i.e., a snowsports helmet might also be approved for cycling if it meets the cycling safety standards).": [
      "EN 1385"
    ],
    "Shell material": [
      "Carbon-reinforced plastic"
    ],
    "Weight": [
      "400g (Medium/Large)"
    ]
  }
}