{
  "categories": [
    "Home",
    "All",
    "Run and fitness",
    "Training food and drinks",
    "Energy and protein bars",
    "Peanut Butter Milk Chocolate Organic Cracker"
  ],
  "description": "Creamy organic peanut butter and honey sandwiched 2 hearty multigrain crackers and covered in a smooth milk chocolate for a hit of energy that isn’t just another bar. As a bonus, the milk chocolate coating helps prevent cracker breakage and excessive crumbs, functional chocolate, what a concept!Ingredients: organic milk chocolate (organic cane sugar, organic cocoa butter, organic whole milk, organic chocolate liquor, organic soy lecithin added as an emulsifier and organic vanilla), organic multi-grain cracker with sea salt (organic wheat flour, organic canola oil, organic cracked wheat, organic spelt, organic rye, organic barley, organic triticale, organic oats, organic flax, organic sesame seeds, organic sugar, sea salt and organic yeast), organic peanut butter (organic peanuts, organic palm oil and salt), organic honey.Allergens – contains: milk, soy, wheat and peanuts.Made in a facility that processes: egg, coconut and tree nuts.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9064366178334/6008764-NOC02.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9064366178334/6008764-NOC02.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Honey Stinger Peanut Butter Milk Chocolate Organic Cracker",
  "product_code": "6008-764",
  "source_url": "https://www.mec.ca/en/product/6008-764/Peanut-Butter-Milk-Chocolate-Organic-Cracker",
  "tech_specs": {
    "Best consumed": [
      "Before exercise",
      "Recovery"
    ],
    "Calories per serving": [
      "220Cal"
    ],
    "Carbohydrates": [
      "23g"
    ],
    "Cholesterol": [
      "4mg"
    ],
    "Dairy free": [
      "No"
    ],
    "Dietary fibre": [
      "2g"
    ],
    "Gluten free\n\nMade with gluten-free ingredients, but not necessarily in a guaranteed gluten-free environment.": [
      "No"
    ],
    "Ideal for": [
      "Camping and hiking"
    ],
    "Made in": [
      "USA"
    ],
    "Nut free\n\nThis product is nut free and is produced in a nut free environment.": [
      "No"
    ],
    "Protein": [
      "5g"
    ],
    "Saturated fat": [
      "5g"
    ],
    "Serving size": [
      "1 bar"
    ],
    "Servings": [
      "1"
    ],
    "Sodium": [
      "125mg"
    ],
    "Soy free": [
      "No"
    ],
    "Sugar": [
      "11g"
    ],
    "Total fat": [
      "12g"
    ],
    "Vegan\n\nThis product does not contain animal products or by-products.": [
      "No"
    ],
    "Vegetarian\n\nDoes not contain animal products but may contain dairy or egg products.": [
      "Yes"
    ],
    "Weight": [
      "42g"
    ]
  }
}