{
  "categories": [
    "Home",
    "All",
    "Ski and snowboard gear",
    "Backcountry skiing gear",
    "Backcountry ski boots",
    "Shift Pro 90 AT Ski Boots"
  ],
  "description": "Power and stability meet versatililty, these boots shift from in bounds groomers to backcountry tours with ease. The highly customizable Custom Shell HD and liner can be thermo-moulded to fit your foot perfectly. The GripWalk soles and Surelock mechanism provide traction and range of motion when in walk mode.Polyurethane shell with fibreglass framing transfers power efficiently to your ski.Coreframe and Sensifit inserts add power and easy step-in.Cuff is Polyolefin and polyamide for stability and ideal flex.Shell and seamless liner can be thermo-moulded for personalized performance.Women's specific cuff and liner are tailored to female anatomy.4 aluminum micro-adjust buckles secure your foot in a snug fit.35 mm strap adds extra support at the top of the cuff.Adjustable flex lets you tweak the boot's stiffness.Oversized pivot transfers power smoothly.Grip Walk soles allow nearly-normal walking with a rockered design.Compatible with tech bindings, WTR bindings, GripWalk bindings and MNC bindings.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132496453662/6010974-BBU01.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132496453662/6010974-BBU01.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132496453662/6010974-BBU01.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132496453662/6010974-BBU01.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Salomon Shift Pro 90 AT Ski Boots - Women's",
  "product_code": "6010-974",
  "source_url": "https://www.mec.ca/en/product/6010-974/Shift-Pro-90-AT-Ski-Boots",
  "tech_specs": {
    "Boot/binding compatibility\n\nThe boot and binding systems must match for best performance and safe use.": [
      "GripWalk",
      "Alpine touring",
      "Alpine touring (WTR)",
      "Tech"
    ],
    "Buckles": [
      "4"
    ],
    "Flex index\n\nIndicates how stiff the boots are when flexed forward.  Flex ranges from 50 (soft) to 130 (very stiff). Note: There is currently no industry standardized test.": [
      "90"
    ],
    "Hike mode\n\nA mechanism that allows to release the boot cuff to switch to tour mode.": [
      "Yes"
    ],
    "Ideal for": [
      "Freeride and freeskiing",
      "Alpine touring",
      "Downhill skiing"
    ],
    "Lace-up option": [
      "Yes"
    ],
    "Last width\n\nThe width of the interior of the boot shell across the widest part of the forefoot.": [
      "100mm"
    ],
    "Lower shell material": [
      "Polyurethane",
      "Fibreglass"
    ],
    "Made in": [
      "Romania"
    ],
    "Shell cuff material": [
      "Polypropylene",
      "Polyamide"
    ],
    "Sole type\n\nAlpine Touring: with tread; compatible with DIN touring bindings. Alpine Touring Tech (Tech): with tread; compatible with G3 Onyx and Dynafit. Downhill: without tread; compatible with freeride/downhill bindings.": [
      "GripWalk",
      "Tech"
    ],
    "Thermoformable inner boot": [
      "Yes"
    ],
    "Weight": [
      "3.2kg (24.5)"
    ]
  }
}