{
  "categories": [
    "Home",
    "All",
    "Cycling",
    "Bike accessories",
    "Bike lights",
    "Bike light sets",
    "Mid Cobber Twinpack Light Set"
  ],
  "description": "When Knog first wanted to build the Cobber line, 18 factories told them it couldn’t be done, Knog persisted and the result is dazzling. Using chip on board (COB) LEDs the Cobber line creates a wall of light, like a screen, but way brighter. This set adds a lot of visibility without adding a lot of weight, only 39 grams per light. With USB charging and multiple modes, it's a worthwhile addition to your kit.330° viewing angle keeps you seen.Efficient COB LEDs maintain brightness for up to 90% of the battery’s capacity.Magnetic mount lets you attach your light to the base with little more than a magnetic click.Mount base includes multiple different sized o-rings for mounting to bars, posts, stays, or even your head tube (up to 20cm circumference).Free ModeMaker app lets you customize your light’s modes.8 different modes including: steady (high and low), pulse, flash (standard, rolling, side, disco and eco).Front light is 320 lumens and the rear light is 170 lumens.IP67 waterproof design means that if you are willing to ride in it, the Cobber will keep shining.Simple 1-button interface lets you cycle through modes with a short press or lock the light (so it won’t turn on in your bag) with a long press.Integrated USB plug (type-A) means you don’t need to tote around a cable to charge your light.LED battery status light lets you know when it’s time to charge.Easy USB charging means there are no longer any reasons to have dim light.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9145385123870/6011488-BK000.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9145385123870/6011488-BK000.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Knog Mid Cobber Twinpack Light Set",
  "product_code": "6011-488",
  "source_url": "https://www.mec.ca/en/product/6011-488/Mid-Cobber-Twinpack-Light-Set",
  "tech_specs": {
    "Batteries": [
      "Li-polymer (included)"
    ],
    "Boost mode\n\nBriefly increases the light output to maximum brightness and distance.": [
      "No"
    ],
    "Burn Time - steady": [
      "2-5 h"
    ],
    "Burn time - flash": [
      "2-120 h"
    ],
    "Charge time\n\nThe amount of time it takes to fully charge the battery. Applies to lithium and NiMH type batteries. Does not apply to rechargeable or non-rechargeable AA or AAA batteries.": [
      "4 h"
    ],
    "Flash mode": [
      "Yes"
    ],
    "Helmet attachment\n\nIncludes a bracket or mounting system that attaches to most bike helmets.": [
      "No"
    ],
    "Ideal for": [
      "Sport road cycling",
      "Cycle commuting"
    ],
    "Included mounts": [
      "Handlebar mount",
      "Vertical mount",
      "Seat post mount"
    ],
    "Light modes\n\nThe number of lighting levels/modes the light has (i.e., low, med, high, flash).": [
      "8 modes"
    ],
    "Light source": [
      "LED"
    ],
    "Made in": [
      "China"
    ],
    "Product sustainability": [
      "Rechargeable batteries"
    ],
    "Rechargeability\n\nRechargeable lights give you hassle-free recharging with almost any power source. Replaceable batteries provide instant power, but you’ll need to bring extra batteries, recycle used ones and buy new ones.": [
      "Rechargeable"
    ],
    "Red light mode": [
      "Yes"
    ],
    "Regulated output\n\nOn regulated lights brightness is consistent, and does not decrease gradually as the batteries are drained.": [
      "Yes"
    ],
    "Type\n\nMost Canadian municipalities require a white front light and a red rear light.": [
      "Front",
      "Rear"
    ],
    "Weight": [
      "78g"
    ]
  }
}