{
  "categories": [
    "Home",
    "All",
    "Run and fitness",
    "Training electronics",
    "Heart rate monitor sensor straps",
    "TICKR X 2 ANT+/Blue Tooth Heart Rate Monitor"
  ],
  "description": "Streamline your workouts and just focus on your training. Store up to 50 hours of workout data, and leave the phone, watch, or GPS behind. An internal accelerometer provides running metrics like cadence and running smoothness.Internal accelerometer measures running cadence, vertical oscillation, ground contact time, stride rate and distance, plus tracks cycle trainer cadence.Memory stores up to 50 hours of heart rate and calorie data, (data is synched when in range of your phone). When used with the app, you can access your running dynamics.Running dynamics works with Garmin® products.Customizable double-tap function words with Wahoo app to set functions with a quick tap of your TICKR X.Top-mounted LEDs: blue indicates connection, red confirms heart rate reading.Connects over ANT+ (unlimited connections at the same time) and Bluetooth™ Smart (up to 3 Bluetooth connections at the same time).Works seamlessly with 50+ fitness apps, including: Zwift, The Sufferfest, Peloton for cycling and Runkeeper and MapMyRun for running.Replaceable coin cell battery (CR2032) lasts over 500 active hours.IPX7 waterproofing sheds heavy rain.In the box: TICKRX heart rate monitor, adjustable soft strap, quick start guide.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132498190366/6011923-WHT00.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132498190366/6011923-WHT00.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Wahoo Fitness TICKR X 2 ANT+/Blue Tooth Heart Rate Monitor",
  "product_code": "6011-923",
  "source_url": "https://www.mec.ca/en/product/6011-923/TICKR-X-2-ANT%2B-Blue-Tooth-Heart-Rate-Monitor",
  "tech_specs": {
    "ANT+ compatible\n\nEnsures seamless digital wireless communication between ANT+ devices. For example, data from an ultra-low power wireless sensor can be displayed on a bike computer or smartphone, then downloaded to a PC, etc.": [
      "Yes"
    ],
    "Bluetooth": [
      "Yes"
    ],
    "Ideal for": [
      "Running",
      "Fitness and training",
      "Cycle training"
    ],
    "Made in": [
      "Taiwan"
    ],
    "Product sustainability": [
      "Rechargeable batteries"
    ],
    "Weight": [
      "48g"
    ]
  }
}