{
  "categories": [
    "Home",
    "All",
    "Ski and snowboard gear",
    "Downhill skiing gear",
    "Downhill ski boots",
    "Panterra 130 I.D. Gw Boots"
  ],
  "description": "Wherever your powder-seeking soul takes you, these stiff performance boots want to go too. The Irfran polymer shell provides shock absorption and vibration dampening for extended shredding, booting and more shredding. Ready to shred right out of the box, the liners gradually conform to the contours of your foot, or you can heat-mould them for a lived-in feel on day 1.Cabrio 3-piece shell offers uniform flex and support.MyFit system allows custom moulding of the shell and ID Max Hike liners for optimal fit and performance.Compact ski/hike mechanism combines hike mode with solid and powerful control in ski mode.Forefoot volume can be adjusted with the 4th buckle to match your feet.Adjustable rear spoiler allows you to tweak the forward lean and rear support.GripWalk soles allow nearly-normal walking with a rockered design.Replaceable soles and toe and heel protectors for years of use.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9136446373918/6011610-BL012.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9136446373918/6011610-BL012.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Dalbello Panterra 130 I.D. Gw Boots - Unisex",
  "product_code": "6011-610",
  "source_url": "https://www.mec.ca/en/product/6011-610/Panterra-130-I-D-Gw-Boots",
  "tech_specs": {
    "Boot/binding compatibility\n\nThe boot and binding systems must match for best performance and safe use.": [
      "GripWalk",
      "Alpine touring",
      "Alpine touring (WTR)"
    ],
    "Buckles": [
      "4"
    ],
    "Flex index\n\nIndicates how stiff the boots are when flexed forward.  Flex ranges from 50 (soft) to 130 (very stiff). Note: There is currently no industry standardized test.": [
      "130"
    ],
    "Hike mode\n\nA mechanism that allows to release the boot cuff to switch to tour mode.": [
      "Yes"
    ],
    "Ideal for": [
      "Downhill skiing",
      "Freeride and freeskiing"
    ],
    "Lace-up option": [
      "Yes"
    ],
    "Last width\n\nThe width of the interior of the boot shell across the widest part of the forefoot.": [
      "100-102mm"
    ],
    "Made in": [
      "Italy"
    ],
    "Range of motion\n\nThe range of motion of the boot when in hike mode.": [
      "51º"
    ],
    "Sole type\n\nAlpine Touring: with tread; compatible with DIN touring bindings. Alpine Touring Tech (Tech): with tread; compatible with G3 Onyx and Dynafit. Downhill: without tread; compatible with freeride/downhill bindings.": [
      "GripWalk"
    ],
    "Thermoformable inner boot": [
      "Yes"
    ],
    "Weight": [
      "3.38kg (25.5)"
    ]
  }
}