{
  "categories": [
    "Home",
    "All",
    "Camping and hiking",
    "Tools and accessories",
    "Binoculars and monoculars",
    "Papilio II 6.5x21 Binoculars"
  ],
  "description": "Near or far, these binoculars help bring everything into focus. As a traditional  and close-focusing binocular, with a focal range of just 50cm, the Papilio let you see things differently. Fun for kids to give them a bug’s eye view of the world around themWaterproof design isn’t bothered by a little rain.Multi-coated optics brighten up the image and increase contrast.Uni-body design adds durabilityAspherical lens elements provide edge-to-edge sharpness.Adjustable eye-cups work with glasses.Includes lens covers, a neck strap and case.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9134136328222/6011802-GRY00.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9134136328222/6011802-GRY00.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Pentax Papilio II 6.5x21 Binoculars",
  "product_code": "6011-802",
  "source_url": "https://www.mec.ca/en/product/6011-802/Papilio-II-6-5x21-Binoculars",
  "tech_specs": {
    "Dimensions": [
      "11 x 5 x 11cm"
    ],
    "Diopter adjustment\n\nThese binoculars can be adjusted for variances between right and left eye vision.": [
      "Yes"
    ],
    "Dust proof": [
      "No"
    ],
    "Exit pupil\n\nThe diameter of the objective (outside) lens divided by the binocular's magnification. It indicates the amount of light that reaches your eye (most noticeable in low light conditions). Higher numbers offer brighter images.": [
      "3.2mm"
    ],
    "Eye relief\n\nThe distance between the eyepiece and your eye while still allowing entire field of view. Long eye relief is good for eyeglass wearers.": [
      "15mm"
    ],
    "Field of view\n\nThe widest dimension of circular viewing area that you can see.": [
      "131m"
    ],
    "Fogproof": [
      "Yes"
    ],
    "Ideal for": [
      "Everyday use",
      "Travel"
    ],
    "Includes case": [
      "Yes"
    ],
    "Lens coating\n\nLens coatings reduce light loss and glare to increase contrast and diminish eyestrain. Coated: one layer on external surfaces only. Fully coated: every surface is coated. Multi-coated: multiple layers on some of the surfaces. Fully multi-coated: multiple layers on every optical surface.": [
      "Fully multi-coated"
    ],
    "Made in": [
      "China"
    ],
    "Magnification\n\nThis tells you how many times an object is magnified when observed through the binoculars.": [
      "6.5"
    ],
    "Minimum focus\n\nThe nearest distance at which the binoculars will focus on an object.": [
      "50cm"
    ],
    "Objective lens\n\nThe diameter of the objective lens will impact how bright, sharp, and comfortable your view is. Generally, bigger is better.": [
      "21mm"
    ],
    "Relative brightness\n\nA measure of image brightness. The greater the realtive brightness number the better the binoculars will perform in dim light.": [
      "10.2"
    ],
    "Waterproof\n\nWaterproof binoculars are assembled with O-rings and are purged with nitrogen to avoid condensation. They are ideal for boating or use in rainy weather.": [
      "Yes"
    ],
    "Weight": [
      "289g"
    ]
  }
}