{
  "categories": [
    "Home",
    "All",
    "Camping and hiking",
    "Electronics",
    "Watches",
    "Altimeter barometer watches",
    "Instinct Solar"
  ],
  "description": "Garmin honed the Instinct, added a solar panel, new GPS and upgraded optical heart rate sensor. Tap into the power of the sun, to power through any adventure with potentially infinite battery life. By connecting to multiple satellite networks and caching last known satellite positions you get a fast connection and a strong GPS signal. The GPS nearly doubles the watch’s battery life and navigation tools let you save coordinates, follow courses created in Garmin Connect™, or just find your way back to the car. GPS data combined with accelerometer data gives you training metrics like speed and distance.Power Glass™ solar panel lets you go longer between charges, 8 hours to 48 days longer – runtime is feature dependent.Sun gauge displays solar charge and daily sun exposure.Connects to GPS, GLONASS and Galileo satellite constellations.Satellite caching saves satellite data, for fast, accurate satellite signal in any terrain.Tilt compensated 3-axis electronic compass shows your heading even when you are stationary, ensuring that you are always facing the right direction.Barometric altimeter tracks ascents, descents and total elevation changes.Storm alarm tracks pressure changes and alerts you when it’s time to find shelter. Extended weather data can also come in via the connection to your smartphone.Power manager uses pre-set and custom power profiles to balance battery life and GPS accuracy.Battery saver mode offers almost unlimited battery life, with solar power and limiting functionality.Built-in activity modes for hiking, biking, running, strength training (with rep counter), walking, swimming (indoor only) and more.Pre-loaded and customizable workouts, you can even race past activities.Move IQ detects and tracks activity; it appears in your Connect timeline to credit all your daily exercise.Course navigation, via created or downloaded courses.Breadcrumb trails track your trek, navigate you to a saved location or entered coordinate (there are no maps for routing), or navigate you on the trail you took back to where you started.Internet Live Tracking during activities (through a connected smartphone) allows you to share your location and heart rate with friends, family, or coaches.Elevate™ V3 optical heart rate monitor has a red LED for Pulse Ox data and even works while swimming.Broadcast of your HR over ANT+ (so other devices can pick it up).Body Battery™ tracks daily energy levels, monitoring what drains your energy (exercise) and recharges your energy (rest, food), letting you train smarter.24/7 activity tracking, Instinct learns your activity level and helps guide you towards a more active lifestyle.Sleep tracking mode monitors rest, periods of movement and restful sleep in your Connect profile.Counts flights of stairs with internal barometric altimeter data combined with step data.Weekly intensity minutes displayed against the ideal for health of 150.Automatically sync data to a smartphone running the Connect app.Smart notifications (emails, texts, alerts and more) via Bluetooth connection to a compatible smartphone.Connects with ANT+ and Bluetooth Smart sensors, from temperature pods, to speed and cadence pods.Customizable display lets you set-up your screen how you want it.Customizable button set-ups program “hot-keys”, setting long-presses for certain modes or actions.Rugged construction with MIL-STD-810G certification for thermal, shock and water resistance (100m).User-friendly strap changes (compatible with QuickFit bands).Fits wrist circumference of 132-224mm.Solar rechargeable lithium-ion battery lasts up to 38 hours in GPS mode, or 54 days as an activity tracking smartwatch, or indefinitely – with 3H of daily sun exposure.In the box: Instinct Solar, charging/data cable and documentation.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132302532638/6011865-GRA00.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132292309022/6011865-GRA00-ALT-BACK.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132292505630/6011865-GRA00-ALT-LEFT.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132292571166/6011865-GRA00-ALT-RIGHT.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132292603934/6011865-GRA00-ALT-SCREEN1.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132292669470/6011865-GRA00-ALT-SCREEN2.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132302532638/6011865-GRA00.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132292309022/6011865-GRA00-ALT-BACK.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132292505630/6011865-GRA00-ALT-LEFT.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132292571166/6011865-GRA00-ALT-RIGHT.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132292603934/6011865-GRA00-ALT-SCREEN1.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132292669470/6011865-GRA00-ALT-SCREEN2.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132302532638/6011865-GRA00.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132292309022/6011865-GRA00-ALT-BACK.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132292505630/6011865-GRA00-ALT-LEFT.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132292571166/6011865-GRA00-ALT-RIGHT.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132292603934/6011865-GRA00-ALT-SCREEN1.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132292669470/6011865-GRA00-ALT-SCREEN2.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132302532638/6011865-GRA00.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132292309022/6011865-GRA00-ALT-BACK.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132292505630/6011865-GRA00-ALT-LEFT.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132292571166/6011865-GRA00-ALT-RIGHT.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132292603934/6011865-GRA00-ALT-SCREEN1.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132292669470/6011865-GRA00-ALT-SCREEN2.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Garmin Instinct Solar - Unisex",
  "product_code": "6011-865",
  "source_url": "https://www.mec.ca/en/product/6011-865/Instinct-Solar",
  "tech_specs": {
    "12/24 hour format": [
      "Yes"
    ],
    "ANT+ compatible\n\nEnsures seamless digital wireless communication between ANT+ devices. For example, data from an ultra-low power wireless sensor can be displayed on a bike computer or smartphone, then downloaded to a PC, etc.": [
      "Yes"
    ],
    "Add maps capability\n\nThese units allow you to add maps, so you can mark and name waypoints and create routes on your PC, and then upload the map of your choice to your GPS.": [
      "No"
    ],
    "App compatibility\n\nAn online community where members upload, analyze and share activity data.": [
      "Garmin Connect",
      "Garmin Explore"
    ],
    "Area calculation": [
      "Yes"
    ],
    "Auto pause\n\nAutomatically pauses timer when you stop or go below a specified pace.": [
      "Yes"
    ],
    "Barometric altimeter\n\nBarometer function helps forecast weather trends. An altimeter can provide one line of position for location on a topo map, useful if the GPS isn't working.": [
      "Yes"
    ],
    "Basemap\n\nA basic set of map data that is included with the GPS. Basemap detail may vary from unit to unit.": [
      "No"
    ],
    "Batteries": [
      "Rechargeable battery pack (non-removable)"
    ],
    "Battery life": [
      "38 - 1632 h"
    ],
    "Battery power indicator": [
      "Yes"
    ],
    "Bluetooth": [
      "Yes"
    ],
    "Built-in memory": [
      "16GB"
    ],
    "Button lock": [
      "Yes"
    ],
    "Calorie consumption\n\nCalculated based on data from a heart rate monitor.": [
      "Yes"
    ],
    "Calories in real time\n\nDisplays calorie expenditure during activity, based on heart rate monitor data.": [
      "Yes"
    ],
    "Case diameter": [
      "45mm"
    ],
    "Chest strap": [
      "Sold separately"
    ],
    "Coded signal\n\nA coded instrument ensures no interference between your chest strap and your watch, necessary if you are training in busy gyms or trails where other signals may be encountered.": [
      "Yes"
    ],
    "Countdown timer": [
      "Yes"
    ],
    "Custom POI\n\nA POI (point of interest) is a specific location that someone may find interesting (i.e., favourite viewpoint, best coffee stop before the trailhead). The custom POI feature allows the user to load only the POI's that interest them onto their GPS unit.": [
      "Yes"
    ],
    "Data card": [
      "Not accepted"
    ],
    "Dimensions": [
      "4.5 x 4.5 x 1.5cm"
    ],
    "Display dimensions": [
      "2.3 x 2.3cm"
    ],
    "Distance/time alarm": [
      "Yes"
    ],
    "Electronic compass\n\nAn electronic compass allows the user to view their heading in situations where they are either standing still or moving too slowly for the GPS to detect.": [
      "Yes"
    ],
    "Face material\n\nPolycarbonate is inexpensive and light, with good clarity and wear-resistance. Mineral crystal glass offers greater clarity and significantly greater wear-resistance. Sapphire crystal is better still for clarity and wear-resistance.": [
      "Mineral crystal glass"
    ],
    "Foot pod\n\nAttaches to your shoe, captures your running data (i.e., pace, distance), and transmits it to your heart rate monitor or GPS.": [
      "Not compatible"
    ],
    "Haptic feedback": [
      "Yes"
    ],
    "Heart rate in real time\n\nDisplays beats per minute during activity.": [
      "Yes"
    ],
    "Heart rate monitor": [
      "Yes"
    ],
    "Heart rate target zones\n\nDisplays heart rate zones during activity.": [
      "Yes"
    ],
    "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": [
      "IP X8"
    ],
    "Ideal for": [
      "Running, fitness and training",
      "Swim training",
      "Camping and hiking"
    ],
    "Interface": [
      "USB",
      "Wireless"
    ],
    "Interval training": [
      "Yes"
    ],
    "Low battery warning": [
      "Yes"
    ],
    "Lug width": [
      "22mm"
    ],
    "Made in": [
      "Taiwan"
    ],
    "Metric/imperial units format": [
      "Yes"
    ],
    "New lap auto start\n\nAutomatically triggers a new lap after reaching a specified difference.": [
      "Yes"
    ],
    "Pace alarm\n\nAn alarm that notifies you if you vary from a pre-set pace.": [
      "Yes"
    ],
    "Pause timer\n\nPauses the timer when slowing or stopping, and automatically resumes when moving again.": [
      "Yes"
    ],
    "Power meter\n\nDisplays output in watts as you ride.": [
      "Not compatible"
    ],
    "Product sustainability": [
      "Rechargeable batteries"
    ],
    "Programmable workouts\n\nWant an easy jog? A fast-paced ride? A workout with lots of variety to keep you on your toes? With programmable workouts you can tailor your training to match whatever you are looking for on a particular day.": [
      "Basic"
    ],
    "Replaceable wrist strap": [
      "Yes"
    ],
    "Snooze": [
      "No"
    ],
    "Speed/cadence sensor\n\nMonitors pedalling cadence and measures pedalling strokes per minute.": [
      "Sold separately"
    ],
    "Stopwatch": [
      "Yes"
    ],
    "Tide tables": [
      "Yes"
    ],
    "Touch screen": [
      "No"
    ],
    "Unit to unit transfer\n\nShares data wirelessly between compatible units.": [
      "No"
    ],
    "Virtual partner\n\nAllows user to monitor training goals with either a virtual partner or alarms.": [
      "Yes"
    ],
    "Weight": [
      "53g"
    ],
    "WiFi": [
      "No"
    ],
    "Wireless sync": [
      "Yes"
    ],
    "Workout history": [
      "Yes"
    ],
    "Wrist strap material": [
      "Silicone"
    ]
  }
}