{
  "categories": [
    "Home",
    "All",
    "Ski and snowboard gear",
    "Backcountry skiing gear",
    "Backcountry ski boots",
    "TLT8 Expedition CR Ski Boots"
  ],
  "description": "Human skier with the soul of a jackrabbit? Sounds about right. For speed ascents and done-in-a-day traverses, this boot operates with absolute precision. With 60 degrees of walking motion, this boot flexes with comfort, letting you take longer strides for a faster ascent. A single buckle closes the cuff and locks the boot into ski mode at the same time. Efficient transitions, unparalleled walking comfort, and wicked ski performance...this boot does it all.Grilamid shell construction offers stability and rigidity without weight.Internal Grilamid spoiler stiffens boot while keeping the boot sleek on the outside.2 micro-adjust ratchet buckles with Ultra Lock strap for secure and comfortable closure.Ultra Lock 4.0 closes boot and moves to ski mode in one closure.Speed nose design increases pivot efficiency when climbing.Reduced outsole length to reduce weight.Compatible with tech bindings.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9136439066654/6011320-POS09.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9136439066654/6011320-POS09.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Dynafit TLT8 Expedition CR Ski Boots - Unisex",
  "product_code": "6011-320",
  "source_url": "https://www.mec.ca/en/product/6011-320/TLT8-Expedition-CR-Ski-Boots",
  "tech_specs": {
    "Boot/binding compatibility\n\nThe boot and binding systems must match for best performance and safe use.": [
      "Tech"
    ],
    "Buckles": [
      "2"
    ],
    "Forward lean\n\nForward lean affects a skiers balance. Some boots have a set forward lean angle; some are adjustable. Less lean places your knees in a more upright (almost standing) position, whereas more lean positions your knees forward over the ball of your feet.": [
      "15-18º"
    ],
    "Hike mode\n\nA mechanism that allows to release the boot cuff to switch to tour mode.": [
      "Yes"
    ],
    "Ideal for": [
      "Alpine touring"
    ],
    "Lace-up option": [
      "No"
    ],
    "Last width\n\nThe width of the interior of the boot shell across the widest part of the forefoot.": [
      "103mm"
    ],
    "Lower shell material": [
      "Grilamid"
    ],
    "Made in": [
      "Italy"
    ],
    "Range of motion\n\nThe range of motion of the boot when in hike mode.": [
      "60º"
    ],
    "Shell cuff material": [
      "Grilamid",
      "Fibreglass"
    ],
    "Sole type\n\nAlpine Touring: with tread; compatible with DIN touring bindings. Alpine Touring Tech (Tech): with tread; compatible with G3 Onyx and Dynafit. Downhill: without tread; compatible with freeride/downhill bindings.": [
      "Tech"
    ],
    "Thermoformable inner boot": [
      "Yes"
    ],
    "Weight": [
      "1.13kg (27.5)"
    ]
  }
}