{
  "categories": [
    "Home",
    "All",
    "Clothing",
    "Clothing accessories",
    "Sunglasses",
    "Casual sunglasses",
    "Kiva Sunglasses"
  ],
  "description": "When there’s nowhere to hide from the sun, these shades will keep your peepers safe. The Kiva are one of the largest frames Sunski makes, and big frames means big time coverage.Polarized lenses cut through reflections, great for use around water, snow, pavement and anywhere else glare lies in wait.Recycled plastic frames are strong and light.4-base curvature provides a subtle wrap.Packaging contains no single use plastic.Microfibre bag included.Sunski is part of 1% for the planet.Sunski found its inspiration from an Australian surf trip, with the goal of making quality sunnies affordable.Medium to large fit sunnies that work best on medium faces.\n\n        Sustainability\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                      Recycled content",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9163339268126/6012834-MCA23.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9163339268126/6012834-MCA23.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Sunski Kiva Sunglasses - Unisex",
  "product_code": "6012-834",
  "source_url": "https://www.mec.ca/en/product/6012-834/Kiva-Sunglasses",
  "tech_specs": {
    "100% UVA protected": [
      "Yes"
    ],
    "100% UVB protected": [
      "Yes"
    ],
    "Fits over most eyewear\n\nThese optics are designed to fit comfortably over most eyewear.": [
      "No"
    ],
    "Frame material\n\nTR90 thermoplastic offers good resistance to chemicals and torsion. Propionate is a light, nylon-based, hypoallergenic plastic that's very strong and offers more transparency and gloss than other plastics.": [
      "Polycarbonate"
    ],
    "Ideal for": [
      "Casual wear"
    ],
    "Interchangeable lenses\n\nInterchangeable lenses let you change lenses to suit differing light conditions or activities.": [
      "No"
    ],
    "Lens material": [
      "Polycarbonate"
    ],
    "Lens performance\n\nFixed tints provide a constant degree of darkness. Photochromic lenses adjust to changing light levels. Polarized lenses absorb horizontal reflected glare to improve clarity around surfaces like snow or water.": [
      "Fixed tint",
      "Polarized"
    ],
    "Lens width\n\nRefers to the horizontal width in millimeters of one of the frame's lenses.": [
      "57mm"
    ],
    "Made in": [
      "China"
    ],
    "Nose bridge width\n\nThe gap between the lenses, measured at the smallest point.": [
      "20mm"
    ],
    "Product sustainability": [
      "Recycled content"
    ],
    "Temple length\n\nThe length of an arm from tip to tip.": [
      "147mm"
    ],
    "Visible Light Transmission\n\n0-10% – very heavy tint, too dark for most needs. \n10-30% – heavy tint for bright sunny days.\n20-60% – light tint, great for cloudy, overcast conditions and shady trails. \n60-80% – very light tint (often coloured), for improving contrast in low-light conditions, think dawn or dusk. \n80-100% – little to no tint, this what you want in the dark.": [
      "15%"
    ]
  }
}