{
  "categories": [
    "Home",
    "All",
    "Camping and hiking",
    "Camping kitchen and hydration",
    "Food and drink",
    "Camping meals",
    "Southwestern Style Masa With Beef"
  ],
  "description": "Set up camp and sit down to a tasty and easy to prepare corn meal seasoned with southwestern style spices with beef, pinto and black beans, cheddar cheese, brown rice and vegetables.Packaging clearly shows allergens and nutritional information, and has a graduated scale on one side, so you know how much water to add.Ingredients: cornmeal, beef diced cooked freeze dried (beef, salt), sharp cheddar cheese powder (pasteurized milk, cheese cultures, salt, enzymes, disodium phosphate, annatto extract), long grain parboiled brown rice, tomato powder, tomato flakes, pinto bean flakes, black bean flakes, sweet corn, white onion, corn flakes, monterey chili powder (chili pepper, spices, salt, garlic), green chili pepper, sea salt, chicken flavor broth low sodium [maltodextrin, salt, torula yeast, dehydrated vegetables (onion, celery, parsley, spinach, garlic, carrot), potato flour, xanthan gum, spices, extractives of spice (including turmeric and paprika), soy lecithin.  not more than 2% soybean oil added as a processing aid], garlic granulated, black pepper, cilantro, jalapeno.Allergens: contains soy and milk.No cooking needed, simply add water, stir, wait and enjoy.Meals have a 5-year shelf life.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9182662131742/6013202-NOC02.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9182662131742/6013202-NOC02.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "AlpineAire Southwestern Style Masa With Beef",
  "product_code": "6013-202",
  "source_url": "https://www.mec.ca/en/product/6013-202/Southwestern-Style-Masa-With-Beef",
  "tech_specs": {
    "Calories per serving": [
      "330Cal"
    ],
    "Carbohydrates": [
      "46g"
    ],
    "Cholesterol": [
      "35mg"
    ],
    "Cook in package\n\nThe food can be cooked simply by adding hot water into the sealable package.": [
      "Yes"
    ],
    "Dairy free": [
      "No"
    ],
    "Dietary fibre": [
      "6g"
    ],
    "Gluten free\n\nMade with gluten-free ingredients, but not necessarily in a guaranteed gluten-free environment.": [
      "Yes"
    ],
    "Ideal for": [
      "Backpacking",
      "Winter and expedition camping",
      "Emergency preparedness"
    ],
    "Made in": [
      "USA"
    ],
    "Nut free\n\nThis product is nut free and is produced in a nut free environment.": [
      "No"
    ],
    "Protein": [
      "20g"
    ],
    "Saturated fat": [
      "4g"
    ],
    "Serving size": [
      "1/2 package"
    ],
    "Servings": [
      "2"
    ],
    "Sodium": [
      "770mg"
    ],
    "Soy free": [
      "No"
    ],
    "Sugar": [
      "10g"
    ],
    "Total fat": [
      "8g"
    ],
    "Vegan\n\nThis product does not contain animal products or by-products.": [
      "No"
    ],
    "Vegetarian\n\nDoes not contain animal products but may contain dairy or egg products.": [
      "No"
    ],
    "Weight": [
      "170g"
    ]
  }
}