{
  "categories": [
    "Home",
    "All",
    "Camping and hiking",
    "Electronics",
    "GPS Navigation",
    "Handheld GPS",
    "GPSMAP 65"
  ],
  "description": "Whether you find yourself in canyons of glass and steel, or granite and conifers, this multiband GPS knows exactly where you are. Updated with multiband GNSS technology for more satellites, faster signals and more accurate positioning data, all over the globe.Multiband signal reception and expanded GNSS support (GPS, GLONASS, Galileo, QZSS and IRNSS) provide faster and more accurate positioning and elevation data, anywhere in the world.Preloaded with routable TopoActive maps (Canada and US 100K resolution), featuring streets and trails, making front-country or backcountry navigation a lot easier.Point of interest navigation lets you search for places you may want to go, e.g restaurants, attractions, accommodation, etc.LiveTrack™ during activities (through a connected phone) to share your location, speed and more with friends, family or followers.Bluetooth Smart and ANT+ compatibility lets you explore smarter with compatible activity sensors and accessories.Garmin Explore™ website and app let you sync routes, tracks and waypoints to your device. You can download map data to your phone, use your phone to plan routes and tracks, and then send those plans to your GPS, all without cell reception.Free Garmin Connect™ mobile app allows you to customize your GPS experience, reviewing stored activity data, selecting which apps can push notifications, loading and synching geocaching data and more.Share your favourite hikes, fishing holes and view points wirelessly with other compatible devices.Paperless geocaching compatible, download GPX files from your favourite geocaching site right to your device.2 AA batteries run for 16 hours. And, as the AA is the world’s most common battery it is easy to keep your GPS up and running nearly anywhere.Large 6.6cm screen is bright and clear making it easy to read in all conditions, even direct sun.16GB of internal memory can be increased via a MicroSD cards – up to 32GB cards (not included).IPX7 waterproofing protects your 64-series from even the heaviest downpours.In the box: GPSMAP 65, USB cable, carabiner clip and documentation.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9157857312798/6013100-BK764.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9152258277406/6013100-BK764-ALT-NAV.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9157857312798/6013100-BK764.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9152258277406/6013100-BK764-ALT-NAV.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9157857312798/6013100-BK764.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9152258277406/6013100-BK764-ALT-NAV.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9157857312798/6013100-BK764.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9152258277406/6013100-BK764-ALT-NAV.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Garmin GPSMAP 65",
  "product_code": "6013-100",
  "source_url": "https://www.mec.ca/en/product/6013-100/GPSMAP-65",
  "tech_specs": {
    "ANT+ compatible\n\nEnsures seamless digital wireless communication between ANT+ devices. For example, data from an ultra-low power wireless sensor can be displayed on a bike computer or smartphone, then downloaded to a PC, etc.": [
      "Yes"
    ],
    "Add maps capability\n\nThese units allow you to add maps, so you can mark and name waypoints and create routes on your PC, and then upload the map of your choice to your GPS.": [
      "Yes"
    ],
    "App compatibility\n\nAn online community where members upload, analyze and share activity data.": [
      "Garmin Explore",
      "BaseCamp",
      "Garmin Connect"
    ],
    "Area calculation": [
      "Yes"
    ],
    "Auto pause\n\nAutomatically pauses timer when you stop or go below a specified pace.": [
      "No"
    ],
    "Barometric altimeter\n\nBarometer function helps forecast weather trends. An altimeter can provide one line of position for location on a topo map, useful if the GPS isn't working.": [
      "No"
    ],
    "Basemap\n\nA basic set of map data that is included with the GPS. Basemap detail may vary from unit to unit.": [
      "Yes"
    ],
    "Batteries": [
      "2 AA (not included)"
    ],
    "Battery life": [
      "16 h"
    ],
    "Battery power indicator": [
      "Yes"
    ],
    "Bluetooth": [
      "Yes"
    ],
    "Built-in memory": [
      "16GB"
    ],
    "Button lock": [
      "No"
    ],
    "Calorie consumption\n\nCalculated based on data from a heart rate monitor.": [
      "No"
    ],
    "Calories in real time\n\nDisplays calorie expenditure during activity, based on heart rate monitor data.": [
      "No"
    ],
    "Chest strap": [
      "Sold separately"
    ],
    "Coded signal\n\nA coded instrument ensures no interference between your chest strap and your watch, necessary if you are training in busy gyms or trails where other signals may be encountered.": [
      "Yes"
    ],
    "Countdown timer": [
      "Yes"
    ],
    "Custom POI\n\nA POI (point of interest) is a specific location that someone may find interesting (i.e., favourite viewpoint, best coffee stop before the trailhead). The custom POI feature allows the user to load only the POI's that interest them onto their GPS unit.": [
      "Yes"
    ],
    "Data card": [
      "microSD card (not included)"
    ],
    "Dimensions": [
      "16 x 6.1 x 3.6cm"
    ],
    "Display dimensions": [
      "3.6 x 5.5cm"
    ],
    "Distance/time alarm": [
      "Yes"
    ],
    "Electronic compass\n\nAn electronic compass allows the user to view their heading in situations where they are either standing still or moving too slowly for the GPS to detect.": [
      "No"
    ],
    "Floats": [
      "No"
    ],
    "Foot pod\n\nAttaches to your shoe, captures your running data (i.e., pace, distance), and transmits it to your heart rate monitor or GPS.": [
      "Not compatible"
    ],
    "Haptic feedback": [
      "No"
    ],
    "Heart rate in real time\n\nDisplays beats per minute during activity.": [
      "No"
    ],
    "Heart rate monitor": [
      "Sold separately"
    ],
    "Heart rate target zones\n\nDisplays heart rate zones during activity.": [
      "No"
    ],
    "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": [
      "IP X7"
    ],
    "Ideal for": [
      "Backpacking",
      "Day hiking",
      "Alpine climbing and mountaineering",
      "Winter and expedition camping"
    ],
    "Interface": [
      "USB",
      "NMEA 0183"
    ],
    "Interval training": [
      "No"
    ],
    "Low battery warning": [
      "Yes"
    ],
    "Made in": [
      "Taiwan"
    ],
    "Metric/imperial units format": [
      "Yes"
    ],
    "New lap auto start\n\nAutomatically triggers a new lap after reaching a specified difference.": [
      "No"
    ],
    "Pace alarm\n\nAn alarm that notifies you if you vary from a pre-set pace.": [
      "No"
    ],
    "Pause timer\n\nPauses the timer when slowing or stopping, and automatically resumes when moving again.": [
      "No"
    ],
    "Power meter\n\nDisplays output in watts as you ride.": [
      "Not compatible"
    ],
    "Programmable workouts\n\nWant an easy jog? A fast-paced ride? A workout with lots of variety to keep you on your toes? With programmable workouts you can tailor your training to match whatever you are looking for on a particular day.": [
      "No"
    ],
    "Routes": [
      "200"
    ],
    "Snooze": [
      "No"
    ],
    "Speed/cadence sensor\n\nMonitors pedalling cadence and measures pedalling strokes per minute.": [
      "Sold separately"
    ],
    "Stopwatch": [
      "Yes"
    ],
    "Tide tables": [
      "No"
    ],
    "Touch screen": [
      "No"
    ],
    "Track log": [
      "10,000 points, 200 saved tracks"
    ],
    "Unit to unit transfer\n\nShares data wirelessly between compatible units.": [
      "Yes"
    ],
    "Virtual partner\n\nAllows user to monitor training goals with either a virtual partner or alarms.": [
      "No"
    ],
    "Waypoints\n\nWaypoints consist of a standard set of coordinates (two for land, three for air or space) that identify a specific physical location. A route is navigated between two or more waypoints.": [
      "5000"
    ],
    "Weight": [
      "217g"
    ],
    "WiFi": [
      "No"
    ],
    "Wireless sync": [
      "Yes"
    ],
    "Workout history": [
      "Yes"
    ]
  }
}