{
  "categories": [
    "Home",
    "All",
    "Ski and snowboard gear",
    "Avalanche safety gear",
    "Avalanche airbags",
    "Ascent 30 Avabag Kit"
  ],
  "description": "With capacity for long touring days, this airbag pack is still reasonably light. It's rigged with touring features to carry a helmet and skis, board or snowshoes, and the front compartment fits avi gear. A 3D shaped back panel and contoured hip fins offer comfort and keep weight balanced and centred when it's time to make some turns. Plus, airbag system can be activated again and again without the cartridge attached, allowing you to practice activation before an emergency.Water resistant zippers keep snow out.Shaped foam shoulder straps, hip fins and backpanel distribute the load.Safety locking hipbelt and accessory leg loop keep the pack in place during an avalanche.Large main compartment is accessed via C-shaped perimeter zipper.Dedicated front compartment for avalanche gear.Small top pocket has a zip and key clip.Lots of external carrying capacity: dual ice axe loops, helmet holder, diagonal ski carry straps and webbing for a snowboard or snowshoes.AVABAG airbag system has a lightweight and compact design that removes and installs quickly.Airbag has welded seams, resists leaks and is lighter than traditional sewn, seam-sealed designs.Release handle is height adjustable and ergonomically shaped so it's grab-able with gloves, or with either hand.Includes airbag and pack only. Refillable air cartridge available separately. Empty cartridges can be filled at approved centres such as dive shops or paintball stores.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9164036177950/6014529-DES10.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9164036177950/6014529-DES10.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Ortovox Ascent 30 Avabag Kit - Unisex",
  "product_code": "6014-529",
  "source_url": "https://www.mec.ca/en/product/6014-529/Ascent-30-Avabag-Kit",
  "tech_specs": {
    "Access\n\nThe location of all access points into the main compartment of the pack.": [
      "Clamshell zip",
      "Front"
    ],
    "Additional feature(s)": [
      "Airbag included",
      "Compression straps",
      "Helmet attachment",
      "Hydration compatible (reservoir sold separately)",
      "Ice axe/pole attachment"
    ],
    "Canister Included": [
      "No"
    ],
    "Carries": [
      "Skis - diagonal",
      "Snowboard - vertical",
      "Snowshoes"
    ],
    "Deployment System": [
      "Compressed air"
    ],
    "Hipbelt": [
      "Padded"
    ],
    "Ideal for": [
      "Backcountry skiing",
      "Snowboarding"
    ],
    "Made in": [
      "Vietnam"
    ],
    "Main fabric": [
      "420-denier nylon"
    ],
    "Secondary fabric": [
      "100-denier ripstop nylon"
    ],
    "Ventilated back panel": [
      "No"
    ],
    "Volume": [
      "30L"
    ],
    "Weight": [
      "2.17kg"
    ]
  }
}