{
  "categories": [
    "Home",
    "All",
    "Run and fitness",
    "Training electronics",
    "Heart rate monitor sensor straps",
    "H9 Heart Rate Monitor"
  ],
  "description": "Pair this lightweight heart rate strap with your phone, compatible watch or bike computer, and take your training to the next level. Pair the Polar Beat app, or your favourite fitness app, with the H9 and you’re ready to go. From calories burnt, to rest and recovery stats (in app), adding a heart rate strap lets you train smarter.Polar Flow app lets you share your training data with coaches, trainers and your fitness community.Works with many apps: Runtastic, Endomondo MyFitnessPal, Nike+ Run Club, TrainingPeaks, Strava and more.Broadcasts heart rate over both ANT+ and Bluetooth™ Smart.Compatible with any gym cardio stations that use 5kHz transmission.Soft, snug fit gives greater comfort and more accurate readings.Snap off sensor makes the strap easy to wash.Easy to replace CR2025 battery is good for more than 400 hours.30m waterproofing isn’t be bothered by heavy rain or swimming.Soft rounded edges are comfortable to wear.Comes in 2 sizes, XS-S fits 51-66cm chests and M-XXL fits 65-93cm chests.In the box: H9 heart rate sensor, soft strap and documentation.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9185907114014/6015595-BK000.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9185907114014/6015595-BK000.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Polar H9 Heart Rate Monitor",
  "product_code": "6015-595",
  "source_url": "https://www.mec.ca/en/product/6015-595/H9-Heart-Rate-Monitor",
  "tech_specs": {
    "ANT+ compatible\n\nEnsures seamless digital wireless communication between ANT+ devices. For example, data from an ultra-low power wireless sensor can be displayed on a bike computer or smartphone, then downloaded to a PC, etc.": [
      "Yes"
    ],
    "Bluetooth": [
      "Yes"
    ],
    "Ideal for": [
      "Running, fitness and training",
      "Road cycling",
      "Cycle training"
    ],
    "Made in": [
      "China"
    ],
    "Weight": [
      "39g (Extra Small/Small)"
    ]
  }
}