{
  "categories": [
    "Home",
    "All",
    "Run and fitness",
    "Training electronics",
    "Heart rate monitor sensor straps",
    "H10 Heart Rate Monitor"
  ],
  "description": "With an internal memory, Bluetooth and 5kHz transmission, and whole new style of sensor layout, the H10 is Polar’s most advanced heartrate strap. Pair this lightweight heart rate strap with your phone, compatible watch or bike computer, and take your training to the next level.  It’s compatible with most gym cardio equipment and can transmit to select Polar receivers even while you’re swimming.Polar Flow app lets you share your training data with coaches, trainers and your fitness community.Works with many apps: Runtastic, Endomondo MyFitnessPal, Nike+ Run Club, TrainingPeaks, Strava and more.Broadcasts heart rate over both ANT+ and Bluetooth™ Smart – supporting up to 2 simultaneous connections.Internal memory stores one training session’s activity data, synching automatically when connected to your compatible smartphone running the free Polar Beat app.Compatible with any gym cardio stations that use 5 kHz transmission.Transfers heart rate information while swimming to Polar products that support 5 kHz transmission. Bluetooth connection will not work in water.Soft, snug fit gives greater comfort.Snap off sensor makes the strap easy to wash.Easy to replace CR2025 battery is good for more than 400 hours.Comes in 2 sizes, XS-S fits 51-66cm chests and M-XXL fits 65-93cm chests.Silicone dots help keep the H10 in place during activity.In the box: H10 heart rate sensor, soft strap and documentation.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9185905836062/6015596-BK000.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9185905836062/6015596-BK000.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Polar H10 Heart Rate Monitor",
  "product_code": "6015-596",
  "source_url": "https://www.mec.ca/en/product/6015-596/H10-Heart-Rate-Monitor",
  "tech_specs": {
    "ANT+ compatible\n\nEnsures seamless digital wireless communication between ANT+ devices. For example, data from an ultra-low power wireless sensor can be displayed on a bike computer or smartphone, then downloaded to a PC, etc.": [
      "Yes"
    ],
    "Bluetooth": [
      "Yes"
    ],
    "Ideal for": [
      "Running, fitness and training",
      "Swim training",
      "Road cycling",
      "Cycle training"
    ],
    "Made in": [
      "Malaysia"
    ]
  }
}