{
  "categories": [
    "Home",
    "All",
    "Cycling",
    "Bike accessories",
    "Bike lights",
    "Front bike lights",
    "Monteer 8000S Front Light"
  ],
  "description": "Take a little daylight with you on your next night ride. If you can never have enough light when you hit the trails after dark, the Monteer 8000S is your light. Sitting at the very top of Magicshine’s impressive Monteer line, the 8000S has more than enough light for even the fastest descents. With 15 different modes across 3 different lighting styles, there is a mode for every part of the ride, from slow climb trails, to flowing single track and gnarly descents. And, the USB powered battery pack is easy to charge, making days of “good enough” batteries a thing of the past. The 8000S takes daylight out of the “can I go riding?” equation, with this on your bars darkness gets out of your way.Hybrid mode combines spot (21º spread) and flood (32º spread) lighting modes, spot and flood lighting modes can also on their own, all modes have 5 different levels: 100%, 50%, 25%, 10% and flashing.Hybrid mode 5 levels: 100% (1.3h at 8000 lumens), 50% (3.25h at 4400 lumens), 25% (6.3h at 2400 lumens), 10% (12h at 1000 lumens) and flash (7h at 1800 lumens). Note: The light will lock into the lowest setting when the power is 5% or less.Single button control is easy to use with gloves on and the last mode used is remembered for your next ride.USB rechargeable 10,000mAh battery straps to your frame.Battery doubles as a USB powerbank (5V, 2A output).4-level LED battery status light works when charging or in use.Machined aluminum housing with integrated heat sync reduces heat build up, and programmed thermal protection keeps the light from overheating.IPX5 weatherproofing keeps the light shining in even the heaviest downpours.Integrated Garmin ½ turn mount gives you lots of options to use existing mounts.Includes mounting straps for a variety of handlebar diameters (25.4mm, 28mm, 31.8mm, 35mm and aerobars).",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9199332458526/6016464-BK000.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9199332458526/6016464-BK000.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9199332458526/6016464-BK000.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9199332458526/6016464-BK000.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Magicshine Monteer 8000S Front Light",
  "product_code": "6016-464",
  "source_url": "https://www.mec.ca/en/product/6016-464/Monteer-8000S-Front-Light",
  "tech_specs": {
    "Batteries": [
      "Lithium-ion 10000mAh (included)"
    ],
    "Boost mode\n\nBriefly increases the light output to maximum brightness and distance.": [
      "No"
    ],
    "Burn Time - steady": [
      "1.3-32 h"
    ],
    "Burn time - flash": [
      "7-16 h"
    ],
    "Charge time\n\nThe amount of time it takes to fully charge the battery. Applies to lithium and NiMH type batteries. Does not apply to rechargeable or non-rechargeable AA or AAA batteries.": [
      "9 h"
    ],
    "Flash mode": [
      "Yes"
    ],
    "Helmet attachment\n\nIncludes a bracket or mounting system that attaches to most bike helmets.": [
      "Sold separately"
    ],
    "Ideal for": [
      "Mountain biking",
      "Gravel riding"
    ],
    "Included mounts": [
      "Handlebar mount"
    ],
    "Light modes\n\nThe number of lighting levels/modes the light has (i.e., low, med, high, flash).": [
      "15 modes"
    ],
    "Light source": [
      "5 Cree XHP-50.2 LEDs"
    ],
    "Made in": [
      "China"
    ],
    "Max light output\n\nThe total quantity of light emitted in every direction from a source of light; measured in lumens.": [
      "8000 lumens"
    ],
    "Product sustainability": [
      "Rechargeable batteries"
    ],
    "Rechargeability\n\nRechargeable lights give you hassle-free recharging with almost any power source. Replaceable batteries provide instant power, but you’ll need to bring extra batteries, recycle used ones and buy new ones.": [
      "Rechargeable"
    ],
    "Red light mode": [
      "No"
    ],
    "Regulated output\n\nOn regulated lights brightness is consistent, and does not decrease gradually as the batteries are drained.": [
      "Yes"
    ],
    "Type\n\nMost Canadian municipalities require a white front light and a red rear light.": [
      "Front"
    ],
    "Weight": [
      "518g"
    ]
  }
}