{
  "categories": [
    "Home",
    "All",
    "Camping and hiking",
    "Electronics",
    "GPS Navigation",
    "GPS watches",
    "9 Peak"
  ],
  "description": "Tucked in a streamlined case, the 9 Peak has full multisport GPS functions. For urban runs and races, the Snap-to-Route feature offer precision that's great for training or races that wind through canyons of glass and steel, or feature that interfere with GPS signals. Intelligent power management software tracks battery status. On the fly mode changes give you enough power for the last kilometer or the next 50. With more than 80 activity profiles, the 9-series is ready for your next run, or your next game of jai alai. The optical heart rate monitor adds precision to your training. Paired with a compatible phone running the Suunto app and the 9-series app, you can interact with other fitness apps, transfer activities, receive notifications (calls, texts, reminders, etc.), plan routes using heatmaps, share activities and more. Activity tracking features record steps and calories, as well as monitor the quality of your sleep. This 24/7 performance is all part of calculating your recovery times and tracking your progress.Snap-to-Route matches your GPS track to a preloaded route (aka a .GPX file), removing inaccurate GPS points that lead to inaccurate data. Go past the 100m buffer, and your route is plotted by GPS, not by preloaded route. Within 20m of your planned route, it tracks the planned route.LifeQ’s optical heart rate monitor provides blood oxygen level information plus reliable constant heart rate data without a chest strap.Heatmaps display other Suunto user’s activities over local maps, making it easy to find the best runs, rides, trails, or swims.FusedTrack™ uses data from the internal sensors to plot your route between GPS points. By combining the data, you get a track that mirrors your actual track, while only checking into GPS once or twice a minute, greatly increasing battery life: 25-170h with GPS recording.FusedSpeed™ combines GPS and accelerometer data to provide a more stable running pace.Pre-set intelligent battery profiles change modes to get specific runtimes and features out of the remaining battery.Custom battery profiles allow you to set-up exactly what you need for an activity. Saving these modes lets you have specific battery profiles for different activities.Low battery detection mode switches off everything but the activity timer.Free Suunto app lets you connect and sync to your favourite training apps, like Strava®, Training Peaks® and Komoot®.Suunto app enables sharing metrics with coaches and personal trainers, opening up a whole world of digital training plans and tips.Loaded with more than 80 different sport modes, from running, swimming, cycling and many more, there is a sport specific mode for nearly every activity.GPS, GLONASS, BeiDou and QZSS satellite constellation support for strong signal anywhere.24/7 activity tracking, learning your activity level and guiding you towards a more active lifestyle.Sleep tracking monitors the quality of your sleep, when you turn in and total sleep, using this data to calculate recovery times and progress.Tilt compensated digital compass.Barometric altimeter tracks ascents, descents and total elevation changes.Altitude acclimation calculated through altitude data and blood oxygenation data.Storm alarm tracks pressure changes.Ambient light sensor adjusts screen backlight to match conditions.Bluetooth Smart connects fitness sensors from power meters to foot pods, plus phones.Automatically syncs data to paired phones running free Suunto app.Smart notifications (emails, texts, alerts and more) via Bluetooth.Free software updates via Bluetooth, add functionality and improve performance.Virtually scratchproof sapphire crystal face and stainless steel hardware.Fast-charging USB power cord can charge from 0-100% in 1 hour (when paired with fast-charging USB port).Charging cable attaches to the watch with magnets.User-friendly strap changes, thanks to quick-release pins. Fits any 22mm wide strap.Fits wrists 12.5-17.5cm.Suunto app grants access to Suunto Value Pack: premium access to popular training apps including: 60-day Strava Summit trial, 30-day Training Peaks premium membership, 3-months of Relive club and 90-day SportTracks membership.In the box: Suunto 9 Peak, USB cable and documentation.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196895305758/6016515-BK000.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196890226718/6016515-BK000-ALT-A.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196890521630/6016515-BK000-ALT-B.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196890619934/6016515-BK000-ALT-C.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196895305758/6016515-BK000.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196890226718/6016515-BK000-ALT-A.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196890521630/6016515-BK000-ALT-B.jpg",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196890619934/6016515-BK000-ALT-C.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196895305758/6016515-BK000.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196890226718/6016515-BK000-ALT-A.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196890521630/6016515-BK000-ALT-B.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196890619934/6016515-BK000-ALT-C.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196895305758/6016515-BK000.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196890226718/6016515-BK000-ALT-A.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196890521630/6016515-BK000-ALT-B.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF",
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196890619934/6016515-BK000-ALT-C.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "Suunto 9 Peak",
  "product_code": "6016-515",
  "source_url": "https://www.mec.ca/en/product/6016-515/9-Peak",
  "tech_specs": {
    "12/24 hour format": [
      "Yes"
    ],
    "ANT+ compatible\n\nEnsures seamless digital wireless communication between ANT+ devices. For example, data from an ultra-low power wireless sensor can be displayed on a bike computer or smartphone, then downloaded to a PC, etc.": [
      "No"
    ],
    "Add maps capability\n\nThese units allow you to add maps, so you can mark and name waypoints and create routes on your PC, and then upload the map of your choice to your GPS.": [
      "No"
    ],
    "App compatibility\n\nAn online community where members upload, analyze and share activity data.": [
      "Suunto",
      "Third party apps"
    ],
    "Area calculation": [
      "No"
    ],
    "Auto pause\n\nAutomatically pauses timer when you stop or go below a specified pace.": [
      "No"
    ],
    "Barometric altimeter\n\nBarometer function helps forecast weather trends. An altimeter can provide one line of position for location on a topo map, useful if the GPS isn't working.": [
      "Yes"
    ],
    "Basemap\n\nA basic set of map data that is included with the GPS. Basemap detail may vary from unit to unit.": [
      "No"
    ],
    "Batteries": [
      "Lithium-ion (included)"
    ],
    "Battery life": [
      "25 - 336 h"
    ],
    "Battery power indicator": [
      "Yes"
    ],
    "Bluetooth": [
      "Yes"
    ],
    "Button lock": [
      "Yes"
    ],
    "Calorie consumption\n\nCalculated based on data from a heart rate monitor.": [
      "Yes"
    ],
    "Calories in real time\n\nDisplays calorie expenditure during activity, based on heart rate monitor data.": [
      "Yes"
    ],
    "Case diameter": [
      "43mm"
    ],
    "Chest strap": [
      "Sold separately"
    ],
    "Coded signal\n\nA coded instrument ensures no interference between your chest strap and your watch, necessary if you are training in busy gyms or trails where other signals may be encountered.": [
      "Yes"
    ],
    "Countdown timer": [
      "Yes"
    ],
    "Custom POI\n\nA POI (point of interest) is a specific location that someone may find interesting (i.e., favourite viewpoint, best coffee stop before the trailhead). The custom POI feature allows the user to load only the POI's that interest them onto their GPS unit.": [
      "Yes"
    ],
    "Data card": [
      "Not accepted"
    ],
    "Dimensions": [
      "4.3 x 4.3 x 1.1cm"
    ],
    "Distance/time alarm": [
      "Yes"
    ],
    "Electronic compass\n\nAn electronic compass allows the user to view their heading in situations where they are either standing still or moving too slowly for the GPS to detect.": [
      "Yes"
    ],
    "Face material\n\nPolycarbonate is inexpensive and light, with good clarity and wear-resistance. Mineral crystal glass offers greater clarity and significantly greater wear-resistance. Sapphire crystal is better still for clarity and wear-resistance.": [
      "Sapphire crystal"
    ],
    "Foot pod\n\nAttaches to your shoe, captures your running data (i.e., pace, distance), and transmits it to your heart rate monitor or GPS.": [
      "Sold separately"
    ],
    "Haptic feedback": [
      "Yes"
    ],
    "Heart rate in real time\n\nDisplays beats per minute during activity.": [
      "Yes"
    ],
    "Heart rate monitor": [
      "Yes"
    ],
    "Heart rate target zones\n\nDisplays heart rate zones during activity.": [
      "Yes"
    ],
    "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": [
      "IP X8"
    ],
    "Ideal for": [
      "Running, fitness and training",
      "Swim training",
      "Road cycling",
      "Triathlon"
    ],
    "Interface": [
      "USB",
      "Wireless"
    ],
    "Interval training": [
      "Yes"
    ],
    "Low battery warning": [
      "Yes"
    ],
    "Lug width": [
      "22mm"
    ],
    "Made in": [
      "China"
    ],
    "Metric/imperial units format": [
      "Yes"
    ],
    "New lap auto start\n\nAutomatically triggers a new lap after reaching a specified difference.": [
      "Yes"
    ],
    "Pace alarm\n\nAn alarm that notifies you if you vary from a pre-set pace.": [
      "Yes"
    ],
    "Pause timer\n\nPauses the timer when slowing or stopping, and automatically resumes when moving again.": [
      "Yes"
    ],
    "Power meter\n\nDisplays output in watts as you ride.": [
      "Sold separately"
    ],
    "Product sustainability": [
      "Rechargeable batteries"
    ],
    "Programmable workouts\n\nWant an easy jog? A fast-paced ride? A workout with lots of variety to keep you on your toes? With programmable workouts you can tailor your training to match whatever you are looking for on a particular day.": [
      "Advanced"
    ],
    "Replaceable wrist strap": [
      "Yes"
    ],
    "Snooze": [
      "Yes"
    ],
    "Speed/cadence sensor\n\nMonitors pedalling cadence and measures pedalling strokes per minute.": [
      "Sold separately"
    ],
    "Stopwatch": [
      "Yes"
    ],
    "Tide tables": [
      "No"
    ],
    "Touch screen": [
      "Yes"
    ],
    "Unit to unit transfer\n\nShares data wirelessly between compatible units.": [
      "No"
    ],
    "Virtual partner\n\nAllows user to monitor training goals with either a virtual partner or alarms.": [
      "No"
    ],
    "Weight": [
      "62g"
    ],
    "WiFi": [
      "No"
    ],
    "Wireless sync": [
      "Yes"
    ],
    "Workout history": [
      "Yes"
    ],
    "Wrist strap material": [
      "Silicone"
    ]
  }
}