{
  "categories": [
    "Home",
    "All",
    "Run and fitness",
    "Clothing",
    "Running and fitness jackets",
    "Trail Breaker Jacket"
  ],
  "description": "Questionable weather? No problem! This lightweight, weather-resistant jacket provides all the protection you need to get in your training. A front zipper and thumb loops let you adjust your coverage, while a ventilated back panel ensures you don't overheat on the uphills.Weather-protective front panel and breathable mesh back panel keep you cool and dry.Half-length zipper allows ventilation.Watch hole on both sleeves gives a quck view of your stats.Thumbholes keep sleeves in place.",
  "img_urls": {
    "high": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9193340076062/6016292-DKB77.jpg"
    ],
    "low": [
      "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9193340076062/6016292-DKB77.jpg?w=600&h=600&auto=format&q=60&fit=fill&bg=FFF"
    ]
  },
  "name": "On Trail Breaker Jacket - Women's",
  "product_code": "6016-292",
  "source_url": "https://www.mec.ca/en/product/6016-292/Trail-Breaker-Jacket",
  "tech_specs": {
    "Additional feature(s)": [
      "Thumb loops"
    ],
    "Durable water repellency\n\nUsually referred to as DWR. A treatment made to fabrics that causes water to bead and run off instead of soaking through.": [
      "Yes"
    ],
    "Fabric content": [
      "86% nylon",
      "14% elastane"
    ],
    "Ideal for": [
      "Running"
    ],
    "Length": [
      "Hip-length"
    ],
    "Made in": [
      "Vietnam"
    ],
    "Type": [
      "Wind shell"
    ],
    "Waterproofness\n\nWaterproof garments use waterproof-breathable technologies and are fully seam-taped. Water-resistant garments use waterproof-breathable technologies but their seams are not taped. Water-resistant garments repel water and protect against wind but are not made of waterproof fabric.": [
      "Water-resistant"
    ],
    "Weight": [
      "175g (Small)"
    ],
    "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": [
      "Windproof panels"
    ]
  }
}