{"name": "MEC Tremblant Jacket - Men's", "categories": ["Home", "All", "Clothing", "Jackets", "Insulated jackets", "Down jackets", "Tremblant Jacket"], "description": "Throw it on during lunch breaks or when stepping out of the hut to shovel new snow. The Tremblant Jacket is a welcome warm layer that easily packs down into a compact little package. The fabric slides easily beneath a shell jacket and the over-stuffed shoulders are designed to surround you with warmth that won't get packed down and compressed when you wear the jacket layered under your pack.Shell is made of water-resistant Pertex Quantum that compresses down to an insignificant size.Lined with recycled polyester that glides over layers.Insulated with 700-fill power down that meets the Responsible Down Standard for animal welfare.Sewn-through construction keeps the down in place.Shoulders are overfilled to prevent the down from shifting.Down-filled hood has elastic edge binding to seal out drafts.Storm flap behind zipper has a microfleece chin guard that wraps over the zipper.Elasticized wrists keep heat in.Articulated elbows move freely.Shockcord hem seals drafts out and warmth in.Back length is 28in.\n\nRegular fit\n\n\n\nFit guide\n\nGarments, designed for specific activities have features that aren’t always adaptable to general use. For example, cycling clothing is longer in the back and arms. Activity aside, the fit of MEC clothing falls into these categories:\n\n\n\n\n\nOur next to skin fit that contours the body for no distractions\n\n\n\n\n\nOur close to body fit with a low profile silhouette for ease of movement\n\n\n\n\n\nOur standard, slightly off body fit for unrestricted comfort\n\n\n\n\n\nOur roomy, off body fit for maximum comfort and easy layering\n\n\nAll MEC men’s and boy’s pants are regular rise.\n\n\n\n\n        Sustainability\n\n\n\n\n\n\n.bluesign-cls-1,.bluesign-cls-2,.bluesign-cls-3{fill:none;}.bluesign-cls-2,.bluesign-cls-3{stroke:#333;stroke-width:1.79px;}.bluesign-cls-2{stroke-linejoin:round;}.bluesign-cls-3{stroke-miterlimit:10;}\n\nBluesign\n\n\n\n\n\n\n\n\n\n\n\n                      Bluesign® Approved Material\n\n\n\n\n\n\n\n\n\n\n\n\n                      Certified Responsible Down", "product_code": "5034-291", "tech_specs": {"Weight": ["570g (Medium)"], "Ideal for": ["Alpine climbing and mountaineering", "Camping and hiking"], "Type": ["Insulated down"], "Technology": ["Pertex Quantum"], "Construction": ["Sewn-through"], "Face fabric": ["50-denier recycled polyester"], "Lining/backer": ["Recycled polyester"], "Insulation": ["700 fill-power duck down"], "Down weight": ["200g"], "Waterproofness\n\nWaterproof garments use waterproof-breathable technologies and are fully seam-taped. Water-resistant garments use waterproof-breathable technologies but their seams are not taped. Water-resistant garments repel water and protect against wind but are not made of waterproof fabric.": ["Water-resistant"], "Pockets": ["2 handwarmer", "1 internal zippered", "2 internal drop-in"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["Wind-resistant"], "Length": ["Hip-length"], "Durable water repellency\n\nUsually referred to as DWR. A treatment made to fabrics that causes water to bead and run off instead of soaking through.": ["Yes"], "Hood": ["Insulated"], "Product sustainability": ["Bluesign® Approved Material", "Certified Responsible Down"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9127952252958/5034291-NOB00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8804622303262/5034291-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9127952252958/5034291-NOB00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8804622303262/5034291-BK000.jpg"]}