{"name": "Vibram FiveFingers KSO EVO Shoes - Women's", "categories": ["Home", "All", "Run and fitness", "Running and training footwear", "Gym training shoes", "FiveFingers KSO EVO Shoes"], "description": "Love a strong connection to the ground beneath your feet? These are your shoes. They give you maximum feel with minimum protection, and are the most barefoot of all the FiveFingers models.Uppers are breathable polyester mesh with polyurethane reinforcements.Speed-lace system makes them easy to slip into and adjust the fit.Lightly padded tongues feel nice against your feet.Insoles are 2mm EVA foam with antimicrobial sockliners to stay fresh.Outsoles are 4.7mm Vibram® XS Trek rubber with a zig-zag lug pattern for grip in all directions.Machine wash cold, and air dry.", "product_code": "5035-981", "tech_specs": {"Weight": ["198g (38)"], "Ideal for": ["Fitness and training"], "Feel\n\n'Minimal and natural' shoes offer low drop, lots of flex, and minimal cushioning. Most running shoes are 'Light and responsive' with medium cushioning and good energy return. 'Cushioned and floaty' shoes have maximum cushioning.": ["Minimalist and natural"], "Stability\n\nSome shoes include added motion control or stability features to help minimize over pronation, where the foot tends to roll inward in a biomechanically imbalanced running position.": ["Neutral"], "Closure": ["Quick pull"], "Heel-to-toe cushioning\n\nThe approximate thickness of the midsole cushioning under the heel and the forefoot. A thicker heel and greater difference between heel and toe height tends to suit heel-strike runners, while forefoot and midfoot strikers may prefer a minimal drop between heel and toe cushioning.": ["0-0mm"], "Drop\n\nThe drop is the difference in height between the heel and the forefoot midsole cushioning. Traditional running shoes tend to have a 10mm drop or higher while minimalist style shoes are on the lower end of the spectrum.": ["0mm"], "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": ["No"], "Made in": ["Vietnam"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8808756051998/5035981-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8808756412446/5035981-BK000-ALT-SIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8808756445214/5035981-BK000-ALT-TOP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8808756740126/5035981-BK000-ALT-SOLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8808756051998/5035981-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8808756412446/5035981-BK000-ALT-SIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8808756445214/5035981-BK000-ALT-TOP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8808756740126/5035981-BK000-ALT-SOLE.jpg"]}