{"name": "Kali Chakra Bicycle Helmet - Children", "categories": ["Home", "All", "Cycling", "Bike helmets and body armour", "Bike helmets", "Chakra Bicycle Helmet"], "description": "Good value helmet for little ones on the go. The foam liner is fused directly to the semi-rigid shell to reduce weight and increase shock absorption. Dial-fit adjustment system means child's perfect helmet size is just a twist away.Polycarbonate shell is lightweight and protective.Lined with expanded polystyrene (EPS) foam to reduce impact.Small size has adjustable dial to cinch for your perfect fit.X-small has an elastic fit system to better suit tiny heads.Design offers lots of coverage at the back of the head.Integrated visor to block out the sun when needed.", "product_code": "5036-559", "tech_specs": {"Ideal for": ["Urban cycling"], "Construction\n\nMicroshell helmets are made of a thin polymer sheet over a foam liner; Hardshell helmets have a hard polymer outer shell and a foam liner; when the liner is being bonded to the outer shell during the manufacturing process, it is Molded in the shell.": ["Molded in the shell"], "Shell material": ["Polycarbonate"], "Fit system": ["Adjustable dial"], "Inner material": ["EPS (expanded polystyrene)"], "Circumference\n\nThe internal circumference determines the size head that the helmet will fit.": ["46-48cm (Monsters Blue X-Small)", "48-54cm (Monsters Blue Small)"], "Vents": ["Yes"], "Approved for\n\nMost helmets are tested and certified for a specific sport. Some helmets are approved for multi-sports, but only after passing the safety tests for both sports (i.e., snowsports and cycling).": ["Cycling"], "Safety rating\n\nCetification is established by a variety of governing bodies who set impact standards. Most helmets are certified or approved for a specific sport, except in the case of multi-sport helmets (i.e., a snowsports helmet might also be approved for cycling if it meets the cycling safety standards).": ["EN 1078", "CPSC"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9062490210334/5036559-SKP09.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9062489784350/5036559-BL151.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9062490210334/5036559-SKP09.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9062489784350/5036559-BL151.jpg"]}