{"name": "MEC Slipstream Hoodie - Men's", "categories": ["Home", "All", "Clothing", "Fleece, hoodies and sweaters", "Fleece jackets", "Slipstream Hoodie"], "description": "This technical midlayer is lightweight and breathable enough for climbing or fast hiking in alpine terrain. The fabric is Polartec Power Stretch fleece that provides a good level of insulation for ticking your way up an exposed pitch. An external coating resists the abrasive properties of exfoliating granite and weathered lichen, and it presents a moisture resistant face to the elements when you're wearing the Slipstream as an outer layer.Made of Polartec Power Stretch fleece, 90% polyester, 10% spandex.Hard face finish on the flat surface of the fabric increases its resistance to abrasion and prevents it from getting scruffy.Close fit hood won't block your vision.Full-length zip with a fold-over chin guard.Generous left chest pocket is accessible with one hand.\n\n        Sustainability\n\n\n\n\n\n\n.bluesign-cls-1,.bluesign-cls-2,.bluesign-cls-3{fill:none;}.bluesign-cls-2,.bluesign-cls-3{stroke:#333;stroke-width:1.79px;}.bluesign-cls-2{stroke-linejoin:round;}.bluesign-cls-3{stroke-miterlimit:10;}\n\nBluesign\n\n\n\n\n\n\n\n\n\n\n\n                      Bluesign® Approved Material", "product_code": "5036-949", "tech_specs": {"Weight": ["348g (Medium)"], "Ideal for": ["Alpine climbing and mountaineering", "Ski mountaineering"], "Type": ["Mid-layer", "Fleece"], "Fabric weight\n\nMeasured in grams per square metre (gsm). The larger the number, the heavier and thicker the garment.": ["224gsm"], "Technology": ["Polartec Power Stretch", "Polartec Hardface"], "Fabric content": ["90% polyester", "10% spandex"], "Pockets": ["1 external chest"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["Wind-resistant"], "Length": ["Below hip"], "Durable water repellency\n\nUsually referred to as DWR. A treatment made to fabrics that causes water to bead and run off instead of soaking through.": ["No"], "Hood": ["Fitted"], "Product sustainability": ["Bluesign® Approved Material"], "Made in": ["El Salvador"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8800923123742/5036949-ECP28.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8800923123742/5036949-ECP28.jpg"]}