{"name": "K2 Emphasis Snow Helmet - Women's", "categories": ["Home", "All", "Ski and snowboard gear", "Ski and snowboard helmets", "Emphasis Snow Helmet"], "description": "A well-ventilated helmet with an amazing fit and audio controls that let you hook up a mobile phone or media player. The speakers are removable and the front vents operate with a single switch, so the helmet adapts and scales to match your plans.EPS foam bonded to ABS shell for comfort and durability.Combined passive and active venting keeps your brain cool. Open vents to increase airflow with the flick of a switch.Goggle vents under the brim keep your eyewear clear.Fit system combines an adjustable dial with an integrated web in the liner to eliminate pressure points.Full coverage liner provides gap-free comfort for a perfect fit and removes for washing.Mesh around the crown of the liner wicks moisture and breathes to prevent overheating.Level 3 Baseline Audio System includes removable speakers, detachable cord, and an improved on-cord controller for pause/play and answer/hang up.", "product_code": "5038-418", "tech_specs": {"Weight": ["490g (Medium)"], "Ideal for": ["Downhill skiing", "Snowboarding"], "Construction\n\nMicroshell helmets are made of a thin polymer sheet over a foam liner; Hardshell helmets have a hard polymer outer shell and a foam liner; when the liner is being bonded to the outer shell during the manufacturing process, it is Molded in the shell.": ["Hardshell"], "Shell material": ["ABS"], "Fit system": ["Adjustable dial"], "Inner material": ["EPS (expanded polystyrene)"], "Vents": ["Yes"], "Goggle clip": ["Yes"], "Removable ear liners": ["Yes"], "Approved for\n\nMost helmets are tested and certified for a specific sport. Some helmets are approved for multi-sports, but only after passing the safety tests for both sports (i.e., snowsports and cycling).": ["Snowsports"], "Safety rating\n\nCetification is established by a variety of governing bodies who set impact standards. Most helmets are certified or approved for a specific sport, except in the case of multi-sport helmets (i.e., a snowsports helmet might also be approved for cycling if it meets the cycling safety standards).": ["ASTM F2040", "EN 1077: 2007"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9140110491678/5038418-MPC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9140110426142/5038418-FOR00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9140110491678/5038418-MPC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9140110426142/5038418-FOR00.jpg"]}