{"name": "Aquapac iPhone 6 Plus Case", "categories": ["Home", "All", "Camping and hiking", "Electronics", "Electronics cases", "Phone cases", "iPhone 6 Plus Case"], "description": "Make bobbing your Apple a less expensive experience. This soft case is fully submersible, and allows you to take and make calls, use the camera and work the touchscreen. It fits the iPhone 6 Plus, 7 Plus and 8 Plus, as well as other large phablet phones.Floats with most phones (test in shallow water first).Aquaclip waterproof clip uses 2 twist levers for secure sealing.Seams are radio-welded and as strong as the case material.Rated waterproof and submersible to IPX8. Also keeps out dust and dirt.Optically-clear Lenxflex window for taking pictures above the surface or underwater.Adjustable lanyard allows wearing around neck or securing to boat decks, etc.Aquapac® does not guarantee the items inside the case, only the case itself. Likewise, MEC's Rock Solid Guarantee covers the product, but not the contents.", "product_code": "5041-741", "tech_specs": {"Weight": ["45g"], "Ideal for": ["Watersports"], "Closure": ["Watertight clip"], "Material": ["Thermoplastic polyurethane"], "Ruggedness\n\nFair: made of lightweight materials and designed to be carried inside another bag. Good: strikes a balance between light weight and durability. Excellent: made of heavy duty materials and designed to be carried alone. Exceptional: made of ultra-tough materials and designed to withstand abuse.": ["Good"], "Waterproofness\n\nWaterproof bags and cases are made with waterproof materials and have waterproof closures. Some are designed to be submersible. Water-resistant bags and cases are made with waterproof materials, but water could sneak in through the seams or closure.": ["Waterproof"], "Submersible": ["Yes"], "Length": ["16cm"], "Width": ["8.5cm"], "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": ["IP X8"], "Made in": ["United Kingdom"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817478402078/5041741-NOC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817478500382/5041741-NOC02-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8886188474398/5041741-NOC02-ALT-ANDROID.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817478795294/5041741-NOC02-ALT-BACKPHONE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817478893598/5041741-NOC02-ALT-DETAIL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817478402078/5041741-NOC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817478500382/5041741-NOC02-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8886188474398/5041741-NOC02-ALT-ANDROID.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817478795294/5041741-NOC02-ALT-BACKPHONE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817478893598/5041741-NOC02-ALT-DETAIL.jpg"]}