{"name": "MEC Pack Rat Roll Top Silicone Dry Sack", "categories": ["Home", "All", "Camping and hiking", "Sleeping bags, sleeping pads, quilts and pillows", "Compression bags and stuff sacks", "Pack Rat Roll Top Silicone Dry Sack"], "description": "Keep your clothing and gear organized and weatherproofed without adding weight to your pack or suitcase. With waterproof fabric, taped seams, and rolltop closures, they keep the rain and snowmelt out. Wide mouths make them easy to stuff.Made of lightweight, high-tenacity 30-denier silicone treated ripstop nylon 66 with a polyurethane coating for additional water resistance.Different colour for each size for easy identification of contents.Volume is screened on each bag.3L size is good for puffy jackets, or other small compressible items.5 and 10L sizes fit most summer sleeping bags and are excellent for spare clothing.15 to 25L sizes fit three and four-season sleeping bags.", "product_code": "5046-852", "tech_specs": {"Weight": ["28g (3L)", "38g (5L)", "50g (10L)", "62g (15L)", "66g (20L)", "72g (25L)"], "Ideal for": ["Camping and hiking", "Cycle touring", "Travel"], "Closure": ["Roll-top"], "Material": ["30-denier silicone-treated ripstop nylon, PU-coated interior"], "Ruggedness\n\nFair: made of lightweight materials and designed to be carried inside another bag. Good: strikes a balance between light weight and durability. Excellent: made of heavy duty materials and designed to be carried alone. Exceptional: made of ultra-tough materials and designed to withstand abuse.": ["Fair"], "Waterproofness\n\nWaterproof bags and cases are made with waterproof materials and have waterproof closures. Some are designed to be submersible. Water-resistant bags and cases are made with waterproof materials, but water could sneak in through the seams or closure.": ["Water-resistant"], "Submersible": ["No"], "Length": ["42cm (3L)", "45.5cm (5L)", "62cm (10L)", "65cm (15L)", "74cm (20L)", "82cm (25L)"], "Width": ["19.5cm (3L)", "29cm (5L)", "32cm (10L)", "42cm (15L)", "42cm (20L)", "42cm (25L)"], "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": ["Not IPX rated"], "Volume": ["3, 5, 10, 15, 20, 25L"], "Made in": ["Vietnam"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8858741735454/5046852-LVA00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8858742784030/5046852-ATL02-ALT-GROUP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8858741669918/5046852-ATL02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8858741735454/5046852-LVA00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8858742784030/5046852-ATL02-ALT-GROUP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8858741669918/5046852-ATL02.jpg"]}