{"name": "MEC Discovery Pack - Children to Youths", "categories": ["Home", "All", "Camping and hiking", "Packs", "Backpacking packs", "Overnight packs (35 - 55l)", "Discovery Pack"], "description": "Open up longer day trips and overnighters to your kids and tweens. Here’s a real backpack that’s reduced in size (but not in features) for young hikers and adventurers. The internal frame ensures effective weight transfer to their hips to help carry loads. The compression strap and back panel system squeezes bulky loads down to a manageable volume, and there's a wide adjustment range so this pack can grow with your child as they head off to summer camp and further adventures.Top-loading design with a bottom-access zipper for getting at things without unloading it all.Zippered pocket on the adjustable lid. Under-lid pocket with key clip.Front zippered pocket and hipbelt pockets for quick access items.Stretch side pockets hold waterbottles.Spindrift collar with drawcord keeps out the weather and allows overloading.Webbing ladder-adjustable shoulder harness and adjustable hip belt fins grow with your child.Hydration system ready with an internal sleeve, hanger and hose port.Breathable, air mesh backing on hipbelt, back panel and shoulder straps for comfort.Plastic back panel with metal frame stiffener effectively transfers weight to the hipbelt.", "product_code": "5047-729", "tech_specs": {"Weight": ["1.39kg"], "Ideal for": ["Backpacking"], "Main fabric": ["210-denier HT ripstop nylon"], "Secondary fabric": ["420-denier ripstop nylon"], "Access\n\nThe location of all access points into the main compartment of the pack.": ["Top", "Bottom"], "Hipbelt": ["Padded"], "Lid type\n\nSome pack lids can be adjusted to compensate for overloaded packs, or even removed, and some removeable lids have tuck-away hipbelts that allow youto use them as a waistpack.": ["Adjustable"], "Volume": ["39L"], "Length": ["55cm"], "Width": ["30cm"], "Depth": ["20cm"], "Torso length\n\nTorso length is measured from the most prominent vertebrae at the back of your neck (top of shoulders) to the spot on your lower spine that lines up with the top of your hipbone.": ["36-43cm"], "Ventilated back panel": ["No"], "Adjustable shoulder harness\n\nAn adjustable harness lets you change the height of the shoulder straps to fit your specific back length.": ["Yes"], "Dynamic suspension\n\nThe hipbelt and/or shoulder straps of the pack are designed to move, pivot or flex to follow your body’s movements.  Each brand uses their own technology.": ["No"], "Carry-on sized\n\nSize restrictions vary among airlines. Just to be sure, check with your carrier for their specific restrictions.": ["Yes"], "Additional feature(s)": ["Compression straps", "Hydration compatible (reservoir sold separately)", "Expandable collar", "Reflective details", "Sleeping bag compartment", "Hipbelt pocket(s)"], "Made in": ["Vietnam"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8893551214622/5047729-MDB38.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8900578410526/5047729-MDB38-ALT-BODYFRONT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8900578770974/5047729-MDB38-ALT-BODYBACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8900578803742/5047729-MDB38-ALT-BODYSNACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8893551214622/5047729-MDB38.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8900578410526/5047729-MDB38-ALT-BODYFRONT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8900578770974/5047729-MDB38-ALT-BODYBACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8900578803742/5047729-MDB38-ALT-BODYSNACK.jpg"]}