{"name": "MEC Hyper Sunglasses - Unisex", "categories": ["Home", "All", "Clothing", "Clothing accessories", "Sunglasses", "Casual sunglasses", "Hyper Sunglasses"], "description": "Compact shades with an aggressive wrap that puts them close to your face to shield you from light coming in an angle.Frame fits smaller heads.Scratch-resistant polycarbonate lenses.8-base curvature hugs the contour of your head, protecting you from all angles.Rubber nose pads and temple tips offer a comfortable fit and help keep the glasses in place.Grey lens with blue mirror has 15% visible light transmission.Grey lens with red mirror has 16% visible light transmission.Grey lens with silver flash has 11% visible light transmission.", "product_code": "5047-674", "tech_specs": {"Ideal for": ["Casual wear"], "Frame material\n\nTR90 thermoplastic offers good resistance to chemicals and torsion. Propionate is a light, nylon-based, hypoallergenic plastic that's very strong and offers more transparency and gloss than other plastics.": ["TR90 thermoplastic"], "Lens material": ["Polycarbonate"], "Lens performance\n\nFixed tints provide a constant degree of darkness. Photochromic lenses adjust to changing light levels. Polarized lenses absorb horizontal reflected glare to improve clarity around surfaces like snow or water.": ["Fixed tint"], "Lens width\n\nRefers to the horizontal width in millimeters of one of the frame's lenses.": ["65mm"], "Nose bridge width\n\nThe gap between the lenses, measured at the smallest point.": ["18mm"], "Temple length\n\nThe length of an arm from tip to tip.": ["118mm"], "Lens height\n\nMeasures the height of the lens within the frame, excluding the lens curve.": ["35mm"], "100% UVA protected": ["Yes"], "Interchangeable lenses\n\nInterchangeable lenses let you change lenses to suit differing light conditions or activities.": ["No"], "100% UVB protected": ["Yes"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8813611745310/5047674-GYY09.jpg"]}