{"name": "La Sportiva Spantik Boots - Unisex", "categories": ["Home", "All", "Climbing", "Mountaineering and ice climbing", "Mountaineering boots", "Spantik Boots"], "description": "These technical, double boots are designed for cold environments when you still need enough lightness and dexterity to move fast and navigate demanding terrain. Ideal for Alaskan routes or 6000-7000m peaks anywhere in the world, they use the proven Nuptse last but offer a more compact profile and reduced overall weight that allows you to climb well when required.Outer boot is synthetic Benecke CeraCom® PUR leatherette coated with embossed, transparent polyurethane, combined with water-repellent Lorica® coated with Antiacqua™.Insulated with PE thermal closed cell foam lined with a thermo-reflective aluminum facing coated with an anti-abrasion flocking.Sticky Vibram® XSV rubber rands add durability and protection.Outer is board lasted for stiffness. Step-in crampon compatible.Moulded TPU ankle spoiler/backstay for stability and support.Super strong LS lace lock secures easily with gloves on.Slip lasted inner boot is made of micro-perforated thermo-formable PE, and water-repellent synthetic Lorica® and an Antiacqua™ external coating.Fast lacing system lets you adjust for warmth and snugness and is easily tuned with gloves or mitts on.Insole is 5mm carbon fiber with aluminum insulation for lightweight performance  and warmth.Midsole uses dual-density EVA for cushioning and insulation.Sole is Vibram® Montagna for durability.", "product_code": "5048-921", "tech_specs": {"Weight": ["1.26kg (43)"], "Ideal for": ["Snow and ice climbing"], "Upper material": ["Synthetic"], "Closure": ["Quick pull"], "Rand\n\nRubber on the toe and around the boot improves durability. It can also increase grip while scrambling.": ["Partial rand"], "Crampon compatibility\n\nRigid boots with defined toe and heel welts can use compatible step-in crampons or any other type of crampon. Rigid boots with a heel welt but no toe welt can use hybrid crampons or strap-on crampons. Semi-rigid boots can use strap-on crampons only.": ["Step-in"], "Insulated": ["Yes"], "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": ["Yes"], "Removable inner boot": ["Yes"], "Removable insole": ["Yes"], "Made in": ["Italy"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8808347729950/5048921-YLW04.jpg"]}