{"name": "Patagonia Topley Jacket - Men's", "categories": ["Home", "All", "Clothing", "Jackets", "Insulated jackets", "Down jackets", "Topley Jacket"], "description": "High-performance construction at home in urban neighbourhoods. This warm winter jacket is equipped with 2-layer H2No® Performance Standard waterproof-breathable polyester that holds up to your longest adventures – in driving rain or blowing snow. The 700-fill-power down (reclaimed from duck and goose down products) keeps you warm for a comfortable trip to the train or a cross-town trek for tacos.Made of 2-layer H2No® Performance Standard waterproof-breathable recycled polyester with a DWR finish.Fully seam-taped for total waterproofing.Insulated with warm, compressible 700-fill-power recycled down.2-way front zipper has internal and external storm flaps to seal out wind-driven rain.Brushed microfleece-lined collar keeps you cozy.Insulated, 2-way-adjustable hood with visor can be removed when you don't need it.2 side-entry hand pockets with brushed lining warm your chilly fingers.2 front cargo pockets hold essentials.Left external chest pocket has a waterproof zipper and right internal pocket has a cord port for your headphones.Dual-adjust drawcord at hem seals in heat.Drop-tail hem provides rear coverage.", "product_code": "5053-201", "tech_specs": {"Weight": ["1.134kg (Medium)"], "Ideal for": ["Casual wear"], "Type": ["Insulated down", "Waterproof-breathable"], "Technology": ["H2No"], "Construction": ["2-layer", "Quilted"], "Face fabric": ["Recycled polyester"], "Lining/backer": ["Recycled polyester"], "Insulation": ["700 fill-power goose down"], "Waterproofness\n\nWaterproof garments use waterproof-breathable technologies and are fully seam-taped. Water-resistant garments use waterproof-breathable technologies but their seams are not taped. Water-resistant garments repel water and protect against wind but are not made of waterproof fabric.": ["Waterproof with fully taped seams"], "Pockets": ["2 front cargo", "2 handwarmer", "1 external chest", "1 internal zippered with cord port"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["Windproof"], "Length": ["Below hip"], "Durable water repellency\n\nUsually referred to as DWR. A treatment made to fabrics that causes water to bead and run off instead of soaking through.": ["Yes"], "Hood": ["Adjustable", "Insulated", "Removable"], "Additional feature(s)": ["2-way zipper", "Wind flap behind zipper"], "Made in": ["Vietnam"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9096871903262/5053201-OWL22.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9096871903262/5053201-OWL22.jpg"]}