{"name": "Black Diamond Wiz Headlamp - Youths", "categories": ["Home", "All", "Camping and hiking", "Headlamps and lighting", "Headlamps", "Wiz Headlamp"], "description": "Equipped with an RGB LED, the Wiz lets kids dial in the right colour for their mood. This compact headlamp has a powerful beam, and it powers off automatically after 2 hours, in case someone forgets or falls asleep. The head tilts up and down, and it even works if you put it on upside down.RGB LED lets kids cycle through all the colours of the rainbow.CPSIA-certified child-safe screw closure and breakaway elastic safety strap.Bright mode, dimmer setting and a flashing mode.Tilting head directs the light up or down.Waterproof to IP X4 (protected against sprayed or splashed water from any angle).Maximum burn time is 60 hours.Takes 2 AAA batteries (included).", "product_code": "5054-440", "tech_specs": {"Weight": ["67g"], "Ideal for": ["Camping and hiking"], "Light modes\n\nThe number of lighting levels/modes the light has (i.e., low, med, high, flash).": ["3 modes"], "Beam distance - low": ["1m"], "Beam distance - high": ["8m"], "Boost mode\n\nBriefly increases the light output to maximum brightness and distance.": ["No"], "Light source": ["1 LED", "1 RGB LED"], "Burn time - low": ["60 h"], "Burn time - high": ["5 h"], "Max light output\n\nThe total quantity of light emitted in every direction from a source of light; measured in lumens.": ["30 lumens"], "Beam pattern\n\nBeam pattern affects how much you can see within the area of light thrown from the headlamp. Wide beams are good for close-up; spot or focussed beams are good for long range visibility.": ["Wide"], "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": ["IP X4"], "Rechargeability\n\nRechargeable lights give you hassle-free recharging with almost any power source. Replaceable batteries provide instant power, but you’ll need to bring extra batteries, recycle used ones and buy new ones.": ["Non-rechargeable"], "Red light mode": ["Yes"], "Regulated output\n\nOn regulated lights brightness is consistent, and does not decrease gradually as the batteries are drained.": ["No"], "Batteries": ["2 AAA (included)"], "Flash mode": ["Yes"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8913461739550/5054440-POW05.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8913462394910/5054440-BRY00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8913461739550/5054440-POW05.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8913462394910/5054440-BRY00.jpg"]}