{"name": "Smith Squad Mag Goggles - Unisex", "categories": ["Home", "All", "Ski and snowboard gear", "Ski and snowboard goggles", "Squad Mag Goggles"], "description": "A semi-rimless design and Smith’s largest cylindrical lens to date combine to give you a massive field of view, so trees can’t blindside you. All styles include a bonus lens, letting you customize your outlook for the conditions.Designed for medium to larger faces.ChromaPop® lenses deliver exceptional clarity, high contrast, and dynamic colour optimization, making them great for challenging light conditions.Fog-X anti-fog inner lens, helps keep your vision clear.Cylindrical Carbonic-X lens with TLT optics provide crisp detail edge-to-edge.Utilizes Smith’s Responsive Fit™ design, making the frame very flexible without losing strength, allowing the frame to adjust to contours of a variety of face shapes all while reducing weight.Lightweight urethane frame provides a comfortable fit for a wide variety of face shapes.3-layer DriWix foam provides a comfortable, breathable seal.Strap has silicone strips to keep it in place.Includes a spare ChromaPop Storm Rose with 50% visible light transmission.Includes an extra lens and a microfiber goggle bag.", "product_code": "5055-596", "tech_specs": {"Ideal for": ["Downhill skiing", "Backcountry skiing", "Snowboarding"], "Visible Light Transmission\n\n0-10% – very heavy tint, too dark for most needs. \n10-30% – heavy tint for bright sunny days.\n20-60% – light tint, great for cloudy, overcast conditions and shady trails. \n60-80% – very light tint (often coloured), for improving contrast in low-light conditions, think dawn or dusk. \n80-100% – little to no tint, this what you want in the dark.": ["12% (Black/Chromapop Sun Black Gold Mirror)", "22% (Rock Salt Flood/Chromapop Everyday Rose Gold)", "9% (Snorkel/Chromapop Sun Green Mirror)"], "Helmet compatible": ["Yes"], "Scratch-resistant lens": ["Yes"], "Vents\n\nVents allow airflow through the goggles which helps to prevent fogging.": ["Yes"], "Fits over most eyewear\n\nThese optics are designed to fit comfortably over most eyewear.": ["No"], "Anti-fog coating\n\nA coating on the inside of the lens that inhibits condensation.": ["Yes"], "100% UV protection\n\nProvides 100% protection against UVA and UVB rays.": ["Yes"], "Made in": ["USA"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9125755584542/5055596-SSM08.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9125755191326/5055596-RRM09.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9125754339358/5055596-BSM07.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9125755584542/5055596-SSM08.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9125755191326/5055596-RRM09.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9125754339358/5055596-BSM07.jpg"]}