{"name": "Gregory Baltoro 85 Backpack - Men's", "categories": ["Home", "All", "Camping and hiking", "Packs", "Backpacking packs", "Expedition packs (75 - 100l)", "Baltoro 85 Backpack"], "description": "When a weekend just isn’t enough, the refined suspension system on the Baltoro 85 makes it an extremely comfortable, high-capacity pack. The Response A3 (Automatic Angle Adjust) chassis adjusts the shoulder harness and hipbelt panels independently to accommodate the changing angles of your body, allowing you to keep your balance and maintain your centre of gravity as you cover varying terrain. Highly water-resistant hipbelt pockets protect your electronics from wet bushes and branches, and an included raincover keeps everything dry if (or rather, when) it rains heavily. Once you reach your destination, the hydration sleeve doubles as an ultralight daypack for ridge runs and summit missions.7075 aluminum wire frame is wishbone-shaped to channel the load to the centre and lumbar regions.Special anti-barrelling stays ensure stability with big loads.Removable foam shim lets you customize the lower back contour.Top, front and bottom access.Bottom sleeping bag compartment has a removable internal divider.Twin water-bottle holsters are canted for easy access and stow away when not needed.Lots of pockets on the front, sides and lid keep you organized.Internal hydration reservoir sleeve detaches to become an ultralight daypack with a drawstring closure, zippered external pocket, daisy chains and mesh shoulder straps.Removable shockcord loops for ice axes or trekking poles.Removable, adjustable straps let you attach a sleeping pad or extra gear.Maximum recommended cargo weight: 27kg.", "product_code": "5056-146", "tech_specs": {"Weight": ["2.29kg (Medium)"], "Ideal for": ["Backpacking"], "Main fabric": ["210-denier nylon"], "Access\n\nThe location of all access points into the main compartment of the pack.": ["Top", "Front", "Bottom"], "Hipbelt": ["Padded"], "Lid type\n\nSome pack lids can be adjusted to compensate for overloaded packs, or even removed, and some removeable lids have tuck-away hipbelts that allow youto use them as a waistpack.": ["Adjustable"], "Volume": ["85L"], "Ventilated back panel": ["Yes"], "Adjustable shoulder harness\n\nAn adjustable harness lets you change the height of the shoulder straps to fit your specific back length.": ["Yes"], "Dynamic suspension\n\nThe hipbelt and/or shoulder straps of the pack are designed to move, pivot or flex to follow your body’s movements.  Each brand uses their own technology.": ["Yes"], "Carry-on sized\n\nSize restrictions vary among airlines. Just to be sure, check with your carrier for their specific restrictions.": ["No"], "Additional feature(s)": ["Compression straps", "Rain cover included", "Hipbelt pocket(s)", "Hydration compatible (reservoir sold separately)", "Ice axe/pole attachment", "Sleeping bag compartment", "Expandable collar", "Removable daypack included"], "Made in": ["Philippines"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8914009522206/5056146-DBU00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8914009489438/5056146-DBU00-ALT-FRONT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8914010079262/5056146-DBU00-ALT-BACK34.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8914010538014/5056146-DBU00-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8914009522206/5056146-DBU00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8914009489438/5056146-DBU00-ALT-FRONT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8914010079262/5056146-DBU00-ALT-BACK34.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8914010538014/5056146-DBU00-ALT-BACK.jpg"]}