{"name": "Black Diamond 9.4mm Dry Rope", "categories": ["Home", "All", "Climbing", "Rock climbing", "Ropes, cords and slings", "Dynamic climbing ropes", "9.4mm Dry Rope"], "description": "A versatile cord for multi-pitch adventuring or ice missions. 9.4 hits that sweet spot of light enough for hard redpoints, but substantial enough to spend time working your project.Dry treatment on both sheath and core protects against water and dirt.Sheath has a 2x2 weave to withdstand everyday use.Comfortable handling that knots easily and feeds smoothly.Meets UIAA standard water-repellent test, meaning this rope is fast-drying, absorbs virtually no water and resists freezing.Large middle mark is convenient when rigging rappels and belaying for long routes.", "product_code": "5057-766", "tech_specs": {"Weight": ["4.06kg"], "Ideal for": ["Rock climbing", "Snow and ice climbing"], "Type": ["Single (‹ 9.6mm)"], "Treatment\n\nDry ropes have a water-resistant treatment on both core and sheath. Dry (UIAA certified) ropes have both core and sheath treated, plus meet the UIAA Water Repellent standard by passing a stringent test where a soaked rope cannot absorb more than 5% of the rope's weight.": ["Dry (UIAA certified)"], "Length": ["70m"], "Dynamic elongation\n\nMaximum elongation in the first UIAA test fall, where a weight is attached to the rope and then dropped. Higher numbers indicate stretchier ropes.": ["34%"], "Static elongation\n\nIn controlled tests, a weight is suspended from the rope (not dropped). Higher numbers indicate stretchier ropes.": ["8.4%"], "Impact force\n\nThe amount of force, in kN, that the first UIAA fall puts on the falling object. Less impact force puts less force on the climber, belayer, and protection during a fall.": ["8kN"], "Linear weight": ["58g/m"], "Diameter": ["9.4mm"], "Halfway pattern change": ["No"], "UIAA fall rating\n\nIndicates the number of consecutive falls a rope withstood during testing in a controlled environment. The number is for reference only, and does not indicate the number of falls a rope will withstand during actual use or over its lifespan.": ["7"], "Made in": ["Czech Republic"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8938223894558/5057766-ENG00.jpg"]}