{"name": "Smith Forefront 2 MIPS Helmet - Unisex", "categories": ["Home", "All", "Cycling", "Bike helmets and body armour", "Bike helmets", "Forefront 2 MIPS Helmet"], "description": "A full coverage helmet for all-mountain riders who seek a combo of protection, ventilation and eyewear integration. Impact-dampening Koroyd extends to the back and fully encompass the helmet. Internal air channels with open intake and exhaust ports maximize ventilation and promote airflow to stop your eyewear from fogging. Channels on the front and rear house your glasses, and a 3-position visor rotates so you can wear goggles.MIPS technology reduces rotational forces to the head in the event of a fall, lessening the potential damage to the brain.Koroyd and EPS provide consistent energy absorption to disperse impacts in the case of an accident.VaporFit rotary dial adjustment system lets you fine tune the fit.AirEvac ventilation system pulls warm air from in front of your face to reduce fog build-up on glasses.20 vents provides breathability to keep your head cool.3-position adjustable visor for shading and goggle storage.X-Static liner pads with reactive cooling treatment helps to pull sweat away from your head.", "product_code": "5058-507", "tech_specs": {"Weight": ["340g (Medium)"], "Ideal for": ["Mountain biking"], "Construction\n\nMicroshell helmets are made of a thin polymer sheet over a foam liner; Hardshell helmets have a hard polymer outer shell and a foam liner; when the liner is being bonded to the outer shell during the manufacturing process, it is Molded in the shell.": ["Molded in the shell"], "Shell material": ["Polycarbonate"], "Fit system": ["Adjustable dial"], "Inner material": ["EPS (expanded polystyrene)", "Co-polymer"], "Circumference\n\nThe internal circumference determines the size head that the helmet will fit.": ["51-55cm (Matte Black Small)", "55-59cm (Matte Black Medium)", "59-62cm (Matte Black Large)"], "Vents": ["Yes"], "Approved for\n\nMost helmets are tested and certified for a specific sport. Some helmets are approved for multi-sports, but only after passing the safety tests for both sports (i.e., snowsports and cycling).": ["Cycling"], "Safety rating\n\nCetification is established by a variety of governing bodies who set impact standards. Most helmets are certified or approved for a specific sport, except in the case of multi-sport helmets (i.e., a snowsports helmet might also be approved for cycling if it meets the cycling safety standards).": ["CPSC", "EN 1078"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9161588146206/5058507-MCH02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8965294915614/5058507-MAT00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9161588146206/5058507-MCH02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8965294915614/5058507-MAT00.jpg"]}