{"name": "Baffin Hike Waterproof Winter Boots - Women's", "categories": ["Home", "All", "Footwear", "Boots", "Winter boots", "Active winter boots", "Hike Waterproof Winter Boots"], "description": "Give your feet a warm winter. A lightweight, waterproof, insulated hiking boot will do the trick. Easily compatible with snowshoes, the Hike Winter Boot's contoured midsole offers cushioned support for long hours on the snowshoe trails. A waterproof-breathable membrane keeps powder and slush on the outside where they belong, while synthetic hollow fibre insulation circulates heat to keep your toes cozy despite the uninviting temps outside. A super-grippy sole lets you hike confidently down snowy trails and slippery driveways.Soft shell uppers are nylon and synthetic leather.Waterproof-breathable membrane is seam-taped for no-nonsense weather protection.Synthetic hollow fibre insulation uses 4-channels to circulate warm air for all-day heat.Microfibre lining for a soft next-to-skin feel.Snowshoe ledge and tendon guard makes for easy snowshoe compatibility.TPU plate adds torsional rigidity and support.EVA midsole is contoured to absorb shock and cushion your step.High-grip supportive sole to keep you on your feet, regardless of the terrain you're tackling.Manufacturer's comfort rating is -20°C.", "product_code": "5059-673", "tech_specs": {"Weight": ["1.02kg (8)"], "Ideal for": ["Active winter wear"], "Height\n\nThe approximate boot height for the average person.": ["Above ankle"], "Insulation": ["200g synthetic insulation"], "Upper material": ["Synthetic leather", "Nylon"], "Lining material": ["Synthetic"], "Closure": ["Lace-up"], "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": ["Yes"], "Removable inner boot": ["No"], "Removable insole": ["Yes"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9057488896030/5059673-BKP88.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9057479163934/5059673-BKP88-ALT-SOLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9057488896030/5059673-BKP88.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9057479163934/5059673-BKP88-ALT-SOLE.jpg"]}