{"name": "Scarpa Ribelle Tech OD Boots - Men's", "categories": ["Home", "All", "Climbing", "Mountaineering and ice climbing", "Mountaineering boots", "Ribelle Tech OD Boots"], "description": "Rugged but featherweight boots for light-and-fast alpine missions. Inspired by the boundary-pushing mountaineer Ueli Steck, the innovative Ribelle Tech is an ultralight hybrid boot designed for alpinists or mountain guides who prize precision and lightness for a straight shot from valley floor to summit. Combining elements of trail running and mountaineering footwear, it offers incredible agility, control and grip along with big-day comfort. The S-Tech upper is a synthetic alternative to leather that provides durability and water resistance with a radical weight savings. It has a similar \"memory\" to leather, so it holds its shape over time once it's formed to your foot. A Kevlar®-reinforced integrated gaiter and tongue keep out snow and debris, and a quick-lace system makes life easier in frigid conditions or when you don't want to remove your gloves.Integrated Sock-Fit Plus gaiters and tongue are tough, Kevlar-reinforced S-Tech fabric for lightweight protection.Upper is KCN-Tech fabric, constructed from Cordura®, Kevlar and nylon for hard-wearing support.Outdry waterproof-breathable membrane is bonded to the external fabric to keep your feet dry and comfortable.Quick-lace system can be operated with cold or gloved fingers.Active Plus insole is made of fibreglass and polypropylene for cushioned control.Lightweight midsole has a medium density polyurethane heel and medial vertical grooves for cushion and support.Pentax Precision III outsole with Vibram Mont rubber compound for support and durability in extremely low temperatures.Compatible with hybrid crampon binding systems.", "product_code": "5059-624", "tech_specs": {"Weight": ["1.22kg (42)"], "Ideal for": ["Alpine climbing and mountaineering"], "Upper material": ["Synthetic"], "Closure": ["Lace-up"], "Rand\n\nRubber on the toe and around the boot improves durability. It can also increase grip while scrambling.": ["Full rand"], "Crampon compatibility\n\nRigid boots with defined toe and heel welts can use compatible step-in crampons or any other type of crampon. Rigid boots with a heel welt but no toe welt can use hybrid crampons or strap-on crampons. Semi-rigid boots can use strap-on crampons only.": ["Hybrid"], "Insulated": ["Yes"], "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": ["Yes"], "Removable inner boot": ["No"], "Removable insole": ["Yes"], "Made in": ["Italy"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8985465126942/5059624-BK064.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8986956333086/5059624-BK064-ALT-HEEL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8986956496926/5059624-BK064-ALT-LEFT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8986956529694/5059624-BK064-ALT-TOE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8986956627998/5059624-BK064-ALT-SOLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8986957053982/5059624-BK064-ALT-TOP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8985465126942/5059624-BK064.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8986956333086/5059624-BK064-ALT-HEEL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8986956496926/5059624-BK064-ALT-LEFT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8986956529694/5059624-BK064-ALT-TOE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8986956627998/5059624-BK064-ALT-SOLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8986957053982/5059624-BK064-ALT-TOP.jpg"]}