{"name": "Big Agnes mtnGLO Gear Loft", "categories": ["Home", "All", "Camping and hiking", "Tents and shelters", "Tent accessories", "Gear lofts, vestibules and tent add-ons", "mtnGLO Gear Loft"], "description": "Hang this gear loft inside a Big Agnes® Tent to store or dry your stuff. Built-in mtnGLO LED lights help you locate your headlamp, book or earplugs in the dark.Square loft has 2 small organizer pockets and dimensions of 33 x 33cm. Compatible with Big Agnes Big House 4, Big House 4 Deluxe, Big House 6 Deluxe, Blacktail 2, C Bar 2 and 3, Copper Spur HV UL4, Frying Pan SL2 and SL3, Rabbit Ears 4 and 6, Tumble 2 mtnGLO, Tumble 3 mtnGLO and Tumble 4 mtnGLO.Triangle loft has one small organizer pocket and dimensions of 15 x 51cm. Compatible with Big Agnes C Bar 2 and 3, Copper Hotel HV UL2 and UL3, Copper Spur 2 Platinum, Copper Spur 3 Platinum, Copper Spur HV2 Expedition, Copper Spur HV3 Expedition, Copper Spur HV UL1 and UL1 mtnGLO, Copper Spur HV UL2 and UL2 mtnGLO, Copper Spur HV UL3 and UL3 mtnGLO, Fly Creek HV1 Platinum, Fly Creek HV2 Platinum, Fly Creek HV UL1 and UL2, Flying Diamond 4, Frying Pan SL2 and SL3, Scout Plus UL2, Seedhouse SL1 and SL2, Tiger Wall UL2 and UL3, Tumble 2 mtnGLO, Tumble 3 mtnGLO and Van Camp SL3.Wall lot has 6 small organizer pockets and dimensions of 36 x 64 x 25cm. Compatible with Big Agnes Battle Mountain 3, Copper Spur 2 Platinum, Copper Spur 3 Platinum, Copper Spur HV2 Expedition, Copper Spur HV3 Expedition, Copper Spur UL2 Classic, Copper Spur UL3 Classic, Fly Creek HV UL3, Frying Pan SL2 and SL3, Manzanares HV SL1 mtnGLO, Manzanares HV SL2 mtnGLO, Manzanares HV SL3 mtnGLO, Manzanares HV SL4 mtnGLO, Scout UL2, Tiger Wall UL2 and UL3, Tumble 2 mtnGLO, Tumble 3 mtnGLO, Tumble 4 mtnGLO and Van Camp SL2.", "product_code": "5059-516", "tech_specs": {"Ideal for": ["Car camping", "Backpacking", "Winter and expedition camping"], "Attachment location": ["Wall", "Ceiling"], "Fits": ["Specific tent(s); see product description"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8951740465182/5059516-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8951767007262/5059516-BK000-ALT-TRIANGLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8951766384670/5059516-BK000-ALT-SQUARE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8951740465182/5059516-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8951767007262/5059516-BK000-ALT-TRIANGLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8951766384670/5059516-BK000-ALT-SQUARE.jpg"]}