{"name": "Fjallraven Raven 28L Backpack - Unisex", "categories": ["Home", "All", "Packs and bags", "Daypacks and school bags", "School and office packs", "Raven 28L Backpack"], "description": "An instant classic. This water-resistant daypack can handle cross-campus sprints and the flow of the weekend. Fjallraven fabric is hardwearing and durable, and it's water-resistant in case of a surprise shower. Subtle leather trim adds a touch of style, while padded shoulder straps make it easier to haul textbooks. A dedicated compartment cradles your laptop, while a huge main compartment holds everything else your day requires – workout clothes, lunch, wallet, keys and more.Made from Fjallraven's G-1000 Eco fabric, a super-durable blend of recycled polyester and organically grown cotton with a dense weave.Impregnated with Fjallraven's Greenland wax treatment for excellent water resistance. To make it waterproof, apply additional wax (sold separately).Classic leather trims add style.Comfortable, padded shoulder straps and back panel.Access the large main compartment via the wide clamshell zip.Front zippered organizer panel has internal mesh pockets.Dedicated padded compartment holds laptops up to 15in.2 side pockets hold water bottles or an umbrella.Fleece-lined pocket protects your phone or sunglasses.", "product_code": "5060-841", "tech_specs": {"Weight": ["965g"], "Ideal for": ["Casual wear", "School", "Office"], "Main fabric": ["Recycled polyester", "Cotton"], "Padded sleeve fits most\n\nA padded slot to fit electronics or laptops, it may be partially or fully padded on each side.": ["15-inch laptop"], "Access\n\nThe location of all access points into the main compartment of the pack.": ["Clamshell zip"], "Hipbelt": ["None"], "Volume": ["28L"], "Length": ["46cm"], "Width": ["31cm"], "Depth": ["28cm"], "Carry-on sized\n\nSize restrictions vary among airlines. Just to be sure, check with your carrier for their specific restrictions.": ["Yes"], "Made in": ["Vietnam"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8961890156574/5060841-SGR04.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8961890287646/5060841-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8961890156574/5060841-SGR04.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8961890287646/5060841-BK000.jpg"]}