{"name": "Deuter Kid Comfort Carrier - Infants", "categories": ["Home", "All", "Travel gear", "Child transport", "Child carrier backpacks", "Carriers", "Kid Comfort Carrier"], "description": "Introduce your little one to nature in 5-star comfort (for both parent and child). Parents will appreciate the super-breathable suspended mesh back system with extra cushy shoulder straps and hipbelt. Babies will love the adjustable height seat that lets them see the world. The soft, ergonomically shaped chin pillow (it's washable) is nice for napping en route. For trips above treeline, hook on the included sun roof to add protection from UV rays.Aircomfort Sensic Vario back panel uses a suspended mesh panel for maximum breathability.VariSlide back length adjustment lets either parent carry the child.PullForward hip belt with VariFlex padded hip fins is easy to adjust, even with heavy loads.Perforated shoulder straps, load lifter straps and adjustable chest strap provide a comfortable fit.Height-adjustable child seat and foot rests can be adapted for growing kids.Colour coordinated child safety harness is easy to use.Child cockpit area has ventilated mesh sides, soft fabric around the face and durable washable fabric by the feet.Ergonomically cushioned pillow with side supports cradles your child's head in any position for a comfortable sleep and is easily removed for washing.Sturdy aluminum frame is tip-resistant, has a locking base and folds for transport.Large zippered pocket under the child seat, large stretch front pocket, two stretch side pockets and zippered hip pockets.Long zippered compartment on the back stows the included sun roof, or carries your hydration reservoir (not included).3M reflectors add nighttime visibility.", "product_code": "5062-797", "tech_specs": {"Weight": ["3.1kg"], "Ideal for": ["Day hiking", "Travel"], "Main fabric": ["210-denier nylon"], "Child harness": ["5-point harness"], "Length": ["72cm"], "Width": ["43cm"], "Depth": ["34cm"], "Max carrying capacity\n\nThe maximum weight of the child.": ["22kg"], "Fold out leg\n\nA kickstand to ease putting on and taking off the carrier.": ["Yes"], "Frame material": ["Aluminum"], "Additional feature(s)": ["Hipbelt pocket(s)", "Reflective details", "Sun hood included"], "Made in": ["Vietnam"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146820591646/5062797-MRM34.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146812071966/5062797-MRM34-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146812137502/5062797-MRM34-ALT-BLADDER.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146812104734/5062797-MRM34-ALT-SUNSHADE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146820591646/5062797-MRM34.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146812071966/5062797-MRM34-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146812137502/5062797-MRM34-ALT-BLADDER.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146812104734/5062797-MRM34-ALT-SUNSHADE.jpg"]}