{"name": "Osprey Kestrel 38L Pack - Unisex", "categories": ["Home", "All", "Camping and hiking", "Packs", "Backpacking packs", "Overnight packs (35 - 55l)", "Kestrel 38L Pack"], "description": "A durable pack with crossover potential. Use the Kestrel 38 for gear-intensive trips to tag summits, or for pared-back overnight backpacking. With a robust harness, you can carry up to 18kg. Use the attachment points to add sleeping equipment and rig it for backpacking or mountaineering. No matter what you put inside, the LightWire™ frame transfers weight to a comfortable spacer mesh harness and hipbelt. This suspension system ensures all-day carrying comfort, especially in warm conditions when the mesh back panel provides airflow around your torso.Made of durable fabrics that stand up to sandstone canyons and alder-filled bushwhacks. Base and high-wear areas use abrasion-resistant nylon packcloth.Peripheral frame and framesheet effectively transfer the load to the hipbelt and spread it across the entire back panel.Mesh-covered ridged foam back panel provides ventilation and keeps the load close to the body.Height-adjustable harness lets you dial in the fit for your torso length.Bottom zippered compartment provides a dedicated home for your sleeping bag.Stretch-mesh front and side pockets let you stash gear on the fly.Zippered side, hipbelt and lid pockets provide secure storage.Dual tool loops with bungee tie-offs carry ice axes.Stow-on-the-Go trekking pole attachments let you stash your poles without removing the pack.Side compression straps cinch in the load.Bottom sleeping bag straps, front daisy chain and lid webbing loops let you lash on extra gear.External access hydration sleeve makes refilling easy and protects pack contents from spills. Reservoir sold separately.Integrated rain cover keeps your stuff dry during wet trips.", "product_code": "5063-811", "tech_specs": {"Weight": ["1.46kg (Small/Medium)", "1.54kg (Medium/Large)"], "Ideal for": ["Backpacking", "Alpine climbing and mountaineering", "Day hiking"], "Main fabric": ["210-denier nylon"], "Secondary fabric": ["420-denier nylon"], "Access\n\nThe location of all access points into the main compartment of the pack.": ["Top", "Bottom"], "Hipbelt": ["Padded"], "Lid type\n\nSome pack lids can be adjusted to compensate for overloaded packs, or even removed, and some removeable lids have tuck-away hipbelts that allow youto use them as a waistpack.": ["Fixed"], "Volume": ["36L (Small/Medium)", "38L (Medium/Large)"], "Length": ["75cm"], "Width": ["31cm"], "Depth": ["29cm"], "Ventilated back panel": ["No"], "Dynamic suspension\n\nThe hipbelt and/or shoulder straps of the pack are designed to move, pivot or flex to follow your body’s movements.  Each brand uses their own technology.": ["No"], "Carry-on sized\n\nSize restrictions vary among airlines. Just to be sure, check with your carrier for their specific restrictions.": ["No"], "Additional feature(s)": ["Compression straps", "Hipbelt pocket(s)", "Hydration compatible (reservoir sold separately)", "Ice axe/pole attachment", "Rain cover included", "Sleeping bag compartment"], "Made in": ["Vietnam"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9005531365406/5063811-PCG00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9005826408478/5063811-PCG00-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9005531365406/5063811-PCG00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9005826408478/5063811-PCG00-ALT-BACK.jpg"]}