{"name": "MEC Slogg HD 70L Dry Pack - Unisex", "categories": ["Home", "All", "Watersports", "Kayaking", "Dry bags", "Slogg HD 70L Dry Pack"], "description": "Save your shoulders for paddling. A proper pack frame (the same one used in our expedition packs) transfers weight efficiently to your hips. The more you portage, the more you’ll love it. Since the frame is welded rather than sewn on, the pack delivers uncompromised dunk protection. HD stands for \"heavy duty\" – this dry bag stands up to any adventure. 70L capacity is enough to hold your tent, sleeping bag, sleeping pad, camp kitchen and more.Made of rugged tarpaulin fabric: high-denier nylon, polyurethane-coated on both sides for lasting waterproofness. PVC-free.Seams are radio-frequency welded to stop water from getting in.Stiffened roll closure is highly water-resistant (though not waterproof through indefinite submersion).Contoured, padded shoulder straps have stabilizer straps, and are adjustable for different back lengths.Padded EVA back panel has 2 curved aluminum rods and a framesheet with an aluminum stay. Provides great support and effectively transfers weight to the hipbelt.Fixed hipbelt with a V-pull adjustment for quick and painless adjustment on the fly.Laser-cut drain holes between welded layers of the back panels allow the foam to dry if water seeps in.Tie points: 1 front, 1 bottom, 2 on each side and 1 above the back panel.", "product_code": "5063-652", "tech_specs": {"Weight": ["2.50kg"], "Ideal for": ["Canoe tripping"], "Closure": ["Roll-top"], "Material": ["840-denier PU-coated nylon"], "Ruggedness\n\nFair: made of lightweight materials and designed to be carried inside another bag. Good: strikes a balance between light weight and durability. Excellent: made of heavy duty materials and designed to be carried alone. Exceptional: made of ultra-tough materials and designed to withstand abuse.": ["Exceptional"], "Waterproofness\n\nWaterproof bags and cases are made with waterproof materials and have waterproof closures. Some are designed to be submersible. Water-resistant bags and cases are made with waterproof materials, but water could sneak in through the seams or closure.": ["Waterproof"], "Submersible": ["No"], "Hipbelt": ["Padded"], "Volume": ["70L"], "Length": ["86cm"], "Width": ["40cm"], "Depth": ["30cm"], "Adjustable shoulder harness\n\nAn adjustable harness lets you change the height of the shoulder straps to fit your specific back length.": ["Yes"], "Additional feature(s)": ["Compression straps"], "Made in": ["Philippines"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9014170255390/5063652-DLB00.jpg"]}