{"name": "Kombi The Timeless Gloves - Women's", "categories": ["Home", "All", "Clothing", "Clothing accessories", "Gloves and mittens", "Gloves", "The Timeless Gloves"], "description": "Insulated gloves for warm hands and a good grip when hitting the slopes or swinging an ice axe. The Timeless Gloves feature a polyester shell with leather trim for extra durability, and a waterproof-breathable GORE-TEX® membrane to resist wetness. Primaloft® Gold insulation wraps hands in warmth, and a wool-blend lining wicks moisture to keep your fingers dry and comfortable. The palm is a mix of leather and synthetic leather for a firm grip on ice tools, ski poles or handshakes if you do some impromptu networking on the chairlift.Shell is polyester with leather trim for durable weather protection.Waterproof-breathable GORE-TEX® membrane with Gore Warm technology to keep your hands warmer longer in all conditions.Primaloft® Gold polyester microfibre insulation offers 360 degrees of warmth.Leather and synthetic leather palm is durable and grippy.Wool-blend lining wicks moisture and is naturally antimicrobial.Adjustable wrist strap and cuff drawcord seals out snow and drafts.", "product_code": "5063-355", "tech_specs": {"Ideal for": ["Downhill skiing", "Backcountry skiing", "Snowboarding", "Snow and ice climbing"], "Type": ["Gloves"], "Insulation": ["Extra heavy"], "Main fabric": ["100% polyester"], "Liner fabric": ["80% polyester", "20% wool"], "Palm material\n\nThe type of material used on the palm of the glove. Grippy palms have a raised silicone or polyurethane pattern to improve grip and are most often seen on cycling and paddling handwear.": ["Leather", "Synthetic leather"], "Liner type": ["Sewn-in"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["Windproof"], "Hand warmer pocket\n\nThe gloves or mitts feature a small pocket to insert a heater pack for extra warmth.": ["No"], "Touchscreen compatible": ["No"], "Waterproof": ["Yes"], "Additional feature(s)": ["Nose wipe"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8988863922206/5063355-BK000.jpg"]}