{"name": "Goal Zero Sherpa 100 AC Power Bank", "categories": ["Home", "All", "Camping and hiking", "Electronics", "Chargers and adapters", "Portable chargers and power banks", "Sherpa 100 AC Power Bank"], "description": "Off the grid doesn’t mean what it used to. Whether you’re in the backcountry, the international terminal, or just a crowded coffee shop, the Sherpa 100AC powers all of your electrical devices. With Qi wireless charging, you can lay your smartphone on top of the 100AC to start charging. When you need a physical connection, use the 3 cables stealthily tucked away on the sides of the unit. 2 USB type A, 2 USB-C and an AC port (for grounded and ungrounded plugs) can run almost anything, from phones, tablets and laptops to camera battery chargers. The onboard digital display provides info for port-by-port input/output Watts, battery capacity, runtimes, charge times, etc. No need to look for a plug or put your life on hold, the 100AC will keep your devices up and running.Qi wireless charging (5W max) lets you put your phone on the Sherpa 100AC to start charging (phone must support wireless charging).Integrated 100W AC inverter (modified-sine wave) plugs into standard wall plugs (accepts both grounded and non-grounded plugs). With up to 150W surge protection you can use your devices with confidence, just like you would at home.Dual USB-C power delivery (PD) ports deliver 60W each, keeping your power-hungry devices fed and ready to go.Dual USB-A ports (2.4A) are there for you, great for devices with proprietary charging cables e.g. fitness trackers, smart watches, etc.OLED display is power efficient and tells you how much power you are getting and using, as well as battery charge capacity, and time remaining under current load. You can even get really nerdy with your power usage, if you want to; with port by port usage reports and analysis, battery temperature, and more.Fast charging via USB-C PD (60W) in just 2.5 hours! Also charges via regular USB in 9 (2.4A) hours.8mm DC input plug works with compatible solar panels going from 0 to full in 4 -28 hours (bigger and more efficient panels take less time). Also works with 12V adapters or AC adapters (neither included).Included charging cables store right on the device.On average, the 100AC can charge a POV camera 18 times, a smartphone 10 times, a tablet 3 times and a laptop twice. Exact charging numbers will vary with your battery’s capacity.Li-NMC (lithium nickel manganese cobalt oxide) battery offers a longer life than standard lithium-ion batteries and better inherent safety.Battery can be kept plugged into a power source during storage, or fully-charge your Sherpa 100AC every 3-6 months and store in a cool, dry place.Pass-through charging lets you use your Sherpa 100AC as a back-up power sources should the power got out. If you use your Sherpa 100AC as back-up power, make sure it will support your devices needs, and make yourself aware of how long it will power your device.Peak capacity is 94.7 Wh (14.8V, 64Ah) and last through hundreds of cycles.Smart management system provides charging (solar or mains) and low-battery protection built-in.Operating temp is 0-40°C.In the box: Sherpa 100AC, USB-C to USB-C cable (male-to-male), Lightning cable (male-to-male), micro USB cable (male-to-male), 76cm (30 in.) USB-C cable (male-to-male).When solar recharging your Sherpa 100AC, take note of the voltages of the solar panels and do not exceed 22V. Individual solar panels, or solar panels chained in series in excess of 22V cannot be used with the Goal Zero Sherpa 100AC and can cause serious damage to the unit.", "product_code": "5064-569", "tech_specs": {"Weight": ["898g"], "Ideal for": ["Everyday use", "Travel", "Emergency preparedness"], "Chemistry": ["Lithium nickel manganese cobalt oxide"], "Output voltage": ["5-110volts"], "Capacity": ["25.6Ah"], "Dimensions": ["19 x 14.4 x 2.5cm"], "Rechargeable": ["Yes"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9000515502110/5064569-SIL00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9000653029406/5064569-SIL00-ALT-LIFESTYLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9000653455390/5064569-SIL00-ALT-INCLUDED.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9000653783070/5064569-SIL00-ALT-LIFESTYLE2.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9000654176286/5064569-SIL00-ALT-ANGLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9000654274590/5064569-SIL00-ALT-PORTS.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9000515502110/5064569-SIL00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9000653029406/5064569-SIL00-ALT-LIFESTYLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9000653455390/5064569-SIL00-ALT-INCLUDED.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9000653783070/5064569-SIL00-ALT-LIFESTYLE2.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9000654176286/5064569-SIL00-ALT-ANGLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9000654274590/5064569-SIL00-ALT-PORTS.jpg"]}