{"name": "Reynolds Cycling 29in. TR249 Wheelset", "categories": ["Home", "All", "Cycling", "Bike components", "Tires, tubes, wheels and hubs", "Bike wheels", "Wheelsets", "29in. TR249 Wheelset"], "description": "A stiff, strong, light set of wheels that'll change how your XC and trail bike rides for the better. The asymmetric carbon rims of the TR line allow even tension on either side to increase durability and ride quality. Slap your favourite tubeless tires on the 24mm rim and let your grin grow. When compared to the next best option from Reynolds, you get the exact same carbon rims, but laced to a different hub that offers 10° of hub engagement. No need to choose between a light wheelset that climbs or a stiff one that corners, the TR line checks both boxes.Hookless tire bead that is tubeless ready for a burp-free tire fit and easy inflation.Rim uses the Reynolds MR5 construction technology.Asymmetric rim profile allows for even spoke tension to create a stiff and durable wheel.Rim depth of 25mm allows for a compliant ride.Internal width of 24mm and external width of 29mm plays nice with modern tires.28 spokes laced in a 3-cross pattern in the front and rear for durability.Boost hub spacing helps with stiffness and durability.Front hub uses a 15x110mm axle. Rear is 12x148mm.Reynolds TR3 mountain hubs features fast and smooth rolling bearings.10° of hub engagement uses a 3-pawl freehub design.XD driver is compatible with XD cassettes.Compatible with Centerlock rotors. Adapter included for 6-bolt rotors.", "product_code": "5064-658", "tech_specs": {"Weight": ["1.59kg"], "Ideal for": ["Enduro", "Trail riding"], "Material": ["Carbon fibre"], "Size": ["29in."], "Tire type": ["Tubeless", "Clincher"], "Retention device": ["Thru-axle 15 mm front / 12 mm rear"], "Brake compatibility": ["Disc brakes"], "Valve compatibility\n\nThe type of tube valve the rim will accommodate. Most Schrader wheels can be retrofitted to fit Presta valves.": ["Presta"], "Front hub width\n\nThe hub width must fit the inside distance between the two fork ends (dropouts).": ["110mm"], "Rear hub width": ["148mm"], "Hub (front)": ["Reynolds TR3"], "Hub (rear)\n\nThe hub affects a bike’s rolling efficiency. Internally geared hubs require significantly less maintenance.": ["Reynolds TR3"], "Spoke count": ["28"], "Spokes": ["Stainless"], "Rims": ["Reynolds TR249"], "Made in": ["Taiwan"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8998914424862/5064658-BK000.jpg"]}