{"name": "Arc'teryx Beta AR Gore-Tex Jacket - Men's", "categories": ["Home", "All", "Clothing", "Jackets", "Rain jackets", "Beta AR Gore-Tex Jacket"], "description": "The \"AR\" stands for \"All Round\", fitting for a waterproof breathable jacket that Arc'teryx calls the most versatile shell in their line. For climbing, skiing, hiking and just being outdoors, the Beta AR offers comfort, mobility and bunker-like protection from stormy weather. A fully adjustable drop hood, drawcord hem and die-cut cuff adjusters let you really batten down the hatches, while underarm vents keep you comfortable when you're on the move. The front zip, vents and pockets all feature top quality water-resistant zippers and the overall build quality is top-notch, with tight seam tolerances, weight-saving narrow seam tape and articulated construction that accommodates any move you need to make.Completely waterproof, breathable and durable GORE-TEX Pro construction.40-denier face fabric is lightweight and hard-wearing, with abrasion-resistant 80-denier reinforcement in key areas.Micro seam allowance of 1.6mm and extra narrow 8mm seam tape reduce bulk and weight.Articulated construction facilitates dynamic moves in mountain environments.Underarm gussets keep jacket from lifting when you're reaching overhead.Adjustable drop hood is helmet-compatible, with a laminated brim to deflect rain and snow.Tall collar with brushed microsuede chin guard.Highly water-resistant external zippers used throughout.Pit zips for easy venting.High volume hand pockets.Internal chest pocket with laminated zip.Laminated, die-cut Velcro® cuff adjusters reduce bulk, and won't catch or tear off.Drop hem provides extensive coverage, with cordlock adjusters.Regular fit accommodates multiple thermal layers.", "product_code": "6001-105", "tech_specs": {"Weight": ["455g (Medium)"], "Ideal for": ["Alpine climbing and mountaineering", "Backcountry skiing", "Camping and hiking"], "Type": ["Waterproof-breathable"], "Technology": ["GORE-TEX Pro"], "Construction": ["3-layer"], "Face fabric": ["40-denier nylon"], "Lining/backer": ["40-denier nylon"], "Fabric waterproof rating\n\nThe standard test for waterproof fabrics uses a standing column filled with water.  The figures given are the water column height.  A rating of 3,500mm or higher can be considered waterproof.  The higher the rating, the more durable the waterproof fabric will be over time.": ["28,000mm"], "Waterproofness\n\nWaterproof garments use waterproof-breathable technologies and are fully seam-taped. Water-resistant garments use waterproof-breathable technologies but their seams are not taped. Water-resistant garments repel water and protect against wind but are not made of waterproof fabric.": ["Waterproof with fully taped seams"], "Fabric active breathability\n\nThe rate at which a waterproof breathable fabric expels moisture when the inner surface is moist from perspiration.  Values under 8,000g/m2/24h provide low performance, 20,000g/m2/24h provide moderate performance and values over 30,000g/m2/24h provide high performance.": ["25,000g/m2/24h"], "Venting": ["Underarm zips"], "Pockets": ["2 front zippered", "1 internal zippered"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["Windproof"], "Length": ["Hip-length"], "Durable water repellency\n\nUsually referred to as DWR. A treatment made to fabrics that causes water to bead and run off instead of soaking through.": ["Yes"], "Hood": ["Adjustable", "Helmet-compatible"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9131593498654/6001105-RHA00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9147019329566/6001105-KIN01.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9131593498654/6001105-RHA00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9147019329566/6001105-KIN01.jpg"]}