{"name": "Head Edge LYT 80 W Ski Boots - Women's", "categories": ["Home", "All", "Ski and snowboard gear", "Downhill skiing gear", "Downhill ski boots", "Edge LYT 80 W Ski Boots"], "description": "Ski all-day in comfort. These easy entry boots are this season’s fun-pass. A fully-featured all-mountain ski boot, its sleek shape locks your foot in place. The lightweight PU shell transmits power directly to your ski. And a heat mouldable liner, sculpted for women’s feet, creates a smooth cushion between you and the shell. In total comfort, channel your energy into carving the slopes.PU shell provides light support for efficient power transmission.Medium flex suits intermediate and experienced skiers.Adjustable flex changes the boot’s performance from 70 to 80.Perfect Fit liner moulds to your foot with or without heat and can be re-moulded.Double adjustable cuff gets the shell height just right.Closures include 4 micro-adjusting low profile buckles with 1 supermacro ratchet.35mm Velcro strap securely tensions the cuff.Turn key adjusts boot width from 98-102mm.GripWalk option for soles.", "product_code": "6002-989", "tech_specs": {"Ideal for": ["Downhill skiing"], "Boot/binding compatibility\n\nThe boot and binding systems must match for best performance and safe use.": ["Downhill", "GripWalk"], "Buckles": ["4"], "Lower shell material": ["Polyurethane"], "Shell cuff material": ["Polyurethane"], "Sole type\n\nAlpine Touring: with tread; compatible with DIN touring bindings. Alpine Touring Tech (Tech): with tread; compatible with G3 Onyx and Dynafit. Downhill: without tread; compatible with freeride/downhill bindings.": ["Downhill"], "Flex index\n\nIndicates how stiff the boots are when flexed forward.  Flex ranges from 50 (soft) to 130 (very stiff). Note: There is currently no industry standardized test.": ["80"], "Last width\n\nThe width of the interior of the boot shell across the widest part of the forefoot.": ["98-102mm"], "Lace-up option": ["No"], "Thermoformable inner boot": ["Yes"], "Hike mode\n\nA mechanism that allows to release the boot cuff to switch to tour mode.": ["No"], "Made in": ["Czech Republic"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9053738500126/6002989-BK545.jpg"]}