{"name": "Salomon QST 118 Skis - Unisex", "categories": ["Home", "All", "Ski and snowboard gear", "Downhill skiing gear", "Downhill skis", "QST 118 Skis"], "description": "With a positively plump 118 mm waist, the QST 118 floats like a dream on bottomless days, but the layers of carbon and flax (C/FX 3 superfibre) and the twin rocker shape provide stability and predictability for the hard stuff. It all adds up to a pair of versatile skis for resort laps and for big swishy turns in all conditions from powder to the chunder.Inverted 3D wood core offers great stability and rebound.Layer of carbon and flax laminate keeps the weight low while increasing the ski's dampness.Twin rocker offers maximum float and a surfy, playful feel in deep snow.Full sandwich construction features ABS sidewall all around the ski for increase durability and strength.5-point sidecut improves steering in mixed snow and makes for a quick and agile ski.Cork insert in tip reduces chatter for confidence-boosting stability.Glossy topsheet looks sharp and won't hold snow.", "product_code": "6003-836", "tech_specs": {"Weight": ["3.96kg (185cm)"], "Ideal for": ["Freeride and freeskiing", "Downhill skiing"], "Snow conditions": ["Powder"], "Terrain": ["Off-Piste"], "Ability\n\nBeginner: new or getting back into skiing.  Intermediate: confident with turning and stopping.  Advanced: highly confident carver. Expert: steeps, drops, park, double blacks -- bring it on.": ["Advanced", "Expert"], "Construction\n\nSandwich and combination construction is generally used for big freeride-style skis while the lighter structural cap type of construction is more commonly found on cross-country skis.": ["Sandwich"], "Core": ["Wood"], "Rocker/camber profile": ["Rocker tip", "Rocker tail"], "Dimension": ["139-118-126mm (171cm)", "140-118-127mm (178cm)", "142-118-129mm (185cm)", "143-118-130mm (192cm)"], "Turning radius": ["22m (171cm)", "24m (178cm)", "26m (185cm)", "27m (192cm)"], "Bindings included": ["No"], "Made in": ["Austria"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9055728533534/6003836-NOC02.jpg"]}