{"name": "Salomon S/Pro 90 Ski Boots - Women's", "categories": ["Home", "All", "Ski and snowboard gear", "Downhill skiing gear", "Downhill ski boots", "S/Pro 90 Ski Boots"], "description": "Perfection in every turn and comfort on every run. Highly customizable, these boots have a thermo-mouldable shell and performance liner. A stiff fibreglass frame makes them responsive and nimble on no matter where you turn. With adjustable flex, you can tailor the boot's stiffness for any run. Plus, the S/Pro boots are the most comfortable Salomon has ever crafted, so you'll ride better because there is nothing to distract you from your line.Polyurethane shell with fibreglass framing transfers power efficiently to your ski.Coreframe 360 allows customization of the shell, cuff and liner.Shell can be thermo-moulded for personalized performance.Seamless liner can be thermo-moulded for a refined custom fit.Women's specific cuff and liner are tailored to female anatomy.4 aluminum micro-adjust buckles secure your foot in a snug fit.35 mm strap adds extra support at the top of the cuff.Adjustable flex lets you tweak the boot's stiffness.Oversized pivot transfers power smoothly.Normal width in a 100mm last.Alpine soles and GripWalk-ready.", "product_code": "6003-823", "tech_specs": {"Weight": ["1.62kg (24.5)"], "Ideal for": ["Downhill skiing"], "Boot/binding compatibility\n\nThe boot and binding systems must match for best performance and safe use.": ["Downhill", "GripWalk"], "Buckles": ["4"], "Lower shell material": ["Polyurethane"], "Shell cuff material": ["Polyurethane"], "Sole type\n\nAlpine Touring: with tread; compatible with DIN touring bindings. Alpine Touring Tech (Tech): with tread; compatible with G3 Onyx and Dynafit. Downhill: without tread; compatible with freeride/downhill bindings.": ["Downhill"], "Flex index\n\nIndicates how stiff the boots are when flexed forward.  Flex ranges from 50 (soft) to 130 (very stiff). Note: There is currently no industry standardized test.": ["90"], "Last width\n\nThe width of the interior of the boot shell across the widest part of the forefoot.": ["100mm"], "Lace-up option": ["No"], "Thermoformable inner boot": ["Yes"], "Hike mode\n\nA mechanism that allows to release the boot cuff to switch to tour mode.": ["No"], "Made in": ["Romania"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132499697694/6003823-WBG02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9057496989726/6003823-BBE04.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132499697694/6003823-WBG02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9057496989726/6003823-BBE04.jpg"]}