{"name": "SWEET PROTECTION Trooper II MIPS Helmet - Unisex", "categories": ["Home", "All", "Ski and snowboard gear", "Ski and snowboard helmets", "Trooper II MIPS Helmet"], "description": "Like a helmet from the future. Designed for freeriders, it's easy to adjust and comfort-focused. Carbon-fibre shell inserts amp up protection when you're heading for the backbowl. Plus, MIPS technology helps protect your brain from rotational forces or sudden impacts. With great venting and audio compatibility, it's easy to ride in all day.Thermoplastic and carbon-laminated shell provides incredible strength and durability.Multi-directional Impact Protection System protects your brain from rotational forces.Integrated impact shields offer increased protection at vulnerable areas.EPS inner absorbs and dissipates shock in the event of an impact.Vented shell and liner keeps airflow moving through.Dial fit allows easy and quick adjustment for all-day comfort.Quick dry liner can be removed for easy washing.Magnetic chin buckle releases to the side.Audio compatible.", "product_code": "6003-608", "tech_specs": {"Weight": ["680g (Medium/Large)"], "Ideal for": ["Freeride and freeskiing", "Backcountry skiing"], "Construction\n\nMicroshell helmets are made of a thin polymer sheet over a foam liner; Hardshell helmets have a hard polymer outer shell and a foam liner; when the liner is being bonded to the outer shell during the manufacturing process, it is Molded in the shell.": ["Hardshell"], "Shell material": ["Carbon-reinforced plastic"], "Fit system": ["Adjustable dial"], "Inner material": ["EPS (expanded polystyrene)"], "Vents": ["Yes"], "Goggle clip": ["Yes"], "Removable ear liners": ["Yes"], "Approved for\n\nMost helmets are tested and certified for a specific sport. Some helmets are approved for multi-sports, but only after passing the safety tests for both sports (i.e., snowsports and cycling).": ["Snowsports"], "Safety rating\n\nCetification is established by a variety of governing bodies who set impact standards. Most helmets are certified or approved for a specific sport, except in the case of multi-sport helmets (i.e., a snowsports helmet might also be approved for cycling if it meets the cycling safety standards).": ["EN 1077 B", "ASTM F2040"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9043340886046/6003608-PGM04.jpg"]}