{"name": "Smith Skyline XL OTG Goggles - Unisex", "categories": ["Home", "All", "Ski and snowboard gear", "Ski and snowboard goggles", "Skyline XL OTG Goggles"], "description": "Distortion free viewing and cutting-edge lenses. With a rim-less design, the Skyline offers and expansive field of view and is equipped with 3-layer foam so they feel comfortable from first run to last.Designed for medium to large faces.ChromaPop lenses deliver exceptional clarity, high contrast, and dynamic colour optimization, making them great for challenging light conditions.Spherical Carbonic-X lens has crisp TLT optics for distortion free viewing and a 5X anti-fog inner lens.Thermal lens eliminates fog during rapid elevation changes.Responsive Fit design contours of a variety of face shapes.3-layer DriWix foam provides a comfortable, breathable seal.Wide, silicone backed strap has a quick-fit adjustment system and a clip buckle.Includes a microfiber goggle bag.", "product_code": "6004-065", "tech_specs": {"Ideal for": ["Downhill skiing", "Backcountry skiing", "Snowboarding"], "Visible Light Transmission\n\n0-10% – very heavy tint, too dark for most needs. \n10-30% – heavy tint for bright sunny days.\n20-60% – light tint, great for cloudy, overcast conditions and shady trails. \n60-80% – very light tint (often coloured), for improving contrast in low-light conditions, think dawn or dusk. \n80-100% – little to no tint, this what you want in the dark.": ["12%"], "Helmet compatible": ["Yes"], "Scratch-resistant lens": ["Yes"], "Vents\n\nVents allow airflow through the goggles which helps to prevent fogging.": ["Yes"], "Fits over most eyewear\n\nThese optics are designed to fit comfortably over most eyewear.": ["Yes"], "Anti-fog coating\n\nA coating on the inside of the lens that inhibits condensation.": ["Yes"], "100% UV protection\n\nProvides 100% protection against UVA and UVB rays.": ["Yes"], "Made in": ["USA"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9125756567582/6004065-BSB04.jpg"]}