{"name": "Fischer Twin Skin Pro Medium IFP Skis", "categories": ["Home", "All", "Ski and snowboard gear", "Cross country skiing gear", "Cross country classic", "Classic skis", "Twin Skin Pro Medium IFP Skis"], "description": "Give a little kick. Don’t let hard pack or icy slopes hold you back. Twin Skin technology gives you plenty of reliable kick action and good glide. While already lightweight and stable, volcanic basalt fibres lighten the load even more and add nice flex.Twin Skin technology uses two separate mohair mix skin strips in offset positions to achieve smooth and balanced gliding without grip wax.Air core basalite technology provides lightness, torsion-free construction and highly stable sidewalls.Volcanic basalt fibres reduce the weight even further, while providing excellent flex characteristics.Mounting plate accepts compatible IPF bindings (bindings sold separately).", "product_code": "6004-158", "tech_specs": {"Weight": ["1.33kg (197cm)"], "Ideal for": ["Fitness classic skiing"], "Construction\n\nSandwich and combination construction is generally used for big freeride-style skis while the lighter structural cap type of construction is more commonly found on cross-country skis.": ["Structural cap"], "Core": ["Air Core Basalight"], "Dimension (all lengths)": ["41-44-44mm"], "User weight range\n\nA good starting point for selecting ski or snowboard length. You might choose a shorter or longer length based on terrain and ability.": ["55-64kg (187cm)", "60-74kg (192cm)", "65-79kg (197cm)", "70-84kg (202cm)", "80-94kg (207cm)"], "Waxless\n\nOften called \"fish scale\" skis, waxless skis are designed so you don't need to apply kick wax. However, you may still want to apply glide wax for a better glide. They are a good option for those who don't like waxing, or for regions where temperatures can vary greatly throughout the day.": ["Yes"], "Metal edge": ["No"], "Bindings included": ["No"], "Made in": ["Ukraine"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9047301193758/6004158-NOC02.jpg"]}