{"name": "Black Diamond Sprint 225 Headlamp", "categories": ["Home", "All", "Camping and hiking", "Headlamps and lighting", "Headlamps", "Sprint 225 Headlamp"], "description": "Easy to charge, easy to use and easy to bring along, this headlamp is ready to run. With its low-profile housing, custom engineered reflector and stabilizing head strap, the Sprint 225 is a running buddy you can count on. The efficient internal battery charges via USB, making it easy to top-up nearly anywhere. Classic Black Diamond features like PowerTap™ and smooth dimming add to this compact light’s list of accomplishments.Smooth dimming feature lets you dial in the perfect brightness.PowerTap technology goes from any brightness mode to full power with a tap on the light's housing. Tap again to return to the previous output.Mode memory remembers the last setting used and turns the light on in that setting.Multi-faceted lens balances flood and spot lighting.Vari-width elastic headband is wider at the front, offering more stability when on the move.Strobe mode helps keep you seen.Intuitive 1-button controls are easy to navigate with or without gloves.IPX4 waterproofing keeps your light shining in heavy downpours, sleet, snow or pretty much any condition that is less than ideal.USB recharging makes it easy to charge your light, taking 3 hours to fully charge from a computer’s USB port.Multiple setting, 3-level LED power meter lets you know how your batteries are doing both in use and when charging.Lock-out mode prevents accidental activation, so you don’t pull out a dead headlamp just when you need it.", "product_code": "6005-154", "tech_specs": {"Weight": ["56g"], "Ideal for": ["Trail running", "Camping and hiking", "Travel"], "Light modes\n\nThe number of lighting levels/modes the light has (i.e., low, med, high, flash).": ["3 modes"], "Beam distance - low": ["6m"], "Beam distance - high": ["42m"], "Boost mode\n\nBriefly increases the light output to maximum brightness and distance.": ["No"], "Light source": ["1 LED"], "Max light output\n\nThe total quantity of light emitted in every direction from a source of light; measured in lumens.": ["225 lumens"], "Beam pattern\n\nBeam pattern affects how much you can see within the area of light thrown from the headlamp. Wide beams are good for close-up; spot or focussed beams are good for long range visibility.": ["Wide", "Spot"], "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": ["IP X4"], "Rechargeability\n\nRechargeable lights give you hassle-free recharging with almost any power source. Replaceable batteries provide instant power, but you’ll need to bring extra batteries, recycle used ones and buy new ones.": ["Rechargeable"], "Red light mode": ["No"], "Regulated output\n\nOn regulated lights brightness is consistent, and does not decrease gradually as the batteries are drained.": ["No"], "Batteries": ["Lithium-ion 750mAh (included)"], "Flash mode": ["Yes"], "Product sustainability": ["Rechargeable batteries"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9064219181086/6005154-OCT03.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9064219148318/6005154-GRA00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9064219181086/6005154-OCT03.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9064219148318/6005154-GRA00.jpg"]}