{"name": "Intense 2020 Carbine 29 Pro Bike - Unisex", "categories": ["Home", "All", "Cycling", "Bikes", "Mountain bikes", "2020 Carbine 29 Pro Bike"], "description": "If you can dream it, the Carbine will ride it. A blend of Enduro-worthy components means this bike can take whatever you can throw at it. It has the fast rolling momentum of a 29er, and is fully capable of more. With 160mm in the front and 155mm in the rear, it has the travel needed to shred the EWS, but the slacker head tube angle (65.5°) and shorter chainstays give it nimble handling and level-headed predictability. The long wheelbase holds traction when you’re pushing the margins on fast descents without losing the fun factor in tight corners and drops. The Pro build draws on a golden mix of SRAM X01 and GX Eagle components for a light and reliable setup. A Shimano XT M8000 brakeset keeps things under control when you're coming in a bit too hot. Bottom line: you won't feel under-biked anywhere you ride this rig.Monocoque unidirectional carbon frame and top link provides a light, stiff and compliant ride.JS Tuned rear linkage results in efficient and balanced ride on climbs or descents.i-BOX Pivot System allows for compact seat stays and a shortened wheelbase for a remarkably nimble and efficient ride.Tapered headtube shaves grams and improves stiffness.Internal routing prevents cable rattle and keeps them protected.FOX Factory Float 36 has 3 compression positions, low-speed compression and rebound adjustment.FOX Factory Float X2 rear shock takes care of the 155mm of travel.FOX Transfer seatpost offers 125mm (S) 150mm (M/L) or 175mm (XL) of travel.1x12 SRAM X01 and GX Eagle groupset leverages a massive 10-50 cassette.Truvativ Descendant crank is paired to a 32T ring.Shimano XT M8000 hydraulic disc brakes with 180mm rotors in the front and rear.780mm wide Intense Recon carbon handlebars provide a comfortable riding position.Fabric Scoop Radius Elite saddle is ultra comfy.148x12mm spacing in the rear and 110x15mm in the front boosts stiffness.DT Swiss M1700 Spline wheels have an internal width of 30mm and are tubeless-ready.Maxxis Minion DHR II tires offers the traction required for fast and steep descents.Bikes are covered by MEC's Rocksolid Guarantee and Bike Service Agreement. You can bring your Intense Bike to any MEC bike shop for free adjustments and minor maintenance for 1 year after purchase.Includes an Intense gift box with over $150 of free stuff – like a torque wrench set, shock pump, and extra valve stems for going tubeless.Based in Temecula, California, Intense Cycles have been building aggressive, game-changing and flat-out rad mountain bikes since 1993.", "product_code": "6005-829", "tech_specs": {"Ideal for": ["Enduro", "Trail riding"], "Frame": ["Intense Carbine SL carbon"], "Front travel": ["160mm"], "Fork": ["Fox Float 36 Factory GRIP2"], "Rear shock": ["Fox Float Factory X2 Kashima"], "Rear travel": ["155mm"], "Stem": ["Intense Recon Elite 40mm 31.8mm"], "Seatpost": ["Fox Transfer with 150mm travel"], "Headset": ["Cane Creek 40"], "Handlebars": ["Intense Recon Carbon 780mm 31.8mm"], "Grips/tape": ["Intense Dual Density Lock-on"], "Brakes\n\nMechanical disc brakes are more powerful than rim brakes, but less powerful than hydraulic brakes.": ["Shimano XT (hydraulic disc)"], "Brake levers": ["Shimano XT"], "Shifters": ["SRAM GX Eagle"], "Derailleur (front)": ["N/A"], "Derailleur (rear)": ["SRAM X01 Eagle"], "Crank + rings": ["Truvativ Descendant 32T"], "Bottom bracket": ["SRAM Pressfit DUB"], "Pedals": ["Sold separately"], "Cassette\n\nCassettes with a smaller range allow you to go faster; a bigger range makes climbing hills easier.": ["SRAM XG-1275 Eagle 12-speed 10-50T"], "Chain": ["SRAM Eagle GX"], "Tires": ["Maxxis Minion DHR 29 x 2.4"], "Wheel": ["DT Swiss M1700 Spline"], "Saddle": ["Fabric Scoop Radius Elite"], "Made in": ["Taiwan"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9097567207454/6005829-RED14.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9097915990046/6005829-RED14-ALT-ANGLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9097916022814/6005829-RED14-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9097916186654/6005829-RED14-ALT-TECH.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9097567207454/6005829-RED14.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9097915990046/6005829-RED14-ALT-ANGLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9097916022814/6005829-RED14-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9097916186654/6005829-RED14-ALT-TECH.jpg"]}