{"name": "Salomon XA Pro 3D v8 Gore-Tex Trail Running Shoes - Men's", "categories": ["Home", "All", "Run and fitness", "Running and training footwear", "Running shoes", "Trail running shoes", "XA Pro 3D v8 Gore-Tex Trail Running Shoes"], "description": "Forget about these runners – in a good way. With your feet cushioned, stable and weather-protected, you’re free to focus on keeping good form. The latest generation of these durable trail-proven runners are made to fit well and have a low-profile chassis that keeps you balanced when the terrain isn’t.GORE-TEX® lining keeps your feet dry in wet or muddy conditions with good breathability.Tough mesh upper offers high breathability and durability with a secure fit.Reinforced toe cap and heel cup protect your feet on varied or rough terrain.SensiFit provides a smooth and comfortable fit with reduced pressure points.Quicklace closure provides a secure fit with a single pull and includes a lace pocket.Energy Cell midsole offers lightweight shock absorption with great energy return.Revised 3D chassis delivers improved stability on technical terrain.Contagrip MA outsole is designed for varied terrain with reliable grip on wet or rocky trails.Molded Ortholite insole is comfortable and smooth-fitting.", "product_code": "6006-164", "tech_specs": {"Weight": ["740g (9)", "750g (9 Wide)"], "Ideal for": ["Trail running"], "Feel\n\n'Minimal and natural' shoes offer low drop, lots of flex, and minimal cushioning. Most running shoes are 'Light and responsive' with medium cushioning and good energy return. 'Cushioned and floaty' shoes have maximum cushioning.": ["Light and responsive"], "Stability\n\nSome shoes include added motion control or stability features to help minimize over pronation, where the foot tends to roll inward in a biomechanically imbalanced running position.": ["Neutral"], "Upper material": ["Mesh", "Synthetic leather", "TPU"], "Closure": ["Quick pull"], "Heel-to-toe cushioning\n\nThe approximate thickness of the midsole cushioning under the heel and the forefoot. A thicker heel and greater difference between heel and toe height tends to suit heel-strike runners, while forefoot and midfoot strikers may prefer a minimal drop between heel and toe cushioning.": ["28-17mm"], "Drop\n\nThe drop is the difference in height between the heel and the forefoot midsole cushioning. Traditional running shoes tend to have a 10mm drop or higher while minimalist style shoes are on the lower end of the spectrum.": ["11mm"], "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": ["Yes"], "Removable insole": ["Yes"], "Made in": ["Vietnam"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9076115996702/6006164-ECB01.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9077651406878/6006164-ECB01-ALT-ONMODEL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9190351011870/6006164-ECB01-ALT-A.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9190351044638/6006164-ECB01-ALT-B.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9190351175710/6006164-ECB01-ALT-C.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9190351306782/6006164-ECB01-ALT-D.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9190351699998/6006164-ECB01-ALT-E.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9076115996702/6006164-ECB01.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9077651406878/6006164-ECB01-ALT-ONMODEL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9190351011870/6006164-ECB01-ALT-A.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9190351044638/6006164-ECB01-ALT-B.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9190351175710/6006164-ECB01-ALT-C.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9190351306782/6006164-ECB01-ALT-D.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9190351699998/6006164-ECB01-ALT-E.jpg"]}