{"name": "Garmin Fenix 6 Pro - Unisex", "categories": ["Home", "All", "Camping and hiking", "Electronics", "Watches", "Altimeter barometer watches", "Fenix 6 Pro"], "description": "Play music, get to the best trails, see who’s calling – this watch does it all. The do-everything Fenix line blends a smartwatch, sport watch and a backcountry GPS. Elevate heart rate monitor reads your pulse off your wrist, even while swimming. When you need more info, or a little motivation, the free Connect app pairs with your phone to download training plans, get texts, social media alerts and emails. The music mode streams music services via your phone, or transfers songs and podcasts. Detailed maps offer turn-by-turn directions. Round-trip routing makes set-distance runs easy, and features like activity tracking, sleep monitoring, music playback and smart notifications make the Fenix 6 useful every day, not just on training days.Built-in modes for biking, running, swimming (indoor and out), multisport, gym (strength training, cardio and elliptical, stair stepping, rowing, yoga), golf (41,000+ course maps), skiing (2000+ ski resort maps) and more.Includes North American map data with room to add maps.Multiple map themes customize your map screen, from heatmaps, to ski resorts, marine settings and more.Point of interest navigation for: restaurants, attractions, accommodations.Choose a distance, and get 6 options through round-trip mapping.Trendline™ routing identifies popular roures.Stream music through a phone using Spotify, Amazon Music, and more. download playlists and podcasts directly (Spotify premium account required), or add MP3s from your computer.Synched playlists can be updated via Wi-Fi.Holds up to 2000 songs.ClimbPro™ (available on preloaded courses only) lets you know grade, total ascent, and elevation profile, so you can pace yourself.PacePro™ (available on preloaded courses only) sets a desired pace, breaks your distance splits, and calculates needed pace for your goal.Body Battery™ mode tracks daily energy levels, monitoring exercise as well rest and food, so you get a better idea of how and when to train.Garmin Pay™ lets you make payments with your watch (if supported by your bank).Strava Segment integration, both preloaded and on-the-fly, lets you know when starred segments begin, plus PR, current KOM or QOM, and provides results once complete. (requires Strava premium).LiveTrack shares location and fitness data through a phone.Connects to 3 different satellite constellations (GPS, GLONASS and Galileo) and caches satellite positions.V3 Elevate™ optical heart rate monitor works while swimming. Elevate V3 has a red LED for Pulse Ox data.Physiological metrics includes VO2 max, a race predictor, recovery advisor and performance indicator – many take temperature and altitude into consideration.Training load uses data from your past 7-days of workouts to let you know if you are overtraining or under-training.Compatible with running dynamics sensors (sold separately).Incident detection uses internal sensors to detect accidents and sends signals through your paired smartphone to alert someone that you need help.Assistance mode sends out a message with a LiveTrack link that lets your contacts know where you are.24/7 activity tracking learns your activity level and guides you towards a more active lifestyle.On board sleep tracking shows total sleep and periods of restful sleep.Free Garmin Connect app lets you review activities, receive texts, social media alerts and email; download training plans, and track weather via Bluetooth.Connect IQ support allows you to download apps, widgets, templates, data fields and more.UltraTrac™ mode reduces the GPS recording rate to conserve battery.Pre-set power profiles and custom power profiles let you maximize your battery’s power.Tough, non-reflective Gorilla Glass© crystal.ABC data comes in via the internal altimeter, barometer and a tilt-compensated electronic compass.In the box: fēnix 6, charging cable and documentation.", "product_code": "6008-576", "tech_specs": {"Weight": ["83g"], "Ideal for": ["Casual wear", "Running, fitness and training", "Camping and hiking", "Swim training", "Road cycling"], "Face material\n\nPolycarbonate is inexpensive and light, with good clarity and wear-resistance. Mineral crystal glass offers greater clarity and significantly greater wear-resistance. Sapphire crystal is better still for clarity and wear-resistance.": ["Mineral crystal glass"], "Wrist strap material": ["Silicone"], "Display dimensions": ["3.3 x 3.3cm"], "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": ["IP X8"], "Built-in memory": ["32GB"], "Dimensions": ["4.7 x 4.7 x 1.5cm"], "Snooze": ["No"], "Countdown timer": ["Yes"], "Stopwatch": ["Yes"], "Electronic compass\n\nAn electronic compass allows the user to view their heading in situations where they are either standing still or moving too slowly for the GPS to detect.": ["Yes"], "12/24 hour format": ["Yes"], "Interface": ["USB", "Wireless"], "Lug width": ["22mm"], "Low battery warning": ["Yes"], "Calorie consumption\n\nCalculated based on data from a heart rate monitor.": ["Yes"], "App compatibility\n\nAn online community where members upload, analyze and share activity data.": ["Garmin Connect", "Third party apps"], "Add maps capability\n\nThese units allow you to add maps, so you can mark and name waypoints and create routes on your PC, and then upload the map of your choice to your GPS.": ["Yes"], "Programmable workouts\n\nWant an easy jog? A fast-paced ride? A workout with lots of variety to keep you on your toes? With programmable workouts you can tailor your training to match whatever you are looking for on a particular day.": ["Advanced"], "New lap auto start\n\nAutomatically triggers a new lap after reaching a specified difference.": ["Yes"], "Heart rate monitor": ["Yes"], "Distance/time alarm": ["Yes"], "Interval training": ["Yes"], "Bluetooth": ["Yes"], "Auto pause\n\nAutomatically pauses timer when you stop or go below a specified pace.": ["Yes"], "Heart rate in real time\n\nDisplays beats per minute during activity.": ["Yes"], "Calories in real time\n\nDisplays calorie expenditure during activity, based on heart rate monitor data.": ["Yes"], "Speed/cadence sensor\n\nMonitors pedalling cadence and measures pedalling strokes per minute.": ["Sold separately"], "Battery life": ["10 - 1152 h"], "Chest strap": ["Sold separately"], "Custom POI\n\nA POI (point of interest) is a specific location that someone may find interesting (i.e., favourite viewpoint, best coffee stop before the trailhead). The custom POI feature allows the user to load only the POI's that interest them onto their GPS unit.": ["Yes"], "Waypoints\n\nWaypoints consist of a standard set of coordinates (two for land, three for air or space) that identify a specific physical location. A route is navigated between two or more waypoints.": ["1000"], "Metric/imperial units format": ["Yes"], "Power meter\n\nDisplays output in watts as you ride.": ["Sold separately"], "Unit to unit transfer\n\nShares data wirelessly between compatible units.": ["No"], "Basemap\n\nA basic set of map data that is included with the GPS. Basemap detail may vary from unit to unit.": ["Yes"], "Track log": ["200 hours"], "Tide tables": ["No"], "Battery power indicator": ["Yes"], "Data card": ["Not accepted"], "Foot pod\n\nAttaches to your shoe, captures your running data (i.e., pace, distance), and transmits it to your heart rate monitor or GPS.": ["Sold separately"], "Touch screen": ["No"], "Heart rate target zones\n\nDisplays heart rate zones during activity.": ["Yes"], "Barometric altimeter\n\nBarometer function helps forecast weather trends. An altimeter can provide one line of position for location on a topo map, useful if the GPS isn't working.": ["Yes"], "Coded signal\n\nA coded instrument ensures no interference between your chest strap and your watch, necessary if you are training in busy gyms or trails where other signals may be encountered.": ["Yes"], "Workout history": ["Yes"], "Wireless sync": ["Yes"], "WiFi": ["Yes"], "Button lock": ["Yes"], "Batteries": ["Lithium-ion (included)"], "Routes": ["30"], "Haptic feedback": ["Yes"], "Case diameter": ["47mm"], "Virtual partner\n\nAllows user to monitor training goals with either a virtual partner or alarms.": ["Yes"], "Pause timer\n\nPauses the timer when slowing or stopping, and automatically resumes when moving again.": ["Yes"], "Replaceable wrist strap": ["Yes"], "Pace alarm\n\nAn alarm that notifies you if you vary from a pre-set pace.": ["Yes"], "ANT+ compatible\n\nEnsures seamless digital wireless communication between ANT+ devices. For example, data from an ultra-low power wireless sensor can be displayed on a bike computer or smartphone, then downloaded to a PC, etc.": ["Yes"], "Made in": ["Taiwan"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9055718244382/6008576-BK006.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9055703924766/6008576-BK006-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9055704023070/6008576-BK006-ALT-FRONTMODES.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9055704186910/6008576-BK006-ALT-FRONTNAVIGATION.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9055704219678/6008576-BK006-ALT-FRONTTIMER.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9055704252446/6008576-BK006-ALT-FRONTTRAINING.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9055704285214/6008576-BK006-ALT-FRONTTRAINING2.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9055704383518/6008576-BK006-ALT-MAP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9055704481822/6008576-BK006-ALT-SIDELEFT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9055704580126/6008576-BK006-ALT-SIDERIGHT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9055718244382/6008576-BK006.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9055703924766/6008576-BK006-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9055704023070/6008576-BK006-ALT-FRONTMODES.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9055704186910/6008576-BK006-ALT-FRONTNAVIGATION.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9055704219678/6008576-BK006-ALT-FRONTTIMER.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9055704252446/6008576-BK006-ALT-FRONTTRAINING.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9055704285214/6008576-BK006-ALT-FRONTTRAINING2.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9055704383518/6008576-BK006-ALT-MAP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9055704481822/6008576-BK006-ALT-SIDELEFT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9055704580126/6008576-BK006-ALT-SIDERIGHT.jpg"]}