{"name": "GoPro HERO8 Black", "categories": ["Home", "All", "Cycling", "Training and electronics", "Action cameras and accessories", "Action cameras", "HERO8 Black"], "description": "Back-up the stories of your epic adventures with crystal clear, super-smooth videos. The Black edition is the best-of-the-best and the HERO8 Black is no exception, with smoother, more detailed videos and pictures than ever before. Improved technology allows GoPro to extend their impressive HyperSmooth stabilization to all resolutions, and even offer a new level of stabilization with HyperSmooth Boost. This next tier of stabilization takes the gimbal-like smoothness of HyperSmooth and refines it for professional looking footage from a camera that fits in the palm of your hand. Pre-set shooting modes give you instant access to your favourite settings, so you won’t miss epic air or a silly pet moment while messing around in menus. Strategically placed microphones deliver crisp, clear audio and signals are analyzed and filtered to reduce noise. Voice controls mean having your hands full won't equal a missed shot, all you need to do is say the word. SuperPhoto mode takes digital magic to new heights, producing sharper, more vibrant pictures. When paired with a smartphone or tablet running the free GoPro app the HERO8 Black lets you edit, synch videos, share content through social media and livestream adventures from your phone.4K60 video, at up to 100Mbps, is ultra-smooth and super-sharp.HyperSmooth 2.0 video stabilization (works in all resolutions) uses internal sensors to predict your movements, preparing for changes before they happen, resulting in the smooth, gimbal-free on-the-move videos.HyperSmooth Boost takes the stabilization to the next level providing some of the smoothest footage ever to come out of an action camera.Equipped with the GP1 processor, The HERO8 Black offers improved colour reproduction, sharper HDR images, smoother stabilization with HyperSmooth Boost and more.Slow-motion lets you relive that airtime, analyze your technique, or document the next belly-flop competition.  1080p video can be slowed down up to 8x.Time-lapse video and photo modes let you record epic all-day adventures.Night-lapse improves low-light time-lapse shots with sharper details and improved colours.TimeWarp 2.0 provides stabilized time lapse videos that you can speed up, from 2x to 30x, or GoPro can control the speed of your video.Digital lenses offer 4 different perspectives: narrow (27mm), linear (19-39mm), wide (16-34mm) and SuperView (16mm), so you can frame the perfect video or picture.Built-in voice control lets you wake-up your HERO8 Black and start or stop recording, take a picture and more.Customizable shooting pre-sets give you direct access to the 4 most commonly used modes: standard, activity, slo-mo and cinematic. You can even add your own custom modes for instant access to your preferred settings.Intuitive touchscreen controls let you cycle through modes and settings, access shortcuts and zoom-in.Free GoPro app gives you near complete control of your camera right on your smartphone or tablet. From setting up you shot, synching your videos, leveling your footage, starting your edits, adding overlays and more.ProTune mode lets you control exposure, white balance, ISO and more, even providing a live preview window to see how the settings you are changing will affect the final video or picture.Livestream in 1080p through your paired phone.Auto-rotating videos are ready for sharing on Snapchat and Instagram stories. Shoot vertically or horizontally and internal sensors know how your video should be shown.Onboard GPS data is used to overlay performance stickers, add speed, distance, times and much more, right in your videos.Mods let you add features like an on-camera light, shotgun mic, or front facing screen (sold separately).SuperPhoto mode has been improved to provide sharper HDR, local tone mapping and noise reduction.Take up to 12MP photographs in jpeg or RAW format (across all photo resolutions).LiveBurst captures 1.5 seconds before and 1.5 seconds after you take a picture, giving you 90 images to chose from.Burst mode allows up to 30 frames per second.Enhanced low-light performance in both video and photo modes.GPS lets you geotag your photos and videos.Front facing status screen makes it easy to check settings at a glance.Waterproof to 10m right out of the box, no case needed.Wi-Fi and Bluetooth connectivity means your camera will talk to all your devices running the GoPro app.3 built-in microphones provide clear, crisp audio with advanced wind and noise reduction.Removeable batteries can be swapped on the fly. Updated batteries fuel certain features (HyperSmooth Boost), older batteries are compatible but won't allow every feature to work.Face and smile detection let your HERO8 Black know when you face the camera, smile and more.MicroSD compatible, making memory easy to get and carry (MicroSD card not included). MicroSD card must be at least a Class 10 or UHS-I rated.High Efficiency Video Compression (HEVC) decreases file size without compromising image quality, so you can fit more adventures on a single card.Integrated mounting tabs fold flush when not needed and mean no more frames when mounting.In the box: HERO8 Black, 1220mAh lithium-ion rechargeable battery, curved sticky mount, mounting buckle, thumb screw and USB-C cable.", "product_code": "6009-054", "tech_specs": {"Weight": ["126g"], "Ideal for": ["Watersports", "Mountain biking", "Road cycling", "Downhill skiing", "Snowboarding"], "Instant on-record switch": ["Yes"], "Record lock": ["No"], "Interval photo mode\n\nThe interval, in seconds, at which you can set the camera to take pictures.": ["0.5-3600 seconds"], "Video resolution": ["4K @ 60/30/25/24fps", "2.7K @ 120/100/60/50/30/25/24fps", "1440p @ 120/80/60/50/48/30/25/24fps", "1080p @ 240/200/120/90/80/60/50/48/30/25/24fps"], "Maximum photo resolution": ["12MP"], "Microphone": ["Internal mic", "External jack (sold separately)"], "Included mounts": ["Curved surface mount"], "Codec": ["H.264/AVC", "H.265/HEVC"], "File type": ["MP4"], "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": ["IP X8"], "Dimensions": ["6.6 x 2.8 x 4.9cm"], "Maximum memory capacity\n\nThe maximum additional memory accepted by the device.": ["256GB"], "Interface": ["USB", "Wireless"], "Data card": ["microSD card (not included)"], "GPS image tagging": ["Yes"], "WiFi": ["Yes"], "Bluetooth": ["Yes"], "Batteries": ["Lithium-ion 1220mAh (included)"], "HDMI connector": ["No"], "Still photo mode": ["Yes"], "Tripod mount": ["Sold separately"], "Case included": ["No"], "ANT+ compatible\n\nEnsures seamless digital wireless communication between ANT+ devices. For example, data from an ultra-low power wireless sensor can be displayed on a bike computer or smartphone, then downloaded to a PC, etc.": ["No"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9063684210718/6009054-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9063693942814/6009054-BK000-ALT-ANGLE3QUARTER.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9063693910046/6009054-BK000-ALT-ANGLE45.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9063694041118/6009054-BK000-ALT-ANGLE90.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9063694073886/6009054-BK000-ALT-ANGLE135.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9063694106654/6009054-BK000-ALT-ANGLE135PART2.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9063694204958/6009054-BK000-ALT-ANGLE180.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9063694368798/6009054-BK000-ALT-ANGLEBACKPHOTOMODE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9063694401566/6009054-BK000-ALT-ANGLEBACKVIDEOMODE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9063694467102/6009054-BK000-ALT-BACKPHOTOMODE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9063694434334/6009054-BK000-ALT-BACKVIDEOMODE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9063694499870/6009054-BK000-ALT-BACKVIDEORECORDING.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9063695155230/6009054-BK000-ALT-ANGLEBACKVIDEOREC.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9063684210718/6009054-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9063693942814/6009054-BK000-ALT-ANGLE3QUARTER.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9063693910046/6009054-BK000-ALT-ANGLE45.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9063694041118/6009054-BK000-ALT-ANGLE90.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9063694073886/6009054-BK000-ALT-ANGLE135.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9063694106654/6009054-BK000-ALT-ANGLE135PART2.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9063694204958/6009054-BK000-ALT-ANGLE180.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9063694368798/6009054-BK000-ALT-ANGLEBACKPHOTOMODE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9063694401566/6009054-BK000-ALT-ANGLEBACKVIDEOMODE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9063694467102/6009054-BK000-ALT-BACKPHOTOMODE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9063694434334/6009054-BK000-ALT-BACKVIDEOMODE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9063694499870/6009054-BK000-ALT-BACKVIDEORECORDING.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9063695155230/6009054-BK000-ALT-ANGLEBACKVIDEOREC.jpg"]}