{"name": "Sterling Rope IonR 9.4mm", "categories": ["Home", "All", "Climbing", "Rock climbing", "Ropes, cords and slings", "Dynamic climbing ropes", "IonR 9.4mm"], "description": "Tough enough to work the moves, light enough to redpoint. The IonR 9.4mm is a high-performance rope that's substantial enough for cragging, without weighing down your pack on long approaches. It's a good balance of strength, versatility and smooth handling.DryCore treatment on core yarns reduces yarn-on-yarn abrasion and moisture absorption, so your rope maintains its strength characteristics.Middle mark increases safety and speed on rappels.\n\n        Sustainability\n\n\n\n\n\n\n.bluesign-cls-1,.bluesign-cls-2,.bluesign-cls-3{fill:none;}.bluesign-cls-2,.bluesign-cls-3{stroke:#333;stroke-width:1.79px;}.bluesign-cls-2{stroke-linejoin:round;}.bluesign-cls-3{stroke-miterlimit:10;}\n\nBluesign\n\n\n\n\n\n\n\n\n\n\n\n                      Bluesign® Approved Material", "product_code": "6009-173", "tech_specs": {"Weight": ["3.99kg"], "Ideal for": ["Rock climbing"], "Type": ["Single (‹ 9.6mm)"], "Treatment\n\nDry ropes have a water-resistant treatment on both core and sheath. Dry (UIAA certified) ropes have both core and sheath treated, plus meet the UIAA Water Repellent standard by passing a stringent test where a soaked rope cannot absorb more than 5% of the rope's weight.": ["Non-dry"], "Length": ["70m"], "Dynamic elongation\n\nMaximum elongation in the first UIAA test fall, where a weight is attached to the rope and then dropped. Higher numbers indicate stretchier ropes.": ["33.1%"], "Static elongation\n\nIn controlled tests, a weight is suspended from the rope (not dropped). Higher numbers indicate stretchier ropes.": ["7.2%"], "Impact force\n\nThe amount of force, in kN, that the first UIAA fall puts on the falling object. Less impact force puts less force on the climber, belayer, and protection during a fall.": ["8.7kN"], "Linear weight": ["57g/m"], "Diameter": ["9.4mm"], "Halfway pattern change": ["No"], "UIAA fall rating\n\nIndicates the number of consecutive falls a rope withstood during testing in a controlled environment. The number is for reference only, and does not indicate the number of falls a rope will withstand during actual use or over its lifespan.": ["5"], "Product sustainability": ["Bluesign® Approved Material"], "Made in": ["USA"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9089364983838/6009173-ORG19.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9089544847390/6009173-ORG19-ALT-PATTERN.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9089364983838/6009173-ORG19.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9089544847390/6009173-ORG19-ALT-PATTERN.jpg"]}