{"name": "Salomon 2020 QST Myriad 85 Skis - Women's", "categories": ["Home", "All", "Ski and snowboard gear", "Downhill skiing gear", "Downhill skis", "2020 QST Myriad 85 Skis"], "description": "All the fun of a backside ski in a frontside package. Salomon’s freeski DNA runs through the QST Myriad 85, an agile ski that rides smoothly to offer confidence at high speeds. An edge-to-edge titanal edge insert gives you great power transfer, and the Koroyd tip cuts the chatter. The all-terrain rocker and extended wood core are designed to give it playful pop.Semi-sandwich construction with ABS sidewalls, cap construction at the tip and tail for edge grip underfoot and increased manoeuvrability.Full wood core offers stability, powerful rebound and solid contact to filter vibration.All terrain Rocker 2.0 with early rise tip gives you terrain versatility, easy and precise steering, and fluid terrain absorption.Traditional cambered carve zone has a focused sidecut for power, energy and grip.Titanal insert edge to edge underfoot allows for maximum power transfer.A layer of Basalt provides dampening and vibration absorption.Koroyd Tip is lightweight and reduces vibration without sacrificing control.Hook-free taper features a 5-point sidecut: the tip and tail taper at the extremities for easier turn initiation and smooth steering in soft or variable snow.Glossy topsheet.", "product_code": "6010-965", "tech_specs": {"Weight": ["3.3kg (161cm)"], "Ideal for": ["Downhill skiing"], "Snow conditions": ["Groomed"], "Terrain": ["On-Piste", "Off-Piste"], "Ability\n\nBeginner: new or getting back into skiing.  Intermediate: confident with turning and stopping.  Advanced: highly confident carver. Expert: steeps, drops, park, double blacks -- bring it on.": ["Intermediate", "Advanced"], "Construction\n\nSandwich and combination construction is generally used for big freeride-style skis while the lighter structural cap type of construction is more commonly found on cross-country skis.": ["Combination"], "Core": ["Wood"], "Rocker/camber profile": ["Rocker tip", "Rocker tail"], "Dimension": ["122-85-107mm (153cm)", "124-85-109mm (161cm)", "126-85-111mm (169cm)"], "Turning radius": ["16m"], "Bindings included": ["No"], "Made in": ["Austria"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132495568926/6010965-DBL09.jpg"]}