{"name": "Brooks Ghost 13 Gore-Tex Invisible Fit Road Running - Men's", "categories": ["Home", "All", "Run and fitness", "Running and training footwear", "Running shoes", "Road running shoes", "Ghost 13 Gore-Tex Invisible Fit Road Running"], "description": "This Brooks favourite high-mileage shoe offers soft comfort for wet weather pavement pounding. The Ghost 13 has been updated to include the super soft DNA LOFT foam throughout the entire foot, to cushiong your landing regardless of whether you're a heel or toe striker. Responsive midsoles, universal sprung platforms and segmented crash pads add flexibility and help smooth out the ride. The bonded waterproof-breathable membrane is lighter than previous versions so you can comfortably tackle trails though the wet months.Engineered Air Mesh uppers hold foot securely.GORE-TEX® Invisible Fit waterproof-breathable membrane is bonded directly to the upper.BioMoGo midsoles responds to each step for a custom ride at all speeds.Cushioning DNA LOFT in heel and toe provides cushion regardless of strike.Segmented crash pads cushion and stabilize your stride for smooth transitions.Omega flex grooves increase midsole flexibility.Soles are durable, high-performance rubber.", "product_code": "6010-495", "tech_specs": {"Weight": ["618g (9.0D)"], "Ideal for": ["Road running"], "Feel\n\n'Minimal and natural' shoes offer low drop, lots of flex, and minimal cushioning. Most running shoes are 'Light and responsive' with medium cushioning and good energy return. 'Cushioned and floaty' shoes have maximum cushioning.": ["Cushioned and floaty"], "Stability\n\nSome shoes include added motion control or stability features to help minimize over pronation, where the foot tends to roll inward in a biomechanically imbalanced running position.": ["Neutral"], "Upper material": ["Mesh"], "Closure": ["Lace-up"], "Heel-to-toe cushioning\n\nThe approximate thickness of the midsole cushioning under the heel and the forefoot. A thicker heel and greater difference between heel and toe height tends to suit heel-strike runners, while forefoot and midfoot strikers may prefer a minimal drop between heel and toe cushioning.": ["31-19.5mm"], "Drop\n\nThe drop is the difference in height between the heel and the forefoot midsole cushioning. Traditional running shoes tend to have a 10mm drop or higher while minimalist style shoes are on the lower end of the spectrum.": ["11.5mm"], "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": ["Yes"], "Removable insole": ["Yes"], "Made in": ["Vietnam"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9121866285086/6010495-BER01.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9121878245406/6010495-BER01-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9121878212638/6010495-BER01-ALT-LEFT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9121878278174/6010495-BER01-ALT-RIGHT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9121878376478/6010495-BER01-ALT-TOP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9121866285086/6010495-BER01.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9121878245406/6010495-BER01-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9121878212638/6010495-BER01-ALT-LEFT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9121878278174/6010495-BER01-ALT-RIGHT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9121878376478/6010495-BER01-ALT-TOP.jpg"]}