{"name": "Volkl Mantra 102 Skis - Unisex", "categories": ["Home", "All", "Ski and snowboard gear", "Downhill skiing gear", "Downhill skis", "Mantra 102 Skis"], "description": "Free your ride. This ski makes freeriding even better than it already is. Highly maneuverable, these boards let you take the straight or twisting line, whichever you want. On their bomber construction, you get a ride that's stable and lively with reduced chatter. Their unique 3D shape allows easy and early turn initiation, so you stay nimble on powder runs or gnarly hardpack.Multi-layer wood core with a carbon tip keeps the ski light, lively and stable.Titanal layer adds significant damping to reduce chatter on firm terrain.Combination tip and tail rocker make it turn-friendly and allow for a stiffer flex set-up.3-radius sidecut makes initiating turns easier is a variety of conditions.P-Tex 2100 base gives exceptional glide and durability.Recommended for use with Marker Royal Family bindings.", "product_code": "6011-648", "tech_specs": {"Weight": ["4.12kg (170cm)", "4.28kg (177cm)", "4.46kg (184cm)", "4.7kg (191cm)"], "Ideal for": ["Downhill skiing", "Freeride and freeskiing"], "Snow conditions": ["Mixed", "Powder"], "Terrain": ["Off-Piste"], "Ability\n\nBeginner: new or getting back into skiing.  Intermediate: confident with turning and stopping.  Advanced: highly confident carver. Expert: steeps, drops, park, double blacks -- bring it on.": ["Advanced", "Expert"], "Construction\n\nSandwich and combination construction is generally used for big freeride-style skis while the lighter structural cap type of construction is more commonly found on cross-country skis.": ["Sandwich"], "Core": ["Wood"], "Rocker/camber profile": ["Rocker tail", "Rocker tip"], "Dimension": ["140-102-123  mm"], "Turning radius": ["17m (170cm)", "19m (177cm)", "20m (184cm)", "22m (191cm)"], "Bindings included": ["No"], "Made in": ["Germany"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9136229154846/6011648-NOC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9136245768222/6011648-NOC02-ALT-FRONT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9136229154846/6011648-NOC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9136245768222/6011648-NOC02-ALT-FRONT.jpg"]}