{"name": "Volkl Revolt Junior Skis + Bindings - Children to Youths", "categories": ["Home", "All", "Ski and snowboard gear", "Downhill skiing gear", "Downhill skis", "Revolt Junior Skis + Bindings"], "description": "Got a young shredder eager to tear up the resort? The Revolt Jr. is a great all-mountain ski with twin tips for park play, riding switch and 180-action. A full rocker means they can float through powder on snowy days. vMotion Jr. have a moderate DIN range to adjust as they improve, without compromising the quickness of the release.Full sensor wood core blends hardwood underfoot with softer wood toward the tip and tail.Power Shell construction provides durability and dampening.Full rocker makes for a floaty ski that performs well in the park and in pow.Twin tip for skiing or landing forward or backwards.Small turning radius lets you initiate turns with less effort.Grippy edges provide precision and control.P-Tex base gives exceptional glide and durability.Included vMotion Jr bindings.", "product_code": "6011-651", "tech_specs": {"Weight": ["1.98kg (118 cm)", "2.16kg (128cm)", "2.32kg (138cm)", "2.52kg (148cm)"], "Ideal for": ["Downhill skiing"], "Snow conditions": ["Mixed", "Groomed", "Powder"], "Terrain": ["On-Piste", "Off-Piste"], "Ability\n\nBeginner: new or getting back into skiing.  Intermediate: confident with turning and stopping.  Advanced: highly confident carver. Expert: steeps, drops, park, double blacks -- bring it on.": ["Beginner", "Intermediate"], "Construction\n\nSandwich and combination construction is generally used for big freeride-style skis while the lighter structural cap type of construction is more commonly found on cross-country skis.": ["Sandwich"], "Core": ["Wood"], "Rocker/camber profile": ["Full rocker"], "Dimension": ["106-74-99mm"], "Turning radius": ["8.9m (118 cm)", "10.8m (128cm)", "12.9m (138cm)", "15.3m (148cm)"], "Bindings included": ["Yes"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9136229515294/6011651-NOC02.jpg"]}