{"name": "Salomon Aero 7 eSkin Skis + PSP - Unisex", "categories": ["Home", "All", "Ski and snowboard gear", "Cross country skiing gear", "Cross country classic", "Classic skis", "Aero 7 eSkin Skis + PSP"], "description": "Safe and silent, waxless training skis. The Aero 7 use eSkin technology that doesn't need daily waxing, so you spend more time skiing than doing your ski prep. Great for racing or training, they have an easy kick and good agility, without sacrificing glide and quick return.eSkinGrip+ waxless technology uses an integrated strip of skin underfoot so you don't need grip wax.Heel-toe classic camber provides easy kick, good glide and ski return acceleration.Densolite 2000 core is made with a fibreglass wrap and pre-shaped densolite foam core for consistent, responsive flex.S-cut light carving sidecut has a wider platform at the front for control and stability especially when descending outside of tracks.G3 base provides good wax absorption and retention.Prolink Shift Plate accepts any Prolink Shift binding.", "product_code": "6011-181", "tech_specs": {"Weight": ["1.58kg (198cm)"], "Ideal for": ["Fitness classic skiing"], "Construction\n\nSandwich and combination construction is generally used for big freeride-style skis while the lighter structural cap type of construction is more commonly found on cross-country skis.": ["Structural cap"], "Core": ["Densolite"], "Dimension (all lengths)": ["48-46-44-46mm"], "User weight range\n\nA good starting point for selecting ski or snowboard length. You might choose a shorter or longer length based on terrain and ability.": ["40-55kg (174cm)", "50-65kg (182cm)", "60-75kg (190cm)", "70-85kg (198cm)", "80-95kg (206cm)"], "Waxless\n\nOften called \"fish scale\" skis, waxless skis are designed so you don't need to apply kick wax. However, you may still want to apply glide wax for a better glide. They are a good option for those who don't like waxing, or for regions where temperatures can vary greatly throughout the day.": ["Yes"], "Metal edge": ["No"], "Bindings included": ["No"], "Made in": ["Bulgaria"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9137292083230/6011181-NOC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9137310367774/6011181-NOC02-ALT-SINGLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9137292083230/6011181-NOC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9137310367774/6011181-NOC02-ALT-SINGLE.jpg"]}