{"name": "Wahoo Fitness Kickr Smart Trainer", "categories": ["Home", "All", "Cycling", "Training and electronics", "Bike trainers and accessories", "Bike trainers", "Kickr Smart Trainer"], "description": "Even Team Ineos has indoor days. The team is a fan of the 2020 Kickr Power Trainer because its massive flywheel gives it a highly realistic outdoor feel. Works with a wide range of training apps to battle with friends while it storms outside. Power accuracy has been tweaked to +/- 1% and incline simulation up to 20% keeps your legs challenged, and with 2200W, you’ll tap out long before the Kickr does. Don't expect the noise of this trainer to drown out your heavy breathing, either – it's a virtually silent ride.Direct-drive trainer accounts for every watt you generate.Power reading accuracy of +/- 1% ensures precise training sessions.Trainer can be controlled with Wahoo's app, Zwift, TrainerRoad, Kinomap and many other apps.FE-C and Bluetooth smart control allows you to focus on your training and let the app of your choice change the resistance.Register in the Wahoo app on iOS or Android and new users get premium access, including: 30-day Zwift, 60-day Strava Summit, 30-day TainerRoad, 60-day Sufferfest training center, 30-day Flugaz and 30-day Rouvy.Up to 5º of sway to respond naturally to rider tempo and changes in body position.Axis feet and integrated padding reduce noise on hard floors.Continuous automatic calibration keeps races honest and accurate.ERG mode lets you maintain a certain effort level regardless of your cadence.Heavy 7.2kg flywheel ensures your ride is smooth and authentic.Realistic slope simulation of up to 20%.Maximum brake power of 2200W ensures you reach your limit before the trainer does.LED lights allow for easy confirmation of ANT+ and Bluetooth connection.Wired connection eliminates signal interference (option available late 2020).Includes an 11-speed 11-28T cassette compatible with Shimano and SRAM drivetrains.Heavy-duty frame is built for years of heavy use.Compatible with 12x142mm and 12x148mm thru axles, as well as 130mm and 135mm quick-release axles.Increased clearance for improved compatibility with disc brake-equipped bikes.Fully compatible with the Kickr Climb and Kickr Headwind, sold separately.", "product_code": "6011-809", "tech_specs": {"Ideal for": ["Cycle training"], "Resistance type\n\nHow the trainer delivers resistance to the rear wheel of your bike.": ["Electromagnetic"], "Broadcast communication protocol\n\nANT+ is standard and will work with any ANT+ compatible device. Bluetooth communication, while not standard for bike trainers, works with many software packages and devices.": ["ANT+", "Bluetooth Smart"], "Wireless resistance control\n\nVirtual rides and device-controlled training require wireless communication. ANT+ FE-C is a device independent standard. Bluetooth protocol is not standardized, but will communicate with smartphones and tablets without an ANT+ adapter.": ["ANT+ FE-C", "Bluetooth Smart"], "Data type\n\nPower, cadence and speed are helpful for training sessions. This data can be transmitted to apps or software to create virtual rides or to pace yourself when training.": ["Power", "Speed", "Cadence"], "Maximum slope simulation": ["20%"], "Maximum resistance at 40Km/h": ["2200W"], "Dimensions": ["54 x 71 x 55cm"], "External power supply required\n\nIf an external source is required, your trainer needs to be plugged into an outlet, or if unplugged, will have a reduced number of features.": ["Yes"], "Zwift Certified\n\nZwift certified trainers can have their resistance controlled by the software for a realistic experience.": ["Yes"], "Adjustable resistance": ["Yes"], "Folding\n\nTrainer can be folded flat for storage.": ["Yes"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9153981939742/6011809-BK000ALT-ANGLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9153981513758/6011809-BK000-ALT-SIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9153981710366/6011809-BK000-ALT-SIDE2.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9153982529566/6011809-BK000-ALT-ATTACHMENT1.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9153982562334/6011809-BK000-ALT-ATTACHMENT2.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9153982726174/6011809-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9153981939742/6011809-BK000ALT-ANGLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9153981513758/6011809-BK000-ALT-SIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9153981710366/6011809-BK000-ALT-SIDE2.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9153982529566/6011809-BK000-ALT-ATTACHMENT1.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9153982562334/6011809-BK000-ALT-ATTACHMENT2.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9153982726174/6011809-BK000.jpg"]}