{"name": "B Daehlie Pro Pants - Women's", "categories": ["Home", "All", "Ski and snowboard gear", "Ski and snowboard clothing", "Ski and snow pants", "Pro Pants"], "description": "Collecting km’s this winter?  These breathable soft shell pants keep the cold at bay and shed light precip. Elastic fabric and articulated knees allow easy movement. Mesh panels behind the knees provide ventilation so you can increase the tempo.Water- and wind-resistant soft shell with Bionic Finish Eco® (a natural fluorine – free hydrophobic finish).Elastic fabric, stretch seams, articulated legs and gusseted crotch add ease of movement.Mesh ventilation panels behind knees for breathability.Elastic waistband (with drawstring).Front pocket with YKK® zipper.Reflective details for enhanced visibility in low light.Knee-length zipper on lower legs for use over your ski boots.Cuffs with silicone grip to keep everything in place.", "product_code": "6012-885", "tech_specs": {"Ideal for": ["Cross-country skiing", "Snowshoeing"], "Type": ["Wind shell", "Soft shell"], "Fabric content": ["100% polyester"], "Secondary fabric": ["92% polyester", "8% spandex"], "Waterproofness\n\nWaterproof garments use waterproof-breathable technologies and are fully seam-taped. Water-resistant garments use waterproof-breathable technologies but their seams are not taped. Water-resistant garments repel water and protect against wind but are not made of waterproof fabric.": ["Water-resistant"], "Pockets": ["1 front zippered"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["Wind-resistant"], "Durable water repellency\n\nUsually referred to as DWR. A treatment made to fabrics that causes water to bead and run off instead of soaking through.": ["Yes"], "Additional feature(s)": ["Ankle zips", "Gusseted crotch", "Reflective details"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9142271246366/6012885-EBL20.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9142279143454/6012885-EBL20-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9142271246366/6012885-EBL20.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9142279143454/6012885-EBL20-ALT-BACK.jpg"]}