{"name": "Arc'teryx Norvan SL 2 Trail Running Shoes - Men's", "categories": ["Home", "All", "Run and fitness", "Running and training footwear", "Running shoes", "Trail running shoes", "Norvan SL 2 Trail Running Shoes"], "description": "One of the lightest trail running shoes ever made, the clean-lined Norvan SL 2 is built for challenging terrain. Vibram Litebase technology shave the thickness oby half, without sacrificing durability. Highly packable, with integrated clip-in points. Wear them for fast and light alpine approaches, then stow them in your pack or on your climbing harness.Breathable stretch mesh upper hugs the foot for a supportive fit.Upper folds down for storage in a pack.Collar features integrated loop for clipping to a pack or harness.Superlight EVA and polyolefin midsole provides cushioning and energy return.Forefoot TPU plate provides impact protection.Vibram® Litebase outsole with MegaGrip™ rubber compound.", "product_code": "6012-213", "tech_specs": {"Weight": ["340g (9)"], "Ideal for": ["Trail running"], "Feel\n\n'Minimal and natural' shoes offer low drop, lots of flex, and minimal cushioning. Most running shoes are 'Light and responsive' with medium cushioning and good energy return. 'Cushioned and floaty' shoes have maximum cushioning.": ["Light and responsive"], "Stability\n\nSome shoes include added motion control or stability features to help minimize over pronation, where the foot tends to roll inward in a biomechanically imbalanced running position.": ["Neutral"], "Upper material": ["Mesh", "TPU"], "Closure": ["Lace-up"], "Heel-to-toe cushioning\n\nThe approximate thickness of the midsole cushioning under the heel and the forefoot. A thicker heel and greater difference between heel and toe height tends to suit heel-strike runners, while forefoot and midfoot strikers may prefer a minimal drop between heel and toe cushioning.": ["19-12mm"], "Drop\n\nThe drop is the difference in height between the heel and the forefoot midsole cushioning. Traditional running shoes tend to have a 10mm drop or higher while minimalist style shoes are on the lower end of the spectrum.": ["7mm"], "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": ["No"], "Removable insole": ["Yes"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9154484600862/6012213-RGL01.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9154484043806/6012213-BLT23.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9154484600862/6012213-RGL01.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9154484043806/6012213-BLT23.jpg"]}