{"name": "Mavic Allroad SL Disc CL HG11 Wheelset", "categories": ["Home", "All", "Cycling", "Bike components", "Tires, tubes, wheels and hubs", "Bike wheels", "Wheelsets", "Allroad SL Disc CL HG11 Wheelset"], "description": "Rough roads don't have to mean a rough ride. Treat yourself to stiff, comfortable wheels that'll make your ride faster and more enjoyable. Mavic built a wide rim that's UST tubeless-ready to allow you to use wider tires and lower pressure. This creates a smooth ride without the risk of pinch flats. The 24 elliptical spokes are 2-cross laced to take care of brake torque and to create a stiff, dynamic wheel that stays straight and true, even when ridden hard.Maxtal aluminum alloy rims have a higher strength to weight ration than conventional 6106 alloy.Inter spoke milling reduces weight without sacrificing strength, and less weight means less inertia for quicker acceleration and better handling.Updated design no longer requires rim tape, saving at least another 30g per wheel.Minimalist disc brake profiled rim.Internal rim width is 22mm and optimized for 25-32mm wide tires.Straight-pull elliptical double-butted steel spokes.Spoke count is 24 front and rear.Instant Drive 360 freewheel is light and fast to engage, with only 9º of rotation.Aluminum hubs with steel axles.QRM cartridge bearings are easy to adjust and smooth.ASTM CATEGORY 2: road and off-road with jumps less than 15cm.Includes UST valves and documentation.Front wheel weighs 740g, rear 850g. Weighed without tires.Note – To ensure longevity of the wheel, Mavic recommends that the total weight supported by the wheels doesn’t exceed 120kg, bike included.", "product_code": "6013-985", "tech_specs": {"Weight": ["1.59kg"], "Ideal for": ["Gravel riding", "Cyclocross", "Road cycling"], "Material": ["Aluminum"], "Size": ["700C"], "Recommended tire width": ["25-32mm"], "Tire type": ["Tubeless", "Clincher"], "Retention device": ["Customizable"], "Brake compatibility": ["Disc brakes"], "Valve compatibility\n\nThe type of tube valve the rim will accommodate. Most Schrader wheels can be retrofitted to fit Presta valves.": ["Presta"], "Hub (front)": ["Mavic Infinity"], "Hub (rear)\n\nThe hub affects a bike’s rolling efficiency. Internally geared hubs require significantly less maintenance.": ["Mavic Infinity"], "Spoke count": ["24"], "Spokes": ["Mavic Zircal"], "Rims": ["Mavic Allroad Pro UST"], "Made in": ["Romania"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9164035719198/6013985-BK000.jpg"]}