{"name": "Saucony Kinvara 12 Road Running Shoes - Men's", "categories": ["Home", "All", "Run and fitness", "Running and training footwear", "Running shoes", "Road running shoes", "Kinvara 12 Road Running Shoes"], "description": "Sprints, jogs and jaunts – the lightweight Kinvara 12 is versatile enough to span almost any duration or intensity level. The new upper is stripped-down to cut weight, while still offering a smooth, secure fit. The updated sole is mostly exposed EVA, with just enough rubber for traction and durability.Seamless engineered mesh is lightweight and reduces rubbing hotspots.Internal heel pods help keep your feet comfortably locked in.Woven heel provides a supportive, refined fit.FORMFIT performance contoured footbed for added support and cushioning.PWRRUN foam midsole delivers a smooth ride with great energy return.Tri-Flex sole configuration for smooth ground contact and toe-off.Blown rubber outsole patches provide traction where you need it.", "product_code": "6013-167", "tech_specs": {"Weight": ["426g (9)"], "Ideal for": ["Road running"], "Feel\n\n'Minimal and natural' shoes offer low drop, lots of flex, and minimal cushioning. Most running shoes are 'Light and responsive' with medium cushioning and good energy return. 'Cushioned and floaty' shoes have maximum cushioning.": ["Light and responsive"], "Stability\n\nSome shoes include added motion control or stability features to help minimize over pronation, where the foot tends to roll inward in a biomechanically imbalanced running position.": ["Neutral"], "Upper material": ["Synthetic"], "Closure": ["Lace-up"], "Heel-to-toe cushioning\n\nThe approximate thickness of the midsole cushioning under the heel and the forefoot. A thicker heel and greater difference between heel and toe height tends to suit heel-strike runners, while forefoot and midfoot strikers may prefer a minimal drop between heel and toe cushioning.": ["28.5-24.5mm"], "Drop\n\nThe drop is the difference in height between the heel and the forefoot midsole cushioning. Traditional running shoes tend to have a 10mm drop or higher while minimalist style shoes are on the lower end of the spectrum.": ["4mm"], "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": ["No"], "Removable insole": ["Yes"], "Made in": ["Vietnam"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9170052874270/6013167-COC10.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9170068406302/6013167-COC10-ALT-BOTTOM.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9170068537374/6013167-COC10-ALT-INSIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9170068602910/6013167-COC10-ALT-SIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9170068733982/6013167-COC10-ALT-TOP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9170052874270/6013167-COC10.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9170068406302/6013167-COC10-ALT-BOTTOM.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9170068537374/6013167-COC10-ALT-INSIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9170068602910/6013167-COC10-ALT-SIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9170068733982/6013167-COC10-ALT-TOP.jpg"]}