{"name": "On Cloudultra Trail Running Shoes - Women's", "categories": ["Home", "All", "Run and fitness", "Running and training footwear", "Running shoes", "Trail running shoes", "Cloudultra Trail Running Shoes"], "description": "With two layers of Clouds, the Cloudultra adds another level of cushioning to your long runs and ultra marathons. Wrap-fit construction fits like a sock, with two layers of sandwiched mesh for impressive breathability and durability, and a FlipRelease™ tool on the forefoot lacing to release pressure when your feet start to swell.Upper uses breathable knit mesh and asymmetric overlays to wrap your foot.Sock-fit construction is comfortable and secure.FlipRelease™ mechanism releases lace tension at the push of a button.Helion™ superfoam delivers a smooth ride with soft landings and energy-filled toe offs.Integrated speedboard imparts a natural flex and rocker, encouraging a smooth roll off.Double layered CloudTec® pods compress under impact to absorb shock and provide responsive energy return.Missiongrip™ rubber outsole for grip and durability on and off road.", "product_code": "6013-695", "tech_specs": {"Weight": ["490g (7)"], "Ideal for": ["Trail running"], "Feel\n\n'Minimal and natural' shoes offer low drop, lots of flex, and minimal cushioning. Most running shoes are 'Light and responsive' with medium cushioning and good energy return. 'Cushioned and floaty' shoes have maximum cushioning.": ["Cushioned and floaty"], "Stability\n\nSome shoes include added motion control or stability features to help minimize over pronation, where the foot tends to roll inward in a biomechanically imbalanced running position.": ["Neutral"], "Upper material": ["Mesh", "TPU"], "Closure": ["Lace-up"], "Drop\n\nThe drop is the difference in height between the heel and the forefoot midsole cushioning. Traditional running shoes tend to have a 10mm drop or higher while minimalist style shoes are on the lower end of the spectrum.": ["8mm"], "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": ["No"], "Removable insole": ["Yes"], "Made in": ["Vietnam"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9164042993694/6013695-MEC20.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9164035260446/6013695-MEC20-ALT-SOLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9164042993694/6013695-MEC20.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9164035260446/6013695-MEC20-ALT-SOLE.jpg"]}