{"name": "Suunto 9 Titanium Watch - Unisex", "categories": ["Home", "All", "Camping and hiking", "Electronics", "GPS Navigation", "GPS watches", "9 Titanium Watch"], "description": "With an incredibly strong, light titanium bezel, this watch is ready for ultra races or beating PBs. Intelligent power management tracks battery life to give you enough power for the last km or the next 50. The efficient FusedTrack system combines data with GPS readings (every 1 to 2 minutes) to create GPS-quality tracking without needing constant power. More than 80 activity profiles ready it for any sport and optical heart rate monitor adds a layer of training precision. Pair the Baro 9 with a compatible phone and the Movescount app for whole new feature set. Transfer activities, get notifications, plan routes using heatmaps or share to social channels. Heatmaps display other Movescount users' activities over local maps, making it easier to find great runs, rides, trails or swims. Full activity tracking records steps and calories and quality of your sleep, for a 24/7 picture of your performance and progress.Virtually scratchproof sapphire crystal face and rugged titanium bezel.Valencell’s optical heart rate monitor (version 1.2) provides reliable constant data and allows you to train without a chest strap.Optical heart rate sensors measure changes in blood volume under the skin, and work best when worn snugly, 1 to 3 finger-widths above your wrist bone.Spot check your heart rate to see 10 minutes or 12 hours. During an activity, heart rate data is collected every second.FusedTrack™ uses internal sensors to plot route between GPS points for a data track that mirrors your actual track without draining the battery. Works for running and trail running, with open water swimming in the works.FusedAlti™ combines GPS and barometric data to extrapolate the most accurate altitude possible.FusedSpeed™ combines GPS and accelerometer data to provide a more stable running pace.Intelligent battery profiles change modes to get specific runtimes and features from remaining battery power.Customize your battery profiles for specific activities. Intelligent battery reminders learn your activity patterns and remind you to charge your watch.Dynamic battery monitoring suggests power changes on the fly.Low-battery detection mode switches off everything but the activity timer.Movescount web interface lets you customize modes and display, and lets you compare and race against with other Movescount users and share metrics with coaches or personal trainers.Track PBs by sport and see progress trends for different activities (Bluetooth heart rate belt required for optimal accuracy in water).More than 80 sport modes for cross-training.24/7 activity tracking learns your activity level and guide you towards a more active lifestyle.Sleep tracking monitors quality and total sleep to calculate recovery and progress.Barometric altimeter tracks ascent, descent and total elevation change.Storm alarm tracks pressure changes and alerts you when it’s time to find shelter.Tilt compensated digital compass helps keep you headed in the right direction.Bluetooth Smart connects to fitness sensors from power meters to footpods, andBluetooth 4.0 phones.Data auto-synchs with phones using Suunto apps, Movescount or Suunto.Smart notifications (emails, texts, alerts and more) via Bluetooth connection to a compatible phone.Free software updates add functionality and improve performance.User-friendly strap changes, thanks to quick-release pins. Fits any 24mm wide strapsFits wrists 13-22cm.In the box: Suunto 9 Baro Titanium, 2 straps, USB cable, quick guide, warranty leaflet.", "product_code": "6015-716", "tech_specs": {"Ideal for": ["Running, fitness and training", "Swim training", "Road cycling", "Triathlon"], "Face material\n\nPolycarbonate is inexpensive and light, with good clarity and wear-resistance. Mineral crystal glass offers greater clarity and significantly greater wear-resistance. Sapphire crystal is better still for clarity and wear-resistance.": ["Sapphire crystal"], "Wrist strap material": ["Silicone"], "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": ["IP X8"], "Dimensions": ["5 x 5 x 1.7cm"], "Snooze": ["Yes"], "Countdown timer": ["Yes"], "Stopwatch": ["Yes"], "Electronic compass\n\nAn electronic compass allows the user to view their heading in situations where they are either standing still or moving too slowly for the GPS to detect.": ["Yes"], "12/24 hour format": ["Yes"], "Interface": ["USB", "Wireless"], "Lug width": ["24mm"], "Low battery warning": ["Yes"], "Calorie consumption\n\nCalculated based on data from a heart rate monitor.": ["Yes"], "App compatibility\n\nAn online community where members upload, analyze and share activity data.": ["Suunto", "Movescount"], "Add maps capability\n\nThese units allow you to add maps, so you can mark and name waypoints and create routes on your PC, and then upload the map of your choice to your GPS.": ["No"], "Programmable workouts\n\nWant an easy jog? A fast-paced ride? A workout with lots of variety to keep you on your toes? With programmable workouts you can tailor your training to match whatever you are looking for on a particular day.": ["Advanced"], "New lap auto start\n\nAutomatically triggers a new lap after reaching a specified difference.": ["Yes"], "Heart rate monitor": ["Yes"], "Distance/time alarm": ["Yes"], "Interval training": ["Yes"], "Bluetooth": ["Yes"], "Auto pause\n\nAutomatically pauses timer when you stop or go below a specified pace.": ["No"], "Heart rate in real time\n\nDisplays beats per minute during activity.": ["Yes"], "Calories in real time\n\nDisplays calorie expenditure during activity, based on heart rate monitor data.": ["Yes"], "Speed/cadence sensor\n\nMonitors pedalling cadence and measures pedalling strokes per minute.": ["Sold separately"], "Battery life": ["25 - 336 h"], "Chest strap": ["Sold separately"], "Custom POI\n\nA POI (point of interest) is a specific location that someone may find interesting (i.e., favourite viewpoint, best coffee stop before the trailhead). The custom POI feature allows the user to load only the POI's that interest them onto their GPS unit.": ["Yes"], "Metric/imperial units format": ["Yes"], "Power meter\n\nDisplays output in watts as you ride.": ["Sold separately"], "Unit to unit transfer\n\nShares data wirelessly between compatible units.": ["No"], "Basemap\n\nA basic set of map data that is included with the GPS. Basemap detail may vary from unit to unit.": ["No"], "Area calculation": ["No"], "Tide tables": ["No"], "Battery power indicator": ["Yes"], "Data card": ["Not accepted"], "Foot pod\n\nAttaches to your shoe, captures your running data (i.e., pace, distance), and transmits it to your heart rate monitor or GPS.": ["Sold separately"], "Touch screen": ["Yes"], "Heart rate target zones\n\nDisplays heart rate zones during activity.": ["Yes"], "Barometric altimeter\n\nBarometer function helps forecast weather trends. An altimeter can provide one line of position for location on a topo map, useful if the GPS isn't working.": ["Yes"], "Coded signal\n\nA coded instrument ensures no interference between your chest strap and your watch, necessary if you are training in busy gyms or trails where other signals may be encountered.": ["Yes"], "Workout history": ["Yes"], "Wireless sync": ["Yes"], "WiFi": ["No"], "Button lock": ["Yes"], "Batteries": ["Lithium-ion (included)"], "Haptic feedback": ["Yes"], "Case diameter": ["50mm"], "Virtual partner\n\nAllows user to monitor training goals with either a virtual partner or alarms.": ["No"], "Pause timer\n\nPauses the timer when slowing or stopping, and automatically resumes when moving again.": ["Yes"], "Replaceable wrist strap": ["Yes"], "Pace alarm\n\nAn alarm that notifies you if you vary from a pre-set pace.": ["Yes"], "ANT+ compatible\n\nEnsures seamless digital wireless communication between ANT+ devices. For example, data from an ultra-low power wireless sensor can be displayed on a bike computer or smartphone, then downloaded to a PC, etc.": ["No"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9184173981726/6015716-CHA00.jpg"]}