{"name": "Polar Vantage V2 GPS", "categories": ["Home", "All", "Camping and hiking", "Electronics", "GPS Navigation", "GPS watches", "Vantage V2 GPS"], "description": "Get a new point of view on how you train. Training is just one part of performance, the Vantage V2 examines how you fuel your training, how you train and how you recover. Taking in all this data via an array of sensors, internal GPS provides speed and distance info, an optical heart rate sensor provides all sorts of pulse related metrics, and internal accelerometers translate your movements into information you can use to train smarter. There’s even an internal running power meter, no foot pod needed. Onboard fitness testing lets you track your progress, walking you through a variety of fitness tests. Test results can be seen on your wrist or through Polar Flow’s testing dashboard. When paired with your phone running the free Polar Flow™ app, you can review activities, download training plans, receive texts, social media alerts and emails, track the weather and more.130 different sport profiles are available to let you customize your watch (up to 20 profiles on the watch). Each profile has customizable data fields, zone limits, laps and more.Fitness testing options, from orthostatic, leg recovery, VO2 max, cycling FTP (power sensor required) and more.Optical heart rate monitor uses Polar’s Precision Prime™ multicoloured LED sensor to measure heart rate right off your wrist.Komoot turn-by-turn navigation, plan your route, synch it over Bluetooth™ and you’re ready to go (Komoot region unlocking may be required).Strava™ Live Segment integration lets you know when your starred segments are about to begin and shows instantaneous data (Strava premium required).HillSplitter™ mode automatically displays your splits and counts ascents/descents when doing hill training.FuelWise™ mode provides reminders to eat and drink as you train, and recaps your “fuel sources” after a workout to help you plan nutrition for the next workout.Nightly Recharge™ and Recovery Pro™ break down the quality of your rest and show how well you have recovered from your training.FitSpark™ suggests daily workouts to help maintain your current fitness level, with strength, cardio and supportive/flexibility focused options.Training Load Pro™ breaks down how you train into 3 components: training load, cardio load, and muscle load, this data is used to tell you if you are over-training, on the right track, or under training.Swim training profile (pool and open water) detects stroke, distance, pace, strokes and rest times.Intelligent battery manager provides 40 hours of continuous training use, up to 100 hours with reduced GPS intervals and 7 days in watch mode.GPS, GLONASS, Galileo and QZSS satellite constellation support means a strong signal nearly anywhere on the globe.Music controls let you navigate your playlist and adjust volume all without having to pull out your phone.Free Polar Flow app can load workouts to your favourite training apps, like Strava, Training Peaks and more (uses your phone’s Bluetooth connection).Bluetooth Smart lets you connect to a variety of different sensors to tell you more about how you train, including: power meters (cycling and running), cadence and speed sensors, foot pods, heart rate belts and more.Daily activity tracking with 24/7 heart rate data, steps and sleep tracking.ABC data comes in via the internal altimeter, barometer and compass.Lightweight aluminum case cuts grams from the previous version.Tough, non-reflective Gorilla Glass© screen.Bright colour touchscreen is easy to see in all conditions.Customizable watch faces let you choose how and what you see.100m water resistance.Fits wrists 14.5-21.4cm in circumference.In the box: Vantage V2, charging cable and documentation.", "product_code": "6015-591", "tech_specs": {"Weight": ["52g"], "Ideal for": ["Running, fitness and training", "Road running", "Road cycling", "Swim training"], "Face material\n\nPolycarbonate is inexpensive and light, with good clarity and wear-resistance. Mineral crystal glass offers greater clarity and significantly greater wear-resistance. Sapphire crystal is better still for clarity and wear-resistance.": ["Mineral crystal glass"], "Wrist strap material": ["Silicone"], "Display dimensions": ["3 x 3cm"], "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": ["IP X8"], "Dimensions": ["4.7 x 4.7 x 1.3cm"], "Snooze": ["No"], "Countdown timer": ["Yes"], "Stopwatch": ["Yes"], "Electronic compass\n\nAn electronic compass allows the user to view their heading in situations where they are either standing still or moving too slowly for the GPS to detect.": ["Yes"], "12/24 hour format": ["Yes"], "Interface": ["USB", "Wireless"], "Low battery warning": ["Yes"], "Calorie consumption\n\nCalculated based on data from a heart rate monitor.": ["Yes"], "App compatibility\n\nAn online community where members upload, analyze and share activity data.": ["Polar Flow", "Third party apps"], "Add maps capability\n\nThese units allow you to add maps, so you can mark and name waypoints and create routes on your PC, and then upload the map of your choice to your GPS.": ["No"], "Programmable workouts\n\nWant an easy jog? A fast-paced ride? A workout with lots of variety to keep you on your toes? With programmable workouts you can tailor your training to match whatever you are looking for on a particular day.": ["Advanced"], "New lap auto start\n\nAutomatically triggers a new lap after reaching a specified difference.": ["Yes"], "Heart rate monitor": ["Yes"], "Distance/time alarm": ["Yes"], "Interval training": ["Yes"], "Bluetooth": ["Yes"], "Auto pause\n\nAutomatically pauses timer when you stop or go below a specified pace.": ["No"], "Heart rate in real time\n\nDisplays beats per minute during activity.": ["Yes"], "Calories in real time\n\nDisplays calorie expenditure during activity, based on heart rate monitor data.": ["Yes"], "Speed/cadence sensor\n\nMonitors pedalling cadence and measures pedalling strokes per minute.": ["Sold separately"], "Battery life": ["40-168 h"], "Chest strap": ["Sold separately"], "Custom POI\n\nA POI (point of interest) is a specific location that someone may find interesting (i.e., favourite viewpoint, best coffee stop before the trailhead). The custom POI feature allows the user to load only the POI's that interest them onto their GPS unit.": ["Yes"], "Metric/imperial units format": ["Yes"], "Power meter\n\nDisplays output in watts as you ride.": ["Sold separately"], "Unit to unit transfer\n\nShares data wirelessly between compatible units.": ["Yes"], "Basemap\n\nA basic set of map data that is included with the GPS. Basemap detail may vary from unit to unit.": ["No"], "Area calculation": ["No"], "Tide tables": ["No"], "Battery power indicator": ["Yes"], "Data card": ["Not accepted"], "Foot pod\n\nAttaches to your shoe, captures your running data (i.e., pace, distance), and transmits it to your heart rate monitor or GPS.": ["Sold separately"], "Touch screen": ["Yes"], "Heart rate target zones\n\nDisplays heart rate zones during activity.": ["Yes"], "Barometric altimeter\n\nBarometer function helps forecast weather trends. An altimeter can provide one line of position for location on a topo map, useful if the GPS isn't working.": ["Yes"], "Coded signal\n\nA coded instrument ensures no interference between your chest strap and your watch, necessary if you are training in busy gyms or trails where other signals may be encountered.": ["Yes"], "Workout history": ["Yes"], "Wireless sync": ["Yes"], "WiFi": ["No"], "Button lock": ["Yes"], "Batteries": ["Rechargeable battery pack (non-removable)"], "Haptic feedback": ["Yes"], "Case diameter": ["47mm"], "Virtual partner\n\nAllows user to monitor training goals with either a virtual partner or alarms.": ["Yes"], "Pause timer\n\nPauses the timer when slowing or stopping, and automatically resumes when moving again.": ["Yes"], "Replaceable wrist strap": ["Yes"], "Pace alarm\n\nAn alarm that notifies you if you vary from a pre-set pace.": ["Yes"], "ANT+ compatible\n\nEnsures seamless digital wireless communication between ANT+ devices. For example, data from an ultra-low power wireless sensor can be displayed on a bike computer or smartphone, then downloaded to a PC, etc.": ["No"], "Product sustainability": ["Rechargeable batteries"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9185906786334/6015591-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9185906786334/6015591-BK000.jpg"]}