{"name": "e*thirteen LG1 DH All-Terrain+ 2.35\" Tire", "categories": ["Home", "All", "Cycling", "Bike components", "Tires, tubes, wheels and hubs", "Bike tires", "LG1 DH All-Terrain+ 2.35\" Tire"], "description": "Fast rolling and hard wearing, the LG1 DH has a harder base compound and a tracky tread compound with tons of grip. By adding a tapered Apex insert in the casing, E13 managed to increase the grip when cornering and braking, decrease rolling resistance and increase puncture resistance. The woven aramid fibre in the casing also increases air retention, puncture protection and cut resistance – all good things when you're trying to get down a mountain as fast as possible.Hard-biting side knobs are bolstered by an angled structural base to help support knobs in high-speed cornering situations.Sipes on the knob surfaces improves traction.Ramped, shorter centre knobs make for a fast-rolling tire.Single-compound construction offers grip and durability for an increased lifespan.Dual-Ply Apex Aramid Reinforced casing improves support and puncture protection.True 2.35in width optimized for modern wide rims (24–31mm internal width).Tubeless ready.", "product_code": "6016-534", "tech_specs": {"Weight": ["1.16kg"], "Ideal for": ["Enduro", "Freeride and downhill riding"], "Tire type": ["Clincher or Tubeless"], "Wheel position": ["Front", "Rear"], "Bead\n\nThe bead holds the tire onto the rim. Beads may be hoops of wire, or made of a flexible material which allows them to be folded compactly. Folding tires are easier to store or pack on trips.": ["Folding"], "Tire size": ["27.5 X 2.35in."], "Made in": ["Taiwan"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9199104786462/6016534-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9199126773790/6016534-BK000-ALT-A.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9199104786462/6016534-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9199126773790/6016534-BK000-ALT-A.jpg"]}