{"name": "MSR MiniWorks EX Water Filter", "categories": ["Home", "All", "Camping and hiking", "Camping kitchen and hydration", "Water bottles and water treatment", "Water filters, treatment and tablets", "Water filters", "Pump filters", "MiniWorks EX Water Filter"], "description": "The MSR® Miniworks™ EX water filter is lightweight, with the same easy pumping action and carbon-cored ceramic element as the MSR WaterWorks™ EX filter, but without the final membrane filter. The side-mounted lever is easier to use than bike-pump-type filters. The base of the filter is threaded to screw directly onto Nalgene® wide-mouth water bottles or all MSR Dromedary™ bags, reducing spillage and the risk of cross-contamination with unfiltered water. The over-pressure relief valve vents water back down the intake hose, so you don’t get soaked with untreated water. A gauge is supplied so you can determine when it’s time to replace the ceramic filter element.Filters at 1L per minute flow rate using AirSpring™ air bubble technology.Effective against protozoa, and 0.2 micron or larger bacteria.Reduces concentrations of some chemicals (including iodine and chlorine).Reduces odours and tastes.Foam pre-filter included.", "product_code": "5001-239", "tech_specs": {"Weight": ["456g"], "Ideal for": ["Camping and hiking"], "Filter type\n\nWater can be treated using various types of filters, chemicals or non-chemical purification methods, or a combination. Filters on their own will not remove viruses as they are too small.": ["Ceramic filter w/carbon core"], "Output": ["1L/min"], "Dimensions": ["19 x 7cm"], "Cartridge life\n\nThe life of the filter cartridge is based on the quantity of water you can treat before the cartridge is no longer effective. This does not apply to battery operated or chemical filter systems.": ["2000L"], "Filter size\n\nA 0.5 micron or smaller filters protozoa and some large bacteria; 0.2 micron or smaller filters smaller bacteria such as campylobacter.": ["0.2microns"], "Effective against protozoa\n\nProtozoa are larger than one micron and include cryptosporidium and giardia.": ["Yes"], "Effective against viruses\n\nMost viruses are in the 0.1 micron size range, but they can be as small as 0.002 microns.": ["No"], "Effective against particulate\n\nParticulate consists of very small bits and pieces such as dirt or bugs.": ["Yes"], "Effective against bacteria\n\nBacteria can cause illnesses such as diarrhea and dysentery and are about 1.0 micron in size, although some can be as small as 0.2 microns.": ["Yes"], "Made in": ["USA"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8812675498014/5001239-NOC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8812675498014/5001239-NOC02.jpg"]}