{"name": "Beal Rando 8mm Golden Dry Rope", "categories": ["Home", "All", "Climbing", "Rock climbing", "Ropes, cords and slings", "Dynamic climbing ropes", "Rando 8mm Golden Dry Rope"], "description": "When used in its single state, this is a light, compact security rope that's dynamic enough to absorb modest impacts. Beal® recommends it for easy snow routes with no difficult passages, glacier travel and ski touring. If used for climbing, double it up. This is a hybrid with UIAA test results passing it as a twin rope. Beal conducted their own tests as a single strand with 80kg weight.2 strands have a UIAA fall rating of 12.2 strands are rated to an impact force of 8.5kN.Golden Dry treatment makes both the sheath and the core water resistant.Beal plants a tree for every rope sold.", "product_code": "5009-630", "tech_specs": {"Weight": ["740g (20)", "740g (20 Meter)"], "Ideal for": ["Rock climbing", "Snow and ice climbing"], "Type": ["Twin"], "Treatment\n\nDry ropes have a water-resistant treatment on both core and sheath. Dry (UIAA certified) ropes have both core and sheath treated, plus meet the UIAA Water Repellent standard by passing a stringent test where a soaked rope cannot absorb more than 5% of the rope's weight.": ["Dry"], "Length": ["30m (30 Meter)", "20m (20)", "20m (20 Meter)"], "Dynamic elongation\n\nMaximum elongation in the first UIAA test fall, where a weight is attached to the rope and then dropped. Higher numbers indicate stretchier ropes.": ["36%"], "Static elongation\n\nIn controlled tests, a weight is suspended from the rope (not dropped). Higher numbers indicate stretchier ropes.": ["8%"], "Impact force\n\nThe amount of force, in kN, that the first UIAA fall puts on the falling object. Less impact force puts less force on the climber, belayer, and protection during a fall.": ["8.5kN"], "Linear weight": ["37g/m"], "Diameter": ["8mm"], "Halfway pattern change": ["No"], "UIAA fall rating\n\nIndicates the number of consecutive falls a rope withstood during testing in a controlled environment. The number is for reference only, and does not indicate the number of falls a rope will withstand during actual use or over its lifespan.": ["12"], "Made in": ["Madagascar"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8807252131870/5009630-YLW00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8807251443742/5009630-PNK00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8807252131870/5009630-YLW00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8807251443742/5009630-PNK00.jpg"]}