{"name": "La Sportiva Wildcat Trail Running Shoes - Men's", "categories": ["Home", "All", "Run and fitness", "Running and training footwear", "Running shoes", "Trail running shoes", "Wildcat Trail Running Shoes"], "description": "A great, neutral fit, with excellent cushioning for longer trail runs. These shoes have superior traction and downhill braking stability, making them ideal for racing through technical terrain. Built on a medium to wide last.Uppers are a simple, one-piece construction with a protective, wear-resistant mesh trail cage. This outer is extremely breathable, provides quick drainage, and resists cutting.A large toebox provides ample wiggle room for the piggies, and the moulded TPU exoskeleton heel-stabilizer encourages accurate heel position when running downhill.The integral external scree guard keeps out stones and debris, while a soft, moisture-wicking synthetic honeycomb mesh liner provides a plush heel pocket.Midsoles feature a 2.4mm EVA lasting board for substantial underfoot cushioning, reducing the requirement for after-market footbeds. A compression-moulded midsole of 80% EVA and 20% SBR (synthetic butadiene rubber) provides a firm but cushioned midsole that is very lightweight, resilient and abrasion-resistant. A moulded nylon shank increases torsional stability and support.Outsoles are a soft and resilient, lightweight, non-marking rubber, with significant wear-and-tear resistance for good durability.Raised offset slanting lugs provide excellent traction and additional shock absorption.The heel block is hiking-boot inspired, to increase braking stability on descents.", "product_code": "5018-293", "tech_specs": {"Weight": ["726g (42)"], "Ideal for": ["Trail running"], "Feel\n\n'Minimal and natural' shoes offer low drop, lots of flex, and minimal cushioning. Most running shoes are 'Light and responsive' with medium cushioning and good energy return. 'Cushioned and floaty' shoes have maximum cushioning.": ["Light and responsive"], "Stability\n\nSome shoes include added motion control or stability features to help minimize over pronation, where the foot tends to roll inward in a biomechanically imbalanced running position.": ["Neutral"], "Closure": ["Lace-up"], "Heel-to-toe cushioning\n\nThe approximate thickness of the midsole cushioning under the heel and the forefoot. A thicker heel and greater difference between heel and toe height tends to suit heel-strike runners, while forefoot and midfoot strikers may prefer a minimal drop between heel and toe cushioning.": ["29-17mm"], "Drop\n\nThe drop is the difference in height between the heel and the forefoot midsole cushioning. Traditional running shoes tend to have a 10mm drop or higher while minimalist style shoes are on the lower end of the spectrum.": ["12mm"], "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": ["No"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9143672242206/5018293-CBO01.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9143686037534/5018293-CBO01-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9143686070302/5018293-CBO01-ALT-BOTTOM.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9143686103070/5018293-CBO01-ALT-FRONT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9143686332446/5018293-CBO01-ALT-SIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9143686430750/5018293-CBO01-ALT-TOP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8873601466398/5018293-CAR32.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9143672242206/5018293-CBO01.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9143686037534/5018293-CBO01-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9143686070302/5018293-CBO01-ALT-BOTTOM.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9143686103070/5018293-CBO01-ALT-FRONT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9143686332446/5018293-CBO01-ALT-SIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9143686430750/5018293-CBO01-ALT-TOP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8873601466398/5018293-CAR32.jpg"]}