{"name": "Zamberlan Vioz GT Gore-Tex Backpacking Boots - Women's", "categories": ["Home", "All", "Camping and hiking", "Hiking footwear", "Hiking boots", "Vioz GT Gore-Tex Backpacking Boots"], "description": "Well-designed, sturdy backpacking boots. The uppers are patterned slightly higher than lighter boots to provide additional comfort and support, making them suitable for medium loads on all types of terrain. Built-in GORE-TEX® booties provide waterproofness with breathability.Uppers are premium grade, full-grain leather, treated during tanning to ensure water resistance.GORE-TEX membrane is thermo-sealed into a bootie then fixed to the upper and glued to the midsole.Removable footbeds have a quick drying top fabric that wicks away moisture, a layer of active carbon, a cushioning layer, and small holes that aid breathability.Midsoles are stiff polyurethane for excellent stability and torsional rigidity on rough terrain. Allows good, tuned flex for natural movement and a consistent flex pattern across all sizes.TPU stabilizers ensure maximum stability and limitation of pronation and supination.Outsoles are Vibram® rubber, developed in cooperation with Zamberlan®.", "product_code": "5024-150", "tech_specs": {"Weight": ["1.36kg (39)"], "Ideal for": ["Backpacking"], "Upper material": ["Full-grain leather"], "Closure": ["Lace-up"], "Rand\n\nRubber on the toe and around the boot improves durability. It can also increase grip while scrambling.": ["None"], "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": ["Yes"], "Removable insole": ["Yes"], "Made in": ["Italy"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8853202534430/5024150-DBR02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8853202632734/5024150-DBR02-ALT-SOLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8853202534430/5024150-DBR02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8853202632734/5024150-DBR02-ALT-SOLE.jpg"]}