{"name": "Aquapac VHF Case", "categories": ["Home", "All", "Camping and hiking", "Electronics", "Electronics cases", "Camera and radio cases", "VHF Case"], "description": "Carry your VHF radio while kayaking, canoeing or sailing. This case protects your potentially life-saving gadget from wetness, and lets you operate the radio while it's in the case.Made of UV-stabilized polymers that don't break down or discolour in sunlight.In direct sunlight, the air inside a transparent case heats up and causes condensation, to reduce this use desiccant packs.High-frequency welded seams are as strong as the surrounding material.Accommodates left or right antenna.Includes an adjustable lanyard.Submersible to 5m and floats if dropped.Aquapac® does not guarantee the items inside the case, only the case itself. Likewise, MEC's Rock Solid Guarantee covers the product, but not the contents.", "product_code": "5025-319", "tech_specs": {"Weight": ["44g (Small)"], "Ideal for": ["Watersports"], "Closure": ["Watertight clip"], "Material": ["Thermoplastic polyurethane"], "Ruggedness\n\nFair: made of lightweight materials and designed to be carried inside another bag. Good: strikes a balance between light weight and durability. Excellent: made of heavy duty materials and designed to be carried alone. Exceptional: made of ultra-tough materials and designed to withstand abuse.": ["Excellent"], "Waterproofness\n\nWaterproof bags and cases are made with waterproof materials and have waterproof closures. Some are designed to be submersible. Water-resistant bags and cases are made with waterproof materials, but water could sneak in through the seams or closure.": ["Waterproof"], "Submersible": ["Yes"], "Length": ["36cm (Small)", "43cm (Large)"], "Width": ["11cm (Small)", "13cm (Large)"], "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": ["IP X8"], "Made in": ["United Kingdom"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817434492958/5025319-NOC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817434525726/5025319-NOC02-ALT-SMALL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817434492958/5025319-NOC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8817434525726/5025319-NOC02-ALT-SMALL.jpg"]}