{"name": "Maxim Equinox 9.9mm Rope", "categories": ["Home", "All", "Climbing", "Rock climbing", "Ropes, cords and slings", "Dynamic climbing ropes", "Equinox 9.9mm Rope"], "description": "The Equinox is a quality rope to suit climbers experiencing budgetary constraints. To keep manufacturing cost low, New England includes some undyed yarns in the sheath. This doesn't affect the quality or durability of the rope, merely the colour. This line is similar to the Maxim Apex rope, but with a less vibrant sheath.Endura dry treated core coats the inner fibres to increase durability overall. It is not dry rope suited to climbing in wet conditions.", "product_code": "5029-605", "tech_specs": {"Weight": ["3.78kg (60 Meter)"], "Ideal for": ["Rock climbing"], "Type": ["Single (9.9mm - 9.6mm)"], "Treatment\n\nDry ropes have a water-resistant treatment on both core and sheath. Dry (UIAA certified) ropes have both core and sheath treated, plus meet the UIAA Water Repellent standard by passing a stringent test where a soaked rope cannot absorb more than 5% of the rope's weight.": ["Non-dry"], "Length": ["60m (60 Meter)", "70m (70 Meter)"], "Dynamic elongation\n\nMaximum elongation in the first UIAA test fall, where a weight is attached to the rope and then dropped. Higher numbers indicate stretchier ropes.": ["29%"], "Static elongation\n\nIn controlled tests, a weight is suspended from the rope (not dropped). Higher numbers indicate stretchier ropes.": ["5%"], "Impact force\n\nThe amount of force, in kN, that the first UIAA fall puts on the falling object. Less impact force puts less force on the climber, belayer, and protection during a fall.": ["9.5kN"], "Linear weight": ["63g/m"], "Diameter": ["9.9mm"], "Halfway pattern change": ["No"], "UIAA fall rating\n\nIndicates the number of consecutive falls a rope withstood during testing in a controlled environment. The number is for reference only, and does not indicate the number of falls a rope will withstand during actual use or over its lifespan.": ["7"], "Made in": ["USA"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8807264321566/5029605-WH030.jpg"]}