{"name": "La Sportiva Wildcat 2.0 Gore-Tex Trail Running Shoes - Women's", "categories": ["Home", "All", "Run and fitness", "Running and training footwear", "Running shoes", "Trail running shoes", "Wildcat 2.0 Gore-Tex Trail Running Shoes"], "description": "Wildcats love being outside, even when it's wet. Superior traction, downhill braking, and cushioning makes these shoes ideal for extended runs on technical terrain. They’re lined with an extra-breathable GORE-TEX® membrane, so you won’t overheat during 3-season training or when you slink inside to stalk hot coffee and a muffin.Uppers are breathable, quick-draining Airmesh with protective, wear-resistant trail cages.Moulded TPU heel stabilizers ensure a stable ride.Liners are waterproof stretch GORE-TEX Extended Comfort to keep your feet dry.Midsoles incorporate soft EVA to reduce impact forces.Nylon shanks add stability without compromising flexibility.Outsoles are soft, resilient Vibram® Frixion AT rubber that’s lightweight, non-marking, and exceptionally wear resistant.Raised, offset, slanted lugs provide superior traction and added shock absorption.Built on a Tempo last, with a wider fit than other La Sportiva® runners.", "product_code": "5031-416", "tech_specs": {"Weight": ["660g (38)"], "Ideal for": ["Trail running"], "Feel\n\n'Minimal and natural' shoes offer low drop, lots of flex, and minimal cushioning. Most running shoes are 'Light and responsive' with medium cushioning and good energy return. 'Cushioned and floaty' shoes have maximum cushioning.": ["Light and responsive"], "Stability\n\nSome shoes include added motion control or stability features to help minimize over pronation, where the foot tends to roll inward in a biomechanically imbalanced running position.": ["Neutral"], "Closure": ["Lace-up"], "Heel-to-toe cushioning\n\nThe approximate thickness of the midsole cushioning under the heel and the forefoot. A thicker heel and greater difference between heel and toe height tends to suit heel-strike runners, while forefoot and midfoot strikers may prefer a minimal drop between heel and toe cushioning.": ["27-15mm"], "Drop\n\nThe drop is the difference in height between the heel and the forefoot midsole cushioning. Traditional running shoes tend to have a 10mm drop or higher while minimalist style shoes are on the lower end of the spectrum.": ["12mm"], "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": ["Yes"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9013540356126/5031416-CAR03.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9013718286366/5031416-CAR03-ALT-SOLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9013718548510/5031416-CAR03-ALT-LATERAL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9013718974494/5031416-CAR03-ALT-TOE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9013547368478/5031416-CAR03-ALT-HEEL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9013719105566/5031416-CAR03-ALT-TOP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9013540356126/5031416-CAR03.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9013718286366/5031416-CAR03-ALT-SOLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9013718548510/5031416-CAR03-ALT-LATERAL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9013718974494/5031416-CAR03-ALT-TOE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9013547368478/5031416-CAR03-ALT-HEEL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9013719105566/5031416-CAR03-ALT-TOP.jpg"]}