{"name": "MET Super Buddy Helmet - Children", "categories": ["Home", "All", "Cycling", "Bike helmets and body armour", "Bike helmets", "Super Buddy Helmet"], "description": "A reasonably priced helmet with an adjustable dial system to keep it fitting snugly on growing kids’ heads. The pinch-free chin buckle helps get your family bike ride off to a smooth start.Made of polystyrene with ABS outer shell. Twin-shell construction.Air vents have mesh to keep the bugs out.Lateral dividers ensure the straps are positioned correctly and stay in place.Anti-allergenic interior pads manage moisture, and can be washed by hand.Reflective stickers on the back.", "product_code": "5032-174", "tech_specs": {"Weight": ["250g"], "Ideal for": ["Urban cycling"], "Construction\n\nMicroshell helmets are made of a thin polymer sheet over a foam liner; Hardshell helmets have a hard polymer outer shell and a foam liner; when the liner is being bonded to the outer shell during the manufacturing process, it is Molded in the shell.": ["Microshell"], "Shell material": ["ABS"], "Fit system": ["Adjustable dial"], "Inner material": ["EPS (expanded polystyrene)"], "Circumference\n\nThe internal circumference determines the size head that the helmet will fit.": ["52-57cm"], "Vents": ["Yes"], "Approved for\n\nMost helmets are tested and certified for a specific sport. Some helmets are approved for multi-sports, but only after passing the safety tests for both sports (i.e., snowsports and cycling).": ["Cycling"], "Safety rating\n\nCetification is established by a variety of governing bodies who set impact standards. Most helmets are certified or approved for a specific sport, except in the case of multi-sport helmets (i.e., a snowsports helmet might also be approved for cycling if it meets the cycling safety standards).": ["EN 1078"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8810094067742/5032174-WH013.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8810093674526/5032174-PNK02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8810094067742/5032174-WH013.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8810093674526/5032174-PNK02.jpg"]}