{"name": "MET Crackerjack Helmet - Youths", "categories": ["Home", "All", "Cycling", "Bike helmets and body armour", "Bike helmets", "Crackerjack Helmet"], "description": "Keep your kids safe on their bikes, boards or blades. Fully adjustable, this helmet will keep growing along with them. The construction fuses the outer shell with the inner for improved shock absorption. If they go roaming through the bushes, the insect net will prevent bugs from getting in through the venting. And built-in LED keeps them visible in the dark.Fused, in-mold construction increases shock absorption to prevent injuries.Internal padding is hand washable and anti-allergenic.Built in LED in back  increases visibility at night.Insect netting under the vents prevents bugs from getting in.Removable visor.Anti-pinch buckle on the retention system.", "product_code": "5033-864", "tech_specs": {"Weight": ["265g (Black/Green Texture)"], "Ideal for": ["Urban cycling", "Mountain biking"], "Construction\n\nMicroshell helmets are made of a thin polymer sheet over a foam liner; Hardshell helmets have a hard polymer outer shell and a foam liner; when the liner is being bonded to the outer shell during the manufacturing process, it is Molded in the shell.": ["Molded in the shell"], "Shell material": ["Polycarbonate"], "Fit system": ["Adjustable dial"], "Inner material": ["EPS (expanded polystyrene)"], "Circumference\n\nThe internal circumference determines the size head that the helmet will fit.": ["52-57cm (Black/Green Texture)"], "Vents": ["Yes"], "Approved for\n\nMost helmets are tested and certified for a specific sport. Some helmets are approved for multi-sports, but only after passing the safety tests for both sports (i.e., snowsports and cycling).": ["Cycling"], "Safety rating\n\nCetification is established by a variety of governing bodies who set impact standards. Most helmets are certified or approved for a specific sport, except in the case of multi-sport helmets (i.e., a snowsports helmet might also be approved for cycling if it meets the cycling safety standards).": ["EN 1078"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9164670730270/5033864-LBM03.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8810120511518/5033864-BK829.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9164670730270/5033864-LBM03.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8810120511518/5033864-BK829.jpg"]}