{"name": "Pristine Replacement Filter 2", "categories": ["Home", "All", "Camping and hiking", "Camping kitchen and hydration", "Water bottles and water treatment", "Water filters, treatment and tablets", "Water filters", "Water filter parts and accessories", "Replacement Filter 2"], "description": "A replacement filter for Pristine Water Bottles. Most filters use a membrane to screen out the micro-organisms and parasites. This system uses a sintered polymer matrix that traps microorganisms, but provides less resistance to water, so you don't need a pump to push water through.Removes 99.9% or greater of cryptosporidium and giardia lambia.Removes sediment, organic debris, and chlorine taste.Each filter treats up 380L (depending on water quality).Pristine Water Treatment may also be added to the water for treatment against bacteria and viruses.", "product_code": "5034-301", "tech_specs": {"Weight": ["44g"], "Ideal for": ["Camping and hiking"], "Filter type\n\nWater can be treated using various types of filters, chemicals or non-chemical purification methods, or a combination. Filters on their own will not remove viruses as they are too small.": ["Sintered polymer technology"], "Cartridge life\n\nThe life of the filter cartridge is based on the quantity of water you can treat before the cartridge is no longer effective. This does not apply to battery operated or chemical filter systems.": ["380L"], "Effective against protozoa\n\nProtozoa are larger than one micron and include cryptosporidium and giardia.": ["Yes"], "Effective against viruses\n\nMost viruses are in the 0.1 micron size range, but they can be as small as 0.002 microns.": ["No"], "Effective against particulate\n\nParticulate consists of very small bits and pieces such as dirt or bugs.": ["Yes"], "Effective against bacteria\n\nBacteria can cause illnesses such as diarrhea and dysentery and are about 1.0 micron in size, although some can be as small as 0.2 microns.": ["Yes"], "Made in": ["USA"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8812679495710/5034301-NOC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8812679594014/5034301-NOC02-ALT-SITU.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8812679495710/5034301-NOC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8812679594014/5034301-NOC02-ALT-SITU.jpg"]}