{"name": "AlpineAire Southwestern Style Masa with Beef", "categories": ["Home", "All", "Camping and hiking", "Camping kitchen and hydration", "Food and drink", "Camping meals", "Southwestern Style Masa with Beef"], "description": "Set up camp and sit down to a tasty and easy to prepare corn meal seasoned with southwestern style spices with beef, pinto and black beans, cheddar cheese, brown rice and vegetables.No cooking required, just add boiling water.New packaging clearly shows allergens and nutritional information, and has a graduated scale on one side, so you can gauge how much water to add to your meal.Ingredients: corn meal, cooked freeze-dried diced beef, sharp cheddar cheese powder (pasteurized milk, cheese cultures, salt, enzymes, disodium phosphate, annatto extract), instant brown rice, tomato powder, chopped onion, tomato flakes, pinto bean flakes, black bean flakes, freeze-dried sweet corn, corn flakes, chili powder, green chili pepper, low sodium salt, low sodium chicken broth, garlic granules, black pepper, cilantro, and jalapeno pepper powder.", "product_code": "5040-890", "tech_specs": {"Weight": ["170g"], "Ideal for": ["Backpacking", "Winter and expedition camping", "Emergency preparedness"], "Serving size": ["1/2 package"], "Servings": ["2"], "Calories per serving": ["330Cal"], "Carbohydrates": ["46g"], "Sugar": ["10g"], "Sodium": ["770mg"], "Protein": ["20g"], "Dietary fibre": ["6g"], "Total fat": ["8g"], "Cholesterol": ["35mg"], "Saturated fat": ["4g"], "Cook in package\n\nThe food can be cooked simply by adding hot water into the sealable package.": ["Yes"], "Gluten free\n\nMade with gluten-free ingredients, but not necessarily in a guaranteed gluten-free environment.": ["Yes"], "Dairy free": ["No"], "Vegetarian\n\nDoes not contain animal products but may contain dairy or egg products.": ["No"], "Nut free\n\nThis product is nut free and is produced in a nut free environment.": ["Yes"], "Soy free": ["No"], "Vegan\n\nThis product does not contain animal products or by-products.": ["No"], "Made in": ["USA"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8812439240734/5040890-NOC02.jpg"]}