{"name": "La Sportiva Genius Rock Shoes - Unisex", "categories": ["Home", "All", "Climbing", "Climbing footwear", "Climbing shoes", "Genius Rock Shoes"], "description": "Hook, scum, and edge with unparalleled sensitivity, power, and confidence. A precise fit and edgeless sole lets you find every crystal on friction-dependent projects and sticky Vibram® XS Grip2 rubber adds smearing potential. Solution-proven P3® technology ensures powerful pulling and edging on steep lines, while the asymmetrical lace-up system provides a precision fit for every foot shape.Unlined uppers and perforated tongues are breathable for muggy rainforest sessions.No-Edge™ technology eliminates traditional edges of the sole, allowing optimal contact and sensitivity between foot and rock.P3® (Permanent Power Platform) ensures a downturned yet flexible shape for steep lines or featureless vert.Pointed toe allows precision on pocketed limestone.Sticky toe rand rubber coverage helps lock-in toe hooks.Thin, 3mm Vibram® XS Grip2 gives precise performance and maximum friction.La Sportiva suggests downsizing 1-1.5 sizes (performance fit) or 0.5-1 sizes (comfort fit) from your street shoe size.", "product_code": "5043-167", "tech_specs": {"Weight": ["440g (40)"], "Ideal for": ["Bouldering", "Indoor climbing", "Sport and toprope climbing"], "Type\n\nA neutral shoe suits long routes and cracks. Moderate shoes allow precision and good edging. Aggressive shoes are downturned and tensioned, for power to the toe on steep or overhanging routes.": ["Aggressive"], "Asymmetry\n\nHighly asymmetric shoes allow more precision and focused power. Symmetrical shoes are more comfortable for all-around climbing.": ["High"], "Stiffness\n\nStiffness is provided by the type of sole and the tensioning system. Softer shoes allow more precision. Supportive shoes prevent fatigue.": ["Soft"], "Uppers": ["Leather and synthetic"], "Closure": ["Lace-up"], "Outsoles": ["3mm Vibram XS Grip 2"], "Lined": ["No"], "Made in": ["Italy"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8809645703198/5043167-RED00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8809645703198/5043167-RED00.jpg"]}