{"name": "Pentax AD 8x36 WP Binoculars", "categories": ["Home", "All", "Camping and hiking", "Tools and accessories", "Binoculars and monoculars", "AD 8x36 WP Binoculars"], "description": "Excellent image quality housed in a compact package. The AD series uses high-quality multicoated optics that offer clarity normally associated with much larger binoculars. The body is made of a fiberglass reinforced polycarbonate that makes these both tough and lightweight.Phase-corrected BAK4 roof prisms.Fully multicoated optics offer bright, crisp, true-to-life images.Angle of view is 52 degrees.Waterproof and nitrogen-filled (JIS Class 6) to handle extreme weather conditions.Closed bridge configuration.Reinforced polycarbonate housing is extremely rigid, but light enough to carry anywhere.Twist-up eyecups.Tripod mountable.", "product_code": "5043-292", "tech_specs": {"Weight": ["638g"], "Ideal for": ["Everyday use"], "Magnification\n\nThis tells you how many times an object is magnified when observed through the binoculars.": ["8"], "Objective lens\n\nThe diameter of the objective lens will impact how bright, sharp, and comfortable your view is. Generally, bigger is better.": ["36mm"], "Lens coating\n\nLens coatings reduce light loss and glare to increase contrast and diminish eyestrain. Coated: one layer on external surfaces only. Fully coated: every surface is coated. Multi-coated: multiple layers on some of the surfaces. Fully multi-coated: multiple layers on every optical surface.": ["Fully multi-coated"], "Field of view\n\nThe widest dimension of circular viewing area that you can see.": ["113m"], "Minimum focus\n\nThe nearest distance at which the binoculars will focus on an object.": ["300cm"], "Exit pupil\n\nThe diameter of the objective (outside) lens divided by the binocular's magnification. It indicates the amount of light that reaches your eye (most noticeable in low light conditions). Higher numbers offer brighter images.": ["4.5mm"], "Eye relief\n\nThe distance between the eyepiece and your eye while still allowing entire field of view. Long eye relief is good for eyeglass wearers.": ["16mm"], "Dimensions": ["13 x 5.3 x 15.5cm"], "Dust proof": ["Yes"], "Fogproof": ["Yes"], "Waterproof\n\nWaterproof binoculars are assembled with O-rings and are purged with nitrogen to avoid condensation. They are ideal for boating or use in rainy weather.": ["Yes"], "Diopter adjustment\n\nThese binoculars can be adjusted for variances between right and left eye vision.": ["Yes"], "Includes case": ["Yes"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8813684293662/5043292-GRN00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8813684326430/5043292-GRN00-ALT-UP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8813684293662/5043292-GRN00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8813684326430/5043292-GRN00-ALT-UP.jpg"]}