{"name": "Black Diamond Creek 35 Pack - Unisex", "categories": ["Home", "All", "Packs and bags", "Daypacks and school bags", "Daypacks", "Creek 35 Pack"], "description": "Inspired by classic haul bags, this tough as nails climbing pack features technical details and fast access points. The waterproof, high-denier polyester holds up when used as a haulbag or when squeezing through chimneys. When that crucial piece of gear is sitting at the bottom of your pack, the full length side zipper allows access to the depths of your bag. On long approaches or multi-pitch routes, the padded straps and backpanel help ease the load. Climbing specific details like a concealable rope strap and an integrated helmet and/or rope holder sets this bag up for serious cragging, sending or projecting.Fabric is haul-bag tough polyester with a TPU coating for waterproofness and durability.Padded shoulder straps, removable padded hipbelt and thermoformed backpanel ease heavy loads.Top loading design stays upright for fast packing and unloading.Full length zipper allows for fast secondary access to main compartment.Front flap pocket has internal zippered pockets for fast access to your GPS, topo or snacks.Tuck-away rope strap.Stowable rain hood doubles as a helmet or rope holder.", "product_code": "5045-542", "tech_specs": {"Weight": ["1.66kg (Small/Medium)"], "Ideal for": ["Rock climbing"], "Main fabric": ["1200-denier polyester"], "Access\n\nThe location of all access points into the main compartment of the pack.": ["Top", "Side"], "Hipbelt": ["Removable padded"], "Volume": ["33L (Small/Medium)", "35L (Medium/Large)"], "Length": ["61cm (Medium/Large)"], "Width": ["33cm (Medium/Large)"], "Depth": ["10cm (Medium/Large)"], "Hipbelt circumference": ["66-102cm (Small/Medium)", "71-114cm (Medium/Large)"], "Ventilated back panel": ["No"], "Adjustable shoulder harness\n\nAn adjustable harness lets you change the height of the shoulder straps to fit your specific back length.": ["No"], "Dynamic suspension\n\nThe hipbelt and/or shoulder straps of the pack are designed to move, pivot or flex to follow your body’s movements.  Each brand uses their own technology.": ["No"], "Carry-on sized\n\nSize restrictions vary among airlines. Just to be sure, check with your carrier for their specific restrictions.": ["No"], "Additional feature(s)": ["Rain cover included", "Expandable collar"], "Made in": ["Philippines"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8814615592990/5045542-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8814614904862/5045542-BK000-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8814615592990/5045542-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8814614904862/5045542-BK000-ALT-BACK.jpg"]}