{"name": "Primus Profile Stove Dual", "categories": ["Home", "All", "Camping and hiking", "Camping kitchen and hydration", "Stoves, fuel and fire", "Camp stoves and grills", "Car camping stoves", "Profile Stove Dual"], "description": "Run the best burger stand at basecamp. With a grill on one side and a regular burner on the other, the Duo lets you barbeque perfect patties while heating side dishes or pots of water.Removable BBQ grill tray has a non-stick coating for easier cleaning.Stainless steel drip tray keeps the bottom clean.Piezoelectric ignitor means no fumbling for matches or lighters.Burns propane canisters. Adapter and hoses for larger propane bottles, such as those used for barbecues, can also purchased at hardware stores.", "product_code": "5046-330", "tech_specs": {"Weight": ["5.6kg"], "Ideal for": ["Car camping"], "Burner components": ["Steel", "Brass"], "Fuel\n\nStoves are designed to burn specific fuels. All stoves should only be used with recommended fuels to prevent damage.": ["Propane"], "Simmers": ["Yes"], "Cooking surface(s)": ["Grill", "One burner"], "Boil time\n\nThe average time it takes to boil 1L of water. Wind, air temperature and elevation will affect boil time in the field.": ["3 min"], "Output\n\nThe output of any heat generating device is shown in BTUs (British Thermal Units) which measure the amount of heat energy needed to raise the temperature of 1lb. of water by 1°F.": ["12,000BTU"], "Dimensions": ["59 x 12 x 32cm"], "Heat reflector\n\nHeat reflectors are placed under the burner and reflect heat back up towards the cooking pot. This helps save fuel and speed cooking time.": ["No"], "Pot included": ["No"], "Piezo ignition": ["Yes"], "Fuel pump\n\nLiquid fuel stoves require a fuel pump to pressurize the fuel tank.": ["No"], "Windscreen": ["Yes"], "Additional feature(s)": ["Drip tray"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8812664815646/5046330-NOC02.jpg"]}