{"name": "Patagonia Micro D Snap-T Jacket - Infants to Children", "categories": ["Home", "All", "Kids", "Baby (0-2 yrs)", "Baby clothing", "Baby fleece, hoodies and Sweaters", "Micro D Snap-T Jacket"], "description": "Retro styling combines with the goodness of fleece in this pint-sized hoodie for kids. Recycled polyester fleece keeps little cores warm when trekking through snowy forests. And it won't get bogged down with moisture when hiking or skiing.Recycled polyester microdenier fleece is lightweight, ultra-soft and quick to dry.Elastic binding on hood, cuffs and hem seals in warmth.Classic Patagonia Snap-T chest pocket.Handwarmer pockets keep hands toasty.\n\nRegular fit\n\n\n\nFit guide\n\nTechnical garments, designed for specific activities have features that aren’t always adaptable to general use. For example, cycling clothing is longer in the back and arms. Activity aside, the fit of MEC clothing falls into these categories:\n\n\n\n\n\nTight, with no room to spare.\n\n\n\n\n\nVery close fit, with a bit of room.\n\n\n\n\n\nGenerous, but not oversized.\n\n\n\n\n\nOversized with lots of room for layers.\n\n\nAll MEC men’s and boy’s pants are regular rise.\n\n\n\n\n        Sustainability\n\n\n\n\n\n.st0{stroke:#333;stroke-width:.79;stroke-miterlimit:10}\n\n\n\n\n\n\n\n\n                      Recycled content", "product_code": "5047-151", "tech_specs": {"Ideal for": ["Casual wear"], "Type": ["Mid-layer", "Fleece"], "Fabric weight\n\nMeasured in grams per square metre (gsm). The larger the number, the heavier and thicker the garment.": ["133gsm"], "Fabric content": ["100% recycled polyester"], "Pockets": ["1 external chest", "2 handwarmer"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["None"], "Hood": ["Standard"], "Durable water repellency\n\nUsually referred to as DWR. A treatment made to fabrics that causes water to bead and run off instead of soaking through.": ["No"], "Product sustainability": ["Recycled content"], "Made in": ["El Salvador"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9164868321310/5047151-MOY00.jpg"]}