{"name": "Patagonia Reversible Down Sweater Hoody - Infants to Children", "categories": ["Home", "All", "Kids", "Baby (0-2 yrs)", "Baby clothing", "Baby outerwear", "Baby jackets", "Baby insulated jackets", "Reversible Down Sweater Hoody"], "description": "When the wind blows and snow starts to fall, a sweater with 600-fill power down is an instant cloud of warmth. A DWR-treated shell seals out wetness (or spilled juice). The insulated hood has an elastic binding that snugs in close to keep out drafts and keep little outdoor beans happy through the winter months. When a style change-up is in order, it's totally reversible from a solid fabric to a pattern.Shell is recycled polyester ripstop with a DWR (durable water repellent) finish to keep it water-resistant and windproof.Lining is polyester plain weave with a DWR finish.Insulated with high-loft premium 600-fill power Traceable Down from ducks that were never live plucked or force fed.Sewn through construction keeps down compartmentalized and prevents clumping.Insulated hood has soft elastic binding.Full-length, centre-front zip.Zippered handwarmers on solid side and simple on-seam pockets on the print side keep little paws warm.Elastic sleeve cuffs seal out clouds of powder.", "product_code": "5053-242", "tech_specs": {"Ideal for": ["Casual wear"], "Type": ["Insulated down"], "Technology": ["Traceable Down"], "Construction": ["Sewn-through"], "Face fabric": ["30-denier recycled polyester"], "Lining/backer": ["Polyester"], "Insulation": ["600 fill-power duck down"], "Down weight": ["54g"], "Waterproofness\n\nWaterproof garments use waterproof-breathable technologies and are fully seam-taped. Water-resistant garments use waterproof-breathable technologies but their seams are not taped. Water-resistant garments repel water and protect against wind but are not made of waterproof fabric.": ["Water-resistant"], "Pockets": ["2 handwarmer", "2 front slash"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["Wind-resistant"], "Durable water repellency\n\nUsually referred to as DWR. A treatment made to fabrics that causes water to bead and run off instead of soaking through.": ["Yes"], "Hood": ["Insulated"], "Additional feature(s)": ["Reversible", "Reflective details"], "Made in": ["Bangladesh"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9137039179806/5053242-OGG04.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9136433332254/5053242-FAN06.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9137039179806/5053242-OGG04.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9136433332254/5053242-FAN06.jpg"]}