{"name": "Patagonia Micro Puff Jacket - Men's", "categories": ["Home", "All", "Clothing", "Jackets", "Insulated jackets", "Synthetic jackets", "Micro Puff Jacket"], "description": "A piece of high-tech magic from Patagonia. Seriously, the Micro Puff Jacket weighs about the same as a banana, yet it delivers alpine-grade warmth and the versatility of synthetic insulation. Patagonia calls it \"the best warmth for weight jacket we’ve ever built,\" and this is no small thing. PlumaFill insulation is a featherlight alternative to down: light, compressible and it retains warmth when wet. It's housed in a 10-denier nylon shell that's DWR-treated to repel rain and snow. The design is intentionally spare, with elastic at cuffs and hem and drop-in inner pockets that share the pocket bags of the handwarmer pockets. It's all sewn together with a unique quilting pattern that holds the fill in place without an excess stitch.Shell and lining are lightweight and windproof 10-denier Pertex Quantum nylon ripstop with a DWR finish to shed light precip.Insulated with 65g Plumafill synthetic insulation that is as warm and packable as down but with the warm-when-wet performance of synthetic.Quilted construction minimizes stitch lines to maximize loft and prevent cold spots.Zippered pockets warm chilly hands. The left one doubles as a stuff-sack with a refinforced carabiner clip loop.2 sleek internal drop-in pockets.Elasticized cuffs and hem seal in warmth.", "product_code": "5055-940", "tech_specs": {"Weight": ["235g (Black Large)", "235g (Forge Grey Large)"], "Ideal for": ["Camping and hiking", "Alpine climbing and mountaineering"], "Type": ["Insulated synthetic", "Mid-layer"], "Technology": ["Pertex Quantum", "PlumaFill"], "Construction": ["Quilted"], "Face fabric": ["10-denier nylon"], "Lining/backer": ["10-denier nylon"], "Insulation": ["65g/sq. m polyester"], "Waterproofness\n\nWaterproof garments use waterproof-breathable technologies and are fully seam-taped. Water-resistant garments use waterproof-breathable technologies but their seams are not taped. Water-resistant garments repel water and protect against wind but are not made of waterproof fabric.": ["Water-resistant"], "Pockets": ["2 handwarmer"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["Windproof"], "Length": ["Hip-length"], "Durable water repellency\n\nUsually referred to as DWR. A treatment made to fabrics that causes water to bead and run off instead of soaking through.": ["Yes"], "Additional feature(s)": ["Stuffs in own pocket"], "Made in": ["Vietnam"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8960586776606/5055940-FRG00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9046507388958/5055940-FRE00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8924042002462/5055940-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8960586776606/5055940-FRG00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9046507388958/5055940-FRE00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8924042002462/5055940-BK000.jpg"]}