{"name": "MSR WindBurner Duo Stove System", "categories": ["Home", "All", "Camping and hiking", "Camping kitchen and hydration", "Stoves, fuel and fire", "Camp stoves and grills", "Backcountry stoves", "Canister stoves", "WindBurner Duo Stove System"], "description": "With a radiant stove burner and heat exchanger built into the cooking pot, this WindBurner modular stove system is fast, fuel efficient and really shines when the conditions are challenging. Its internal regulator equalizes pressure so the burner operates at near max output at low fuel pressure and in cold temperatures. The 1.8L pot holds dinner for two, so this is a fantastic setup for two fast moving hikers. Nesting components keep it compact when packed, and the straining lid expands your menu options beyond ramen and rehydrated meals.1.8L pot with ceramic-coated non-stick surfaces and heat exchanger for versatile cooking.Pot lid has strainer holes plus locking latch to keep it on tight.Pressure regulator provides consistent performance at altitude or when fuel is low.Windproof radiant burner maintains heat levels.227g canister burns for about 95 minutes and boils approximately 18L of water.110g and 227g canisters fit inside.Stove and pot are an integrated system. Can't be used with standard flat-bottomed pots.Fuel canisters available separately.", "product_code": "5056-126", "tech_specs": {"Weight": ["605g"], "Ideal for": ["Backpacking", "Canoe tripping", "Kayak touring"], "Burner components": ["Brass", "Stainless steel", "Aluminum"], "Fuel\n\nStoves are designed to burn specific fuels. All stoves should only be used with recommended fuels to prevent damage.": ["LPG"], "Simmers": ["Yes"], "Boil time\n\nThe average time it takes to boil 1L of water. Wind, air temperature and elevation will affect boil time in the field.": ["4.5 min"], "Output\n\nThe output of any heat generating device is shown in BTUs (British Thermal Units) which measure the amount of heat energy needed to raise the temperature of 1lb. of water by 1°F.": ["7000BTU"], "Dimensions": ["13.3 x 13.3 x 20cm"], "Heat reflector\n\nHeat reflectors are placed under the burner and reflect heat back up towards the cooking pot. This helps save fuel and speed cooking time.": ["Yes"], "Pot included": ["Yes"], "Piezo ignition": ["No"], "Fuel pump\n\nLiquid fuel stoves require a fuel pump to pressurize the fuel tank.": ["No"], "Windscreen": ["Yes"], "Made in": ["USA"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8974312603678/5056126-NOC02.jpg"]}