{"name": "Gregory Deva 60 Backpack - Women's", "categories": ["Home", "All", "Camping and hiking", "Packs", "Backpacking packs", "Multi-day packs (55 - 75l)", "Deva 60 Backpack"], "description": "For multi-day summer trips or gear-intensive weekends. Gregory has incorporated the Deva's women's-specific fit into the new Response A3 suspension. The A3 chassis adjusts the shoulder harness and hipbelt load panels independently to accommodate your body as it moves, letting you maintain your balance and centre of gravity as you cross uneven terrain. The Deva 60 also includes a hydration sleeve that doubles as an ultralight backpack for summit bids or dayhikes from base camp. Highly water-resistant hipbelt pockets hold electronics, and an integrated raincover keeps your cargo dry.7075 aluminum wire frame has a women’s-specific wishbone shape to channel the load to the centre and lumbar regions of your back.Removable foam lumbar shim lets you customize lower back contouring.Bottom sleeping bag compartment has a removable internal divider.Twin side-mounted water bottle holsters are canted for easy access and stow away when not needed.Internal hydration reservoir sleeve has a pocket and mesh shoulder straps so you can use it as an ultralight backpack.Lots of pockets on the front, sides and lid keep you organized.Removable shockcord loops hold ice axes or trekking poles.Removable, adjustable straps attach at multiple points for lashing on a sleeping pad or tent poles.Maximum recommended cargo weight is 25kg.", "product_code": "5056-151", "tech_specs": {"Weight": ["2.05kg (Small)"], "Ideal for": ["Backpacking"], "Main fabric": ["210-denier nylon"], "Access\n\nThe location of all access points into the main compartment of the pack.": ["Top", "Front", "Bottom"], "Hipbelt": ["Padded"], "Lid type\n\nSome pack lids can be adjusted to compensate for overloaded packs, or even removed, and some removeable lids have tuck-away hipbelts that allow youto use them as a waistpack.": ["Adjustable"], "Volume": ["60L"], "Ventilated back panel": ["Yes"], "Adjustable shoulder harness\n\nAn adjustable harness lets you change the height of the shoulder straps to fit your specific back length.": ["Yes"], "Dynamic suspension\n\nThe hipbelt and/or shoulder straps of the pack are designed to move, pivot or flex to follow your body’s movements.  Each brand uses their own technology.": ["Yes"], "Carry-on sized\n\nSize restrictions vary among airlines. Just to be sure, check with your carrier for their specific restrictions.": ["No"], "Additional feature(s)": ["Compression straps", "Rain cover included", "Hipbelt pocket(s)", "Hydration compatible (reservoir sold separately)", "Ice axe/pole attachment", "Sleeping bag compartment", "Expandable collar", "Removable daypack included"], "Made in": ["Philippines"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8914019483678/5056151-PLU04.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8914020106270/5056151-PLU04-ALT-FRONT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8914020073502/5056151-PLU04-ALT-BACK34.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8914019549214/5056151-PLU04-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8914019483678/5056151-PLU04.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8914020106270/5056151-PLU04-ALT-FRONT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8914020073502/5056151-PLU04-ALT-BACK34.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8914019549214/5056151-PLU04-ALT-BACK.jpg"]}