{"name": "MEC Aquanator Jacket - Infants", "categories": ["Home", "All", "Kids", "Baby (0-2 yrs)", "Baby clothing", "Baby outerwear", "Baby jackets", "Baby rain jackets", "Aquanator Jacket"], "description": "A little rain shouldn't prevent little funhogs from getting outside. The fully waterproof-breathable fabric on the Aquanator Jacket ensures dryness through wet and windy conditions. The relaxed silhouette easily fits over several warm layers and can be worn as just a light jacket as conditions require.Shell is abrasion-resistant 75-denier polyester with a polyurethane waterproof-breathable coating and a DWR (durable water repellency) finish.Fully lined with polyester mesh that slides well over a fleece or sweatshirt and is soft against skin when worn over a T-shirt.Storm flap over zipper keeps weather out.Elasticized cuffs seal out the cold and damp.Reflective details for low-light visibility.Name tag so you know whose is whose.\n\nRegular fit\n\n\n\nFit guide\n\nTechnical garments, designed for specific activities have features that aren’t always adaptable to general use. For example, cycling clothing is longer in the back and arms. Activity aside, the fit of MEC clothing falls into these categories:\n\n\n\n\n\nTight, with no room to spare.\n\n\n\n\n\nVery close fit, with a bit of room.\n\n\n\n\n\nGenerous, but not oversized.\n\n\n\n\n\nOversized with lots of room for layers.\n\n\nAll MEC men’s and boy’s pants are regular rise.", "product_code": "5056-923", "tech_specs": {"Ideal for": ["Casual wear", "Camping and hiking"], "Type": ["Waterproof-breathable"], "Technology": ["Microporous PU laminate"], "Construction": ["2-layer"], "Face fabric": ["75-denier polyester"], "Fabric waterproof rating\n\nThe standard test for waterproof fabrics uses a standing column filled with water.  The figures given are the water column height.  A rating of 3,500mm or higher can be considered waterproof.  The higher the rating, the more durable the waterproof fabric will be over time.": ["14,000mm"], "Waterproofness\n\nWaterproof garments use waterproof-breathable technologies and are fully seam-taped. Water-resistant garments use waterproof-breathable technologies but their seams are not taped. Water-resistant garments repel water and protect against wind but are not made of waterproof fabric.": ["Waterproof with fully taped seams"], "Fabric active breathability\n\nThe rate at which a waterproof breathable fabric expels moisture when the inner surface is moist from perspiration.  Values under 8,000g/m2/24h provide low performance, 20,000g/m2/24h provide moderate performance and values over 30,000g/m2/24h provide high performance.": ["5000g/m2/24h"], "Pockets": ["None"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["Windproof"], "Durable water repellency\n\nUsually referred to as DWR. A treatment made to fabrics that causes water to bead and run off instead of soaking through.": ["Yes"], "Hood": ["Standard"], "Additional feature(s)": ["Reflective details"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9184167297054/5056923-VTB01.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9184167100446/5056923-GOT05.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9184167297054/5056923-VTB01.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9184167100446/5056923-GOT05.jpg"]}