{"name": "Gregory Deva 70 Backpack - Women's", "categories": ["Home", "All", "Camping and hiking", "Packs", "Backpacking packs", "Multi-day packs (55 - 75l)", "Deva 70 Backpack"], "description": "Built for big loads and multi-day trips, the Deva 70 uses a women's-specific fit and Gregory's Response A3 (Automatic Angle Adjust) suspension. The A3 chassis adjusts the shoulder harness and hipbelt load panels independently to accommodate changing body angles as you move. The design lets you maintain your balance and centre of gravity as you travel across uneven terrain. This clever pack also includes a hydration sleeve that doubles as an ultralight backpack for ridge runs and dayhikes from base camp. Highly water-resistant hipbelt pockets hold electronics and snacks, and an integrated raincover keeps your cargo dry.7075 aluminum wire frame has a women’s-specific wishbone shape to channel the load to the centre and lumbar regions of your back.Removable foam lumbar shim lets you customize lower back contouring.Bottom sleeping bag compartment has a removable internal divider.Twin side-mounted water bottle holsters are canted for easy access and stow away when not needed.Internal hydration reservoir sleeve has a pocket and mesh shoulder straps so you can use it as an ultralight backpack.Lots of pockets on the front, sides and lid keep you organized.Removable shockcord loops hold ice axes or trekking poles.Removable, adjustable straps attach at multiple points for lashing on sleeping pads.Maximum recommended cargo weight is 25kg.", "product_code": "5056-150", "tech_specs": {"Weight": ["2.18kg (Small)"], "Ideal for": ["Backpacking"], "Main fabric": ["210-denier nylon"], "Access\n\nThe location of all access points into the main compartment of the pack.": ["Top", "Front", "Bottom"], "Hipbelt": ["Padded"], "Lid type\n\nSome pack lids can be adjusted to compensate for overloaded packs, or even removed, and some removeable lids have tuck-away hipbelts that allow youto use them as a waistpack.": ["Adjustable"], "Volume": ["70L"], "Ventilated back panel": ["Yes"], "Adjustable shoulder harness\n\nAn adjustable harness lets you change the height of the shoulder straps to fit your specific back length.": ["Yes"], "Dynamic suspension\n\nThe hipbelt and/or shoulder straps of the pack are designed to move, pivot or flex to follow your body’s movements.  Each brand uses their own technology.": ["Yes"], "Carry-on sized\n\nSize restrictions vary among airlines. Just to be sure, check with your carrier for their specific restrictions.": ["No"], "Additional feature(s)": ["Compression straps", "Rain cover included", "Hipbelt pocket(s)", "Hydration compatible (reservoir sold separately)", "Ice axe/pole attachment", "Sleeping bag compartment", "Expandable collar", "Removable daypack included"], "Made in": ["Philippines"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8914020532254/5056150-AGR03.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8914016698398/5056150-AGR03-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8914020499486/5056150-AGR03-ALT-FRONT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8914021253150/5056150-AGR03-ALT-BACK34.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8914020532254/5056150-AGR03.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8914016698398/5056150-AGR03-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8914020499486/5056150-AGR03-ALT-FRONT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8914021253150/5056150-AGR03-ALT-BACK34.jpg"]}