{"name": "Osprey Hydraulics Reservoir", "categories": ["Home", "All", "Packs and bags", "Hydration packs and accessories", "Bladders, reservoirs and accessories", "Hydraulics Reservoir"], "description": "The most tricked-out hydration reservoir you're likely to see for a long time. It has a rigid backer plate that slides easily into a full pack and won't slump when it's half full. The quick disconnect system is part way along the hose, not at the bottom, so it's easy to remove the reservoir for re-filling. It's designed for easy filling (even from a shallow pool or creak) and you can pour water with control rather than dumping it on your shoes.Made of taste-free TPU film that contains no BPA, can be frozen and is safe to use with hot water (up to 140F/60C).Radio frequency welded seams offer a consistent air-tight seal that won't leak.Hydrostatic plate provides structure and maintains a flat profile that shoves neatly into a fully loaded pack.Slide Seal wide opening is easy to clean and dry. Dishwasher safe, on the top rack only.Pour shield extends the collar for filling in shallow sinks and streams and add control when pouring into pots or bottles.Integrated handle to pull it out of your pack.Flexible TPU hose resists kinks and can be routed to either side of the reservoir.QuickConnect tube system lets you remove the reservoir and leave the hose in place.HydraPak Blaster bite valve has an on/off switch to prevent dribbles. Magnetic clip attaches to the hose and pairs with the included sternum strap magnet.", "product_code": "5056-217", "tech_specs": {"Weight": ["210g (2L)", "220g (3L)"], "Ideal for": ["Backpacking", "Day hiking", "Mountain biking", "Running"], "Material": ["Polyurethane"], "Volume": ["2L (2L)", "3L (3L)"], "Wide-mouth opening": ["Yes"], "Quick-disconnect tube": ["Yes"], "Bite valve shut-off switch": ["Yes"], "Internal baffle\n\nInternal baffles help reduce liquid sloshing.": ["No"], "BPA-free": ["Yes"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8945963728926/5056217-NOC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8946109087774/5056217-NOC02-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8948666564638/5056217-NOC02-ALT-FRONT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8945963728926/5056217-NOC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8946109087774/5056217-NOC02-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8948666564638/5056217-NOC02-ALT-FRONT.jpg"]}