{"name": "Shred Ready Super Scrappy Helmet - Unisex", "categories": ["Home", "All", "Watersports", "PFDs, helmets and safety equipment", "Paddling helmets", "Super Scrappy Helmet"], "description": "A rugged ABS helmet with a bill. The unique H.O.G. (Hand Of God) 3.0 fitting adjustment system features two opposing ratchets that tighten monofilament lines on a PVC head harness. This system allows you to micro-tune the harness tension for a secure and comfortable fit.Injection-moulded ABS shell.Unique H.O.G. fitting adjustment system.Can be worn with brim forward or reversed.Multiple impact EPP foam liner laminated to a plush cloth that holds the fitting pads.Interchangeable closed-cell foam pads allow a custom fit.Soft tube nylon webbing.CE 1385 Certificate (International standard for whitewater helmets).", "product_code": "5058-158", "tech_specs": {"Weight": ["498g"], "Ideal for": ["Whitewater kayaking", "Whitewater canoeing", "Whitewater SUP"], "Construction\n\nMicroshell helmets are made of a thin polymer sheet over a foam liner; Hardshell helmets have a hard polymer outer shell and a foam liner; when the liner is being bonded to the outer shell during the manufacturing process, it is Molded in the shell.": ["Hardshell"], "Shell material": ["ABS"], "Fit system": ["Adjustable dial"], "Inner material": ["Vinyl Nitrate"], "Vents": ["No"], "Approved for\n\nMost helmets are tested and certified for a specific sport. Some helmets are approved for multi-sports, but only after passing the safety tests for both sports (i.e., snowsports and cycling).": ["Paddling"], "Safety rating\n\nCetification is established by a variety of governing bodies who set impact standards. Most helmets are certified or approved for a specific sport, except in the case of multi-sport helmets (i.e., a snowsports helmet might also be approved for cycling if it meets the cycling safety standards).": ["EN 1385"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8931617964062/5058158-CBK00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8931635822622/5058158-CBK00-ALT-SIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8931617964062/5058158-CBK00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8931635822622/5058158-CBK00-ALT-SIDE.jpg"]}