{"name": "Patagonia Insulated Snowshot Jacket - Men's", "categories": ["Home", "All", "Clothing", "Jackets", "Insulated jackets", "Synthetic jackets", "Insulated Snowshot Jacket"], "description": "Keep carving turns when the snow's pounding or the temperature's dropping. With waterproof-breathable face fabric, the Insulated Snowshot Jacket lets you keep cranking when you encounter wet coastal conditions. The quilted insulation stays warm when wet and keeps you toasty, even through unseasonable cold snaps. Underarm zips provide venting options to get you through the transition zones.Made from durable and soft H2No 2-layer recycled polyester with a waterproof-breathable laminate.Thermogreen synthetic insulation contains 70% recycled content.Mapped insulation puts more in the core where you feel the cold most and less in the arms for better mobility.Helmet-compatible, adjustable hood provides optimal visibility in bad conditions.Tall stand-up collar protects neck and face even with hood down.Pit zips quickly release heat when temps rise.Low-profile powder skirt has a webbing loop to mate with your snow pants.Handwarmer pockets have cozy brushed lining for extra warmth.Chest pocket holds your phone and a media port lets you route your headphone cord.Internal zippered pocket has a clip to secure your keys.Stash your gloves or goggles in the inside drop-in pocket.Drawcord hem adjustments are hidden inside the hand pockets for easy access.Recco® Rescue System reflector is detectable by ski patrol and rescue teams. Useful for resort skiing, it is not a substitute for skills training, beacons, or smart decision-making in the backcountry.", "product_code": "5058-528", "tech_specs": {"Weight": ["921g (Medium)"], "Ideal for": ["Downhill skiing", "Snowboarding"], "Type": ["Waterproof-breathable", "Insulated synthetic"], "Technology": ["H2No", "Thermogreen"], "Construction": ["2-layer"], "Face fabric": ["75-denier recycled polyester"], "Lining/backer": ["Polyester"], "Insulation": ["80g/sq. m polyester (body)", "40g/sq. m polyester (arms)"], "Waterproofness\n\nWaterproof garments use waterproof-breathable technologies and are fully seam-taped. Water-resistant garments use waterproof-breathable technologies but their seams are not taped. Water-resistant garments repel water and protect against wind but are not made of waterproof fabric.": ["Waterproof with fully taped seams"], "Venting": ["Underarm zips"], "Pockets": ["2 handwarmer", "1 external chest with cord port", "1 internal zippered", "1 internal drop-in"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["Windproof"], "Length": ["Below hip"], "Durable water repellency\n\nUsually referred to as DWR. A treatment made to fabrics that causes water to bead and run off instead of soaking through.": ["Yes"], "Hood": ["Adjustable", "Helmet-compatible"], "Additional feature(s)": ["Powder skirt", "Recco® system", "Snow pant attachment loop", "Wind flap behind zipper"], "Made in": ["Vietnam"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9140725645342/5058528-BL464.jpg"]}