{"name": "New Balance Minimus 10v1 Trail Running Shoes - Women's", "categories": ["Home", "All", "Run and fitness", "Running and training footwear", "Running shoes", "Trail running shoes", "Minimus 10v1 Trail Running Shoes"], "description": "This minimal trail runner delivers the benefits of barefoot running with the protection of a lightweight shoe. Developed with input from athletes, the WT10 keeps you low to the ground and gives you a precise feel for the terrain beneath your feet.Upper is breathable synthetic mesh with synthetic overlays to help secure the foot naturally in place.Midsole is light, low-profile Acteva foam (9mm in heel, 5mm in forefoot) with poly-olefin elastomer for the minimalist feel of barefoot training with a degree of cushioning and protection.Acteva foam is 12% lighter than standard EVA and has better compression resistance for durable cushioning.Outsole is low-profile Vibram® for trail-worthy grip without weight and bulk.", "product_code": "5059-307", "tech_specs": {"Weight": ["362g (7.0B)"], "Ideal for": ["Trail running"], "Feel\n\n'Minimal and natural' shoes offer low drop, lots of flex, and minimal cushioning. Most running shoes are 'Light and responsive' with medium cushioning and good energy return. 'Cushioned and floaty' shoes have maximum cushioning.": ["Minimalist and natural"], "Stability\n\nSome shoes include added motion control or stability features to help minimize over pronation, where the foot tends to roll inward in a biomechanically imbalanced running position.": ["Neutral"], "Upper material": ["Synthetic"], "Closure": ["Lace-up"], "Heel-to-toe cushioning\n\nThe approximate thickness of the midsole cushioning under the heel and the forefoot. A thicker heel and greater difference between heel and toe height tends to suit heel-strike runners, while forefoot and midfoot strikers may prefer a minimal drop between heel and toe cushioning.": ["9 - 5mm"], "Drop\n\nThe drop is the difference in height between the heel and the forefoot midsole cushioning. Traditional running shoes tend to have a 10mm drop or higher while minimalist style shoes are on the lower end of the spectrum.": ["4mm"], "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": ["No"], "Made in": ["Vietnam"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066187685918/5059307-BNV55.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066192797726/5059307-BNV55-ALT-MEDIAL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066192896030/5059307-BNV55-ALT-SOLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066193027102/5059307-BNV55-ALT-TOP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066187685918/5059307-BNV55.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066192797726/5059307-BNV55-ALT-MEDIAL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066192896030/5059307-BNV55-ALT-SOLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066193027102/5059307-BNV55-ALT-TOP.jpg"]}