{"name": "MEC Great Northern Down Parka - Men's", "categories": ["Home", "All", "Clothing", "Jackets", "Parkas and winter coats", "Great Northern Down Parka"], "description": "A Great Northern Parka to take on your greatest winter adventures. It's designed to keep you warm as winter winds howls through the streets. The waterproof-breathable material has a DWR finish, a combo that stops the wet side of winter in its tracks. Insulated with toasty duck down that's responsibly sourced, this parka is at home on cold morning commutes or chilly weekend outings.2-layer waterproof breathable exterior shield you from icy rain and slush.Exterior and interior material have a DWR finish to help keep you dry.Removeable insulated hood has a soft faux fur trim diffuses harsh winter winds and zips off when you do not need it.550-fill power duck down provides pillowy insulation.Down insulation is Responsible Down Certified, so you can feel good about your down.Horizontal baffles create tunnels of warmth that wraparound your body.Internal shoulder straps let wear the parka like a pack by slipping your arms out of the sleeves, this lets you ventilate on the go without having to carry the parka.Plenty of pocket space to keep small necessities close while dual entry fleece-lined pockets keep hands out from the cold.Smooth lining material glides over other fabric for easy layering.Soft knit cuffs keep the warm in and the cold out.Regular fit wears like an old favourite.\n\nRegular fit\n\n\n\nFit guide\n\nGarments, designed for specific activities have features that aren’t always adaptable to general use. For example, cycling clothing is longer in the back and arms. Activity aside, the fit of MEC clothing falls into these categories:\n\n\n\n\n\nOur next to skin fit that contours the body for no distractions\n\n\n\n\n\nOur close to body fit with a low profile silhouette for ease of movement\n\n\n\n\n\nOur standard, slightly off body fit for unrestricted comfort\n\n\n\n\n\nOur roomy, off body fit for maximum comfort and easy layering\n\n\nAll MEC men’s and boy’s pants are regular rise.\n\n\n\n\n        Sustainability\n\n\n\n\n\n\n.bluesign-cls-1,.bluesign-cls-2,.bluesign-cls-3{fill:none;}.bluesign-cls-2,.bluesign-cls-3{stroke:#333;stroke-width:1.79px;}.bluesign-cls-2{stroke-linejoin:round;}.bluesign-cls-3{stroke-miterlimit:10;}\n\nBluesign\n\n\n\n\n\n\n\n\n\n\n\n                      Bluesign® Approved Material\n\n\n\n\n\n\n\n\n\n\n\n\n                      Certified Responsible Down", "product_code": "5059-873", "tech_specs": {"Ideal for": ["Casual wear"], "Type": ["Insulated down", "Waterproof-breathable"], "Construction": ["2-layer", "Quilted"], "Face fabric": ["Nylon"], "Lining/backer": ["30-denier nylon"], "Insulation": ["550 fill-power duck down"], "Down weight": ["320g"], "Fabric waterproof rating\n\nThe standard test for waterproof fabrics uses a standing column filled with water.  The figures given are the water column height.  A rating of 3,500mm or higher can be considered waterproof.  The higher the rating, the more durable the waterproof fabric will be over time.": ["10,000mm"], "Waterproofness\n\nWaterproof garments use waterproof-breathable technologies and are fully seam-taped. Water-resistant garments use waterproof-breathable technologies but their seams are not taped. Water-resistant garments repel water and protect against wind but are not made of waterproof fabric.": ["Waterproof without taped seams"], "Pockets": ["1 internal drop-in", "2 handwarmer", "1 front with flap"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["Windproof"], "Length": ["Below hip"], "Durable water repellency\n\nUsually referred to as DWR. A treatment made to fabrics that causes water to bead and run off instead of soaking through.": ["Yes"], "Hood": ["Insulated", "Removable"], "Additional feature(s)": ["Wind flap behind zipper"], "Product sustainability": ["Bluesign® Approved Material", "Certified Responsible Down"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9127954841630/5059873-IRN11.jpg"]}