{"name": "Salomon Brigade+ Helmet - Unisex", "categories": ["Home", "All", "Ski and snowboard gear", "Ski and snowboard helmets", "Brigade+ Helmet"], "description": "The Brigade helmet has been around for a while, but this version is one of the best equipped. Packing style and safety, the Brigade+ uses Salomon's EPS4D foam with EPP inserts to protect your head against impacts and is approved for both cycling and snowsports. The Active ventilation system lets you tune the amount of airflow you need to stay comfortable and keep your goggles free of fog. The removable and washable liner offers smell-free warmth during long runs down snowy slopes, while the integrated summer pads keeps you comfortable on summer rides around town.Injected ABS Shell is used for its long-lasting durability and ding-resistant strength.EPS4D liner with EPP inserts provides high energy absorption on impact.Active ventilation lets you tune the amount of airflow to keep you comfortable.Integrated Custom Dial adjustment provides a precise and comfortable fit.Removable earpads are audio system–compatible.Removable washable liner.", "product_code": "5060-703", "tech_specs": {"Ideal for": ["Downhill skiing", "Snowboarding", "Cycle commuting", "Urban cycling"], "Construction\n\nMicroshell helmets are made of a thin polymer sheet over a foam liner; Hardshell helmets have a hard polymer outer shell and a foam liner; when the liner is being bonded to the outer shell during the manufacturing process, it is Molded in the shell.": ["Hardshell"], "Shell material": ["ABS"], "Fit system": ["Adjustable dial"], "Inner material": ["EPP (expanded polypropylene)", "EPS (expanded polystyrene)"], "Circumference\n\nThe internal circumference determines the size head that the helmet will fit.": ["56-59cm (Medium)", "59-62cm (Large)", "62-64cm (X-Large)"], "Vents": ["Yes"], "Goggle clip": ["Yes"], "Removable ear liners": ["Yes"], "Approved for\n\nMost helmets are tested and certified for a specific sport. Some helmets are approved for multi-sports, but only after passing the safety tests for both sports (i.e., snowsports and cycling).": ["Snowsports", "Cycling"], "Safety rating\n\nCetification is established by a variety of governing bodies who set impact standards. Most helmets are certified or approved for a specific sport, except in the case of multi-sport helmets (i.e., a snowsports helmet might also be approved for cycling if it meets the cycling safety standards).": ["EN 1077: 2007", "ASTM F2040", "EN 1078", "CPSC"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132512477214/5060703-EBN00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132512477214/5060703-EBN00.jpg"]}