{"name": "MEC Sphere 500 USB Front Light", "categories": ["Home", "All", "Cycling", "Bike accessories", "Bike lights", "Front bike lights", "Sphere 500 USB Front Light"], "description": "A little bit bigger, but a whole lot brighter. The Sphere 500 builds on MEC’s compact USB-powered bike light line, keeping the small form factor and ease of use, but getting a big lumen upgrade. Blaze a path through the night – with up to 500 lumens at your disposal, you'll see and be seen. Versatile silicone attachment loop makes it easy to mount this little bike light nearly anywhere.6 modes: high (1.2 hours at 500 lumens), medium (2.5 hours at 250 lumens), low (5 hours at 120 lumens), quick flash (4.5 hours at 80 lumens), signal flash (2.2 hours) and warning flash (2.5 hours).1-button interface is easy to use with or without gloves.Easy USB charging means you no longer have to get by with “good enough” batteries.LED battery indicator lets you know when it's time to charge.Light and efficient lithium-polymer batteries.Side cutouts add side visibility for an extra level of protection.Tool-free strap mount attaches to your handlebars (22-35mm), seat post, chainstays, forks or helmet vents.O-ring seal makes this light ready for heavy rain – it's waterproof, but not submersible.", "product_code": "5061-908", "tech_specs": {"Weight": ["114g"], "Ideal for": ["Cycle commuting", "Urban cycling", "Sport road cycling"], "Type\n\nMost Canadian municipalities require a white front light and a red rear light.": ["Front"], "Light modes\n\nThe number of lighting levels/modes the light has (i.e., low, med, high, flash).": ["6 modes"], "Boost mode\n\nBriefly increases the light output to maximum brightness and distance.": ["No"], "Light source": ["1 LED"], "Burn time - flash": ["4.5-2.2 h"], "Burn Time - steady": ["5-1.2 h"], "Max light output\n\nThe total quantity of light emitted in every direction from a source of light; measured in lumens.": ["500 lumens"], "Charge time\n\nThe amount of time it takes to fully charge the battery. Applies to lithium and NiMH type batteries. Does not apply to rechargeable or non-rechargeable AA or AAA batteries.": ["4.5 h"], "Rechargeability\n\nRechargeable lights give you hassle-free recharging with almost any power source. Replaceable batteries provide instant power, but you’ll need to bring extra batteries, recycle used ones and buy new ones.": ["Rechargeable"], "Helmet attachment\n\nIncludes a bracket or mounting system that attaches to most bike helmets.": ["Yes"], "Red light mode": ["No"], "Regulated output\n\nOn regulated lights brightness is consistent, and does not decrease gradually as the batteries are drained.": ["No"], "Batteries": ["Rechargeable battery pack (non-removable)"], "Flash mode": ["Yes"], "Product sustainability": ["Rechargeable batteries"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8999553466398/5061908-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8999553630238/5061908-BK000-ALT-CHARGE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8999553466398/5061908-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8999553630238/5061908-BK000-ALT-CHARGE.jpg"]}