{"name": "MEC Super Turtle Rear Light", "categories": ["Home", "All", "Cycling", "Bike accessories", "Bike lights", "Rear bike lights", "Super Turtle Rear Light"], "description": "The next evolution of the popular Turtle Light isn’t just pretty good – it’s super. Keeping the great size and ease of use that made the Turtle Light a hit, the Super Turtle Rear Light has been upgraded with better materials and a brighter beam.2 bright red LEDs make you spottable in the dark.Silicone strap attaches to wrist, backpack, seat post, chainstays, forks, keychain or your pet's collar.Steady or flashing mode.Batteries are user-replaceable.O-ring seal makes this light ready for heavy rain – it's waterproof, but not submersible.", "product_code": "5061-911", "tech_specs": {"Weight": ["18g"], "Ideal for": ["Urban cycling", "Cycle commuting", "Road cycling"], "Type\n\nMost Canadian municipalities require a white front light and a red rear light.": ["Rear"], "Light modes\n\nThe number of lighting levels/modes the light has (i.e., low, med, high, flash).": ["2 modes"], "Light source": ["2 red LEDs"], "Burn time - flash": ["70 h"], "Burn Time - steady": ["20 h"], "Max light output\n\nThe total quantity of light emitted in every direction from a source of light; measured in lumens.": ["8 lumens"], "Rechargeability\n\nRechargeable lights give you hassle-free recharging with almost any power source. Replaceable batteries provide instant power, but you’ll need to bring extra batteries, recycle used ones and buy new ones.": ["Non-rechargeable"], "Helmet attachment\n\nIncludes a bracket or mounting system that attaches to most bike helmets.": ["No"], "Red light mode": ["Yes"], "Regulated output\n\nOn regulated lights brightness is consistent, and does not decrease gradually as the batteries are drained.": ["No"], "Batteries": ["2 lithium CR2032 (included)"], "Flash mode": ["Yes"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8999429242910/5061911-RED00.jpg"]}