{"name": "Silva Trail Speed 3XT Headlamp", "categories": ["Home", "All", "Camping and hiking", "Headlamps and lighting", "Headlamps", "Trail Speed 3XT Headlamp"], "description": "A small light with a big throw. The Trail Speed 3XT’s machined aluminum light head packs in 2 LEDs mounted in a custom-engineered reflector, lighting obstacles both near and far. Knowing that there isn’t a single best type of lighting for every sport, Silva developed Flow lighting, a mix of flood and spot. Flow lighting lets you see up the trail with the spot, while making sure you can see what’s in front of you with the flood light. Whether you’re in your hiking boots or runners, on your bike or on your skis, Silva has included a mount for you. And the easily rechargeable battery pack makes sure the days of \"good enough\" batteries are behind you.Flow lighting provides a mix of a flood and spot beam, specifically engineered to avoid the tunnel vison effect that can come from using a bright spotlight.USB-rechargeable battery pack is easy to top up, meaning you never have to make do with \"good enough\" batteries again.Battery extension cord gives you the option of putting the battery pack in your bag or inside a jacket pocket, which removes weight from your head and lets you keep the batteries warm for better cold-weather performance.5-level LED power indicator lets you know when your battery pack needs charging.Power reserve mode gives you 1 hour at low output to get to safety.3 different mounting options (helmet, handlebar and head) let you use your light for many activities.Anti-slip headband stays in place when on the move.Large, 1-button interface is easy to use with or without gloves.Rugged aluminum housing has integrated heat sink fins, making sure your light doesn’t overheat.Lumens and runtimes measured to the ANSI/NEMA FL1 standard.IPX5 waterproofing stands up to any weather you’re willing to go out in.In the box: Trail Speed 3XT headlamp, rechargeable 3.3Ah battery pack, extension cable, USB charging cable, handlebar bracket, helmet bracket and carrying case.", "product_code": "5061-069", "tech_specs": {"Weight": ["241g"], "Ideal for": ["Trail running", "Running", "Cross-country skiing", "Cycle commuting"], "Light modes\n\nThe number of lighting levels/modes the light has (i.e., low, med, high, flash).": ["4 modes"], "Beam distance - low": ["40m"], "Beam distance - med": ["70m"], "Beam distance - high": ["130m"], "Boost mode\n\nBriefly increases the light output to maximum brightness and distance.": ["No"], "Burn time - low": ["10 h"], "Burn time - med": ["7.5 h"], "Burn time - high": ["5 h"], "Max light output\n\nThe total quantity of light emitted in every direction from a source of light; measured in lumens.": ["800 lumens"], "Beam pattern\n\nBeam pattern affects how much you can see within the area of light thrown from the headlamp. Wide beams are good for close-up; spot or focussed beams are good for long range visibility.": ["Wide", "Spot"], "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": ["IP X5"], "Rechargeability\n\nRechargeable lights give you hassle-free recharging with almost any power source. Replaceable batteries provide instant power, but you’ll need to bring extra batteries, recycle used ones and buy new ones.": ["Rechargeable"], "Red light mode": ["No"], "Regulated output\n\nOn regulated lights brightness is consistent, and does not decrease gradually as the batteries are drained.": ["No"], "Batteries": ["Lithium-ion (included)"], "Flash mode": ["Yes"], "Product sustainability": ["Rechargeable batteries"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8980102053918/5061069-NOC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8983997218846/5061069-NOC02-ALT-DETAIL1.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8983997251614/5061069-NOC02-ALT-DETAIL2.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8980102053918/5061069-NOC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8983997218846/5061069-NOC02-ALT-DETAIL1.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8983997251614/5061069-NOC02-ALT-DETAIL2.jpg"]}