{"name": "MEC Crux Gloves - Unisex", "categories": ["Home", "All", "Clothing", "Clothing accessories", "Gloves and mittens", "Gloves", "Crux Gloves"], "description": "Great for wet, cold coastal mountain days or warmish days in the East. The Crux are light enough to keep you dexterous but warm enough for on-mountain action. A waterproof-breathable membrane and light insulation get you through the windchill for a last run or extra pitch. The shaped design and curved fingers allow you leave your gloves on to adjust your bindings, harnesses or other small fiddly things.100g Thermolite® Micro synthetic insulation is bluesign approved.DWR finish and a sewn-in waterproof-breathable lining keep you dry.Doubled layer leather palm, anchored with 2 rows of Kevlar® stitching.Textured palm aids gripping tools or poles.Leather finger and knuckle protection.Soft fleece lining wicks moisture.Anatomic patterning, subtle pre-curved fingers and an articulated thumb combine for incredible dexterity.Short gauntlet cuff has a gusseted hook-and-loop closure.Short cuff loops make pulling on the gloves a cinch.Clip to keep them together.\n\n        Sustainability\n\n\n\n\n\n\n.bluesign-cls-1,.bluesign-cls-2,.bluesign-cls-3{fill:none;}.bluesign-cls-2,.bluesign-cls-3{stroke:#333;stroke-width:1.79px;}.bluesign-cls-2{stroke-linejoin:round;}.bluesign-cls-3{stroke-miterlimit:10;}\n\nBluesign\n\n\n\n\n\n\n\n\n\n\n\n                      Bluesign® Approved Material", "product_code": "5061-736", "tech_specs": {"Ideal for": ["Backcountry skiing", "Snowboarding", "Snowshoeing", "Alpine climbing and mountaineering"], "Type": ["Gloves"], "Insulation": ["Light"], "Main fabric": ["90% nylon", "10% spandex"], "Liner fabric": ["100% polyester"], "Palm material\n\nThe type of material used on the palm of the glove. Grippy palms have a raised silicone or polyurethane pattern to improve grip and are most often seen on cycling and paddling handwear.": ["Leather"], "Liner type": ["Sewn-in"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["Windproof"], "Hand warmer pocket\n\nThe gloves or mitts feature a small pocket to insert a heater pack for extra warmth.": ["No"], "Touchscreen compatible": ["No"], "Waterproof": ["Yes"], "Product sustainability": ["Bluesign® Approved Material"], "Made in": ["Cambodia"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9044678344734/5061736-BK000.jpg"]}