{"name": "The North Face Recon Daypack - Unisex", "categories": ["Home", "All", "Packs and bags", "Daypacks and school bags", "School and office packs", "Recon Daypack"], "description": "With enough capacity for heavy course loads and comfy straps to carry heavy books, the Recon Daypack is your go-to bag for lecture hall missions or all-night study epics. Purpose-built pockets carry your laptop, tablet, pens, sunglasses, water bottles and other school essentials. The FlexVent suspension has a central ventilation channel to keep you back cool when you're running for the bus.FlexVent suspension system provides a comfortable carry thanks to injection-moulded foam shoulder straps and a padded back panel with a mesh overlay.Back panel has a central ventilation channel to keep you cool.Webbing waistbelt can be deployed to assist with heavy loads or removed when not needed.Large main compartment swallows books and binders.Front organizer compartment has zippered pockets, pen slots and a padded tablet sleeve.Dedicated sleeve holds a 15in. laptop and is padded for extra protection.Front stash pocket has stretch side panels that expand to hold extra gear.Top pocket has a fleece lining to protect your sunglasses or electronics.Side mesh pockets hold water bottles or an umbrella.Reflective bike light loop and reflective details on the sides and shoulder straps keep you visible at night.", "product_code": "5061-494", "tech_specs": {"Weight": ["1.125kg"], "Ideal for": ["Office and school"], "Main fabric": ["500-denier nylon"], "Padded sleeve fits most\n\nA padded slot to fit electronics or laptops, it may be partially or fully padded on each side.": ["15-inch laptop", "tablet"], "Access\n\nThe location of all access points into the main compartment of the pack.": ["Clamshell zip"], "Hipbelt": ["Removable waistbelt"], "Volume": ["30L"], "Length": ["49cm"], "Width": ["33cm"], "Depth": ["18cm"], "Ventilated back panel": ["No"], "Dynamic suspension\n\nThe hipbelt and/or shoulder straps of the pack are designed to move, pivot or flex to follow your body’s movements.  Each brand uses their own technology.": ["No"], "Carry-on sized\n\nSize restrictions vary among airlines. Just to be sure, check with your carrier for their specific restrictions.": ["Yes"], "Additional feature(s)": ["Compression straps", "Reflective details"], "Made in": ["Vietnam"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/8982954901534/5061494-BK276.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8985211764766/5061494-BK276-ALT-STRAPS.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8982954901534/5061494-BK276.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/8985211764766/5061494-BK276-ALT-STRAPS.jpg"]}