{"name": "Mammut Masao Light HS Hooded Jacket - Women's", "categories": ["Home", "All", "Camping and hiking", "Hiking clothing", "Hiking jackets", "Masao Light HS Hooded Jacket"], "description": "A minimalist jacket that stands up to maximalist weather. The stripped-back Mammut Masao Light jacket is made of lightweight fabric and folds down small in a stuff sack to hide away in your backpack. But it still provides bomber protection from rain and wind, thanks to the internal DryTechnology Performance waterproof-breathable membrane.Made of lightweight yet durable nylon with a DryTechnology Performance waterproof-breathable membrane.YKK Aquaguard front zipper keeps rain out.Helmet-compatible hood has a reinforced brim and adjustments for visibility.Zippered hand pockets are compatible with your climbing harness or backpack hipbelt.Underarm zippers for venting when you're working hard.Pre-shaped sleeves promote range of motion for climbing.Asymmetric cuffs add coverage with elastic on one side for a snug fit.Drawcord hem seals out the weather.Includes a low-profile stuff sack.Athletic fit.", "product_code": "5062-689", "tech_specs": {"Ideal for": ["Alpine climbing and mountaineering", "Camping and hiking"], "Type": ["Waterproof-breathable"], "Technology": ["DryTechnology"], "Construction": ["3-layer"], "Face fabric": ["Nylon"], "Lining/backer": ["Nylon"], "Fabric waterproof rating\n\nThe standard test for waterproof fabrics uses a standing column filled with water.  The figures given are the water column height.  A rating of 3,500mm or higher can be considered waterproof.  The higher the rating, the more durable the waterproof fabric will be over time.": ["20,000mm"], "Waterproofness\n\nWaterproof garments use waterproof-breathable technologies and are fully seam-taped. Water-resistant garments use waterproof-breathable technologies but their seams are not taped. Water-resistant garments repel water and protect against wind but are not made of waterproof fabric.": ["Waterproof with fully taped seams"], "Fabric active breathability\n\nThe rate at which a waterproof breathable fabric expels moisture when the inner surface is moist from perspiration.  Values under 8,000g/m2/24h provide low performance, 20,000g/m2/24h provide moderate performance and values over 30,000g/m2/24h provide high performance.": ["25,000g/m2/24h"], "Venting": ["Underarm zips"], "Pockets": ["2 front zippered"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["Windproof"], "Length": ["Hip-length"], "Durable water repellency\n\nUsually referred to as DWR. A treatment made to fabrics that causes water to bead and run off instead of soaking through.": ["Yes"], "Hood": ["Adjustable", "Helmet-compatible"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9026807332894/5062689-WAT36.jpg"]}