{"name": "Julbo Shield Sunglasses - Unisex", "categories": ["Home", "All", "Clothing", "Clothing accessories", "Sunglasses", "Sport sunglasses", "Shield Sunglasses"], "description": "Built for mountainsides and summits, The Shield Sunglasses block harsh UV and look good doing it. The wide, deep lenses and removeable side shields block reflections and light coming in from odd angles. Julbo is known for their high-altitude optics, once you try them you'll see the reputation is earned.Zebra 2-4 lenses are photochromic getting darker or lighter with the changing conditions, shifting from category 2 to category 4.Light, yet strong Spectron 3CF polycarbonate lenses.NXT Zebra 2-4 lenses offer unrivalled clarity and an excellent strength to weight ratio.Alti Arc lenses use mineral glass for superior clarity and an excellent strength to weight ratio.Anti-reflective coating on Alti Arc lenses block infrared and remove stray reflections and glare.Category 4 lenses transmit only 3-8% of visible light. Great for glaciers, but too dark for driving or everyday wear.Flash lens coatings increase contrast.Removeable, soft-touch fabric side shields provide an extra line of defence against harsh reflected light.Rubberized temples and nose bridge pads help keep the glasses where you want them.Contoured temples offer a snug, yet comfortable fit.Included retention cord adds a bit of protection for your glasses.", "product_code": "5064-542", "tech_specs": {"Ideal for": ["Alpine climbing and mountaineering", "Snow and ice climbing", "Alpine touring"], "Frame material\n\nTR90 thermoplastic offers good resistance to chemicals and torsion. Propionate is a light, nylon-based, hypoallergenic plastic that's very strong and offers more transparency and gloss than other plastics.": ["Nylon"], "Lens material": ["Mineral glass"], "Lens performance\n\nFixed tints provide a constant degree of darkness. Photochromic lenses adjust to changing light levels. Polarized lenses absorb horizontal reflected glare to improve clarity around surfaces like snow or water.": ["Fixed tint"], "Visible Light Transmission\n\n0-10% – very heavy tint, too dark for most needs. \n10-30% – heavy tint for bright sunny days.\n20-60% – light tint, great for cloudy, overcast conditions and shady trails. \n60-80% – very light tint (often coloured), for improving contrast in low-light conditions, think dawn or dusk. \n80-100% – little to no tint, this what you want in the dark.": ["7%"], "Lens width\n\nRefers to the horizontal width in millimeters of one of the frame's lenses.": ["59mm"], "Nose bridge width\n\nThe gap between the lenses, measured at the smallest point.": ["17mm"], "Temple length\n\nThe length of an arm from tip to tip.": ["130mm"], "Lens height\n\nMeasures the height of the lens within the frame, excluding the lens curve.": ["45mm"], "Fits over most eyewear\n\nThese optics are designed to fit comfortably over most eyewear.": ["No"], "100% UVA protected": ["Yes"], "Interchangeable lenses\n\nInterchangeable lenses let you change lenses to suit differing light conditions or activities.": ["No"], "100% UVB protected": ["Yes"], "Made in": ["France"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9002770464798/5064542-BRD07.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9003147329566/5064542-BRD07-ALT-SIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9003147657246/5064542-BRD07-ALT-FRONT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9002770464798/5064542-BRD07.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9003147329566/5064542-BRD07-ALT-SIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9003147657246/5064542-BRD07-ALT-FRONT.jpg"]}