{"name": "Pearl Izumi Elite Escape Convertible Jacket - Women's", "categories": ["Home", "All", "Cycling", "Cycling clothing", "Cycling tops", "Cycling jackets", "Elite Escape Convertible Jacket"], "description": "This feature-packed cycling jacket provides protection from the elements and converts to a vest when the weather improves. The Elite Escape Convertible Jacket stuffs into its own pocket for storage in your jersey, and comes with an integrated strap that lets you secure it to your frame if you prefer. A mesh panel provides some venting on those high-output rides, and a grippy silicone band at the waist keeps the jacket in place when you jump out of the saddle. Zippered front pockets give you a place to put your hands when you're off the bike, and a large zippered back pocket carries your essentials.Barrier fabric is windproof and water-resistant.Mesh panel on back provides ventilation.2-way zipper is backed with a storm flap.Sleeves zip off to convert the jacket to a vest.Large zippered back pocket and 2 zippered front pockets offer secure storage.Elastic hem and cuffs seal out drafts.Silicone gripper at waist keeps jacket from riding up.Cut close to the body to minimize flapping, with enough room for a jersey underneath.Reflective details.", "product_code": "5064-440", "tech_specs": {"Weight": ["202g (Medium)"], "Ideal for": ["Cycle touring", "Road cycling"], "Type": ["Wind shell"], "Waterproofness\n\nWaterproof garments use waterproof-breathable technologies and are fully seam-taped. Water-resistant garments use waterproof-breathable technologies but their seams are not taped. Water-resistant garments repel water and protect against wind but are not made of waterproof fabric.": ["Water-resistant"], "Pockets": ["1 back zippered", "2 front zippered"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["Windproof"], "Length": ["Hip-length"], "Durable water repellency\n\nUsually referred to as DWR. A treatment made to fabrics that causes water to bead and run off instead of soaking through.": ["Yes"], "Additional feature(s)": ["Reflective details", "Removable sleeves", "Stuffs in own pocket", "2-way zipper", "Wind flap behind zipper"], "Made in": ["Vietnam"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9004314165278/5064440-TEL00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9004312264734/5064440-TEL00-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9004314165278/5064440-TEL00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9004312264734/5064440-TEL00-ALT-BACK.jpg"]}