{"name": "The North Face Resolve Reflective Jacket - Girls' - Youths", "categories": ["Home", "All", "Kids", "Youth (8-16 yrs)", "Youth clothing", "Youth jackets", "Youth rain jackets", "Resolve Reflective Jacket"], "description": "Umbrellas a great for staying dry in the rain, but not really practical for kids that are always on the move. The Resolve Reflective rain jacket provides on-the-go, umbrella-like protection for kids that don’t slow down. The 2-layer waterproof breathable fabric and fully taped seams keep your little one dry even on the wettest days.2-layer waterproof breathable with DryVent™ technology and fully taped seams will keep you little one dry.Smooth nylon lining in the sleeves and hood slides easily over layers.Polyester mesh lining in the body helps with airflow.Zippered hand pockets protect small hands and keep tiny treasures safe.Front zipper has a storm flap that secures with Velcro®, keeping the warm in and the wet out.Reflective logo on the front and back help keep the smaller set seen when the light gets low.Internal ID label takes some of the confusion out of school pick-ups.Elasticised cuffs seal out the bad weather.", "product_code": "6000-406", "tech_specs": {"Ideal for": ["Casual wear", "Camping and hiking"], "Type": ["Waterproof-breathable"], "Fabric weight\n\nMeasured in grams per square metre (gsm). The larger the number, the heavier and thicker the garment.": ["117gsm"], "Technology": ["DryVent"], "Construction": ["2-layer"], "Face fabric": ["75-denier polyester"], "Lining/backer": ["Nylon", "Polyester"], "Waterproofness\n\nWaterproof garments use waterproof-breathable technologies and are fully seam-taped. Water-resistant garments use waterproof-breathable technologies but their seams are not taped. Water-resistant garments repel water and protect against wind but are not made of waterproof fabric.": ["Waterproof with fully taped seams"], "Pockets": ["2 front zippered"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["Windproof"], "Durable water repellency\n\nUsually referred to as DWR. A treatment made to fabrics that causes water to bead and run off instead of soaking through.": ["Yes"], "Hood": ["Low-profile"], "Additional feature(s)": ["Reflective details"], "Made in": ["Bangladesh"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9197191331870/6000406-AMB00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196121489438/6000406-AMB00-ALT-A.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196121522206/6000406-AMB00-ALT-B.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196121620510/6000406-AMB00-ALT-C.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9197191331870/6000406-AMB00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196121489438/6000406-AMB00-ALT-A.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196121522206/6000406-AMB00-ALT-B.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9196121620510/6000406-AMB00-ALT-C.jpg"]}