{"name": "Saucony Ride ISO 2 Road Running Shoes - Men's", "categories": ["Home", "All", "Run and fitness", "Running and training footwear", "Running shoes", "Road running shoes", "Ride ISO 2 Road Running Shoes"], "description": "A responsive trainer with great energy return. With few seams in the upper and a moisture-wicking lining, the Ride ISO 2 feels light and sleek. The midsole foam has impact-dampening properties to help you cruise smoothly through hill workouts and tempo runs.Engineered mesh upper has few seams for more comfort.ISOFIT floating support cage adapts to the shape and motion of the your foot.Everun continuous topsole cushioning distributes impact over a larger area than EVA foams, giving you reliable cushioning and resiliency.Rebound cushioning covers the heel landing zone for durable shock absorption.Tri-Flex sole combines iBR+ lightweight blown rubber and XT-900 carbon rubber for traction and durability, as well as smooth, solid ground contact.Reflective details.", "product_code": "6002-367", "tech_specs": {"Weight": ["556g (9)"], "Ideal for": ["Road running"], "Feel\n\n'Minimal and natural' shoes offer low drop, lots of flex, and minimal cushioning. Most running shoes are 'Light and responsive' with medium cushioning and good energy return. 'Cushioned and floaty' shoes have maximum cushioning.": ["Light and responsive"], "Stability\n\nSome shoes include added motion control or stability features to help minimize over pronation, where the foot tends to roll inward in a biomechanically imbalanced running position.": ["Neutral"], "Upper material": ["Synthetic"], "Closure": ["Lace-up"], "Heel-to-toe cushioning\n\nThe approximate thickness of the midsole cushioning under the heel and the forefoot. A thicker heel and greater difference between heel and toe height tends to suit heel-strike runners, while forefoot and midfoot strikers may prefer a minimal drop between heel and toe cushioning.": ["27-19mm"], "Drop\n\nThe drop is the difference in height between the heel and the forefoot midsole cushioning. Traditional running shoes tend to have a 10mm drop or higher while minimalist style shoes are on the lower end of the spectrum.": ["8mm"], "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": ["No"], "Removable insole": ["Yes"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9032443101214/6002367-GRY08.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9032948842526/6002367-GRY08-ALT-MEDIAL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9032949628958/6002367-GRY08-ALT-TOP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9032443101214/6002367-GRY08.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9032948842526/6002367-GRY08-ALT-MEDIAL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9032949628958/6002367-GRY08-ALT-TOP.jpg"]}