{"name": "Showers Pass Refuge Waterproof Pants - Men's", "categories": ["Home", "All", "Clothing", "Bottoms", "Pants", "Rain pants", "Refuge Waterproof Pants"], "description": "Showers Pass designed these waterproof breathable pants for the most demanding cycle tourers and commuters. Reflective from all angles, with high quality zippers, thigh vents and a reinforced seat that will stand up to countless long days in the saddle, they'll be your shelter on stormy city streets and windswept passes alike.Made with Showers Pass' highest-performing 3-layer waterproof breathable construction.Fully seam taped for reliable waterproofness.Partial elastic waist with zip fly and snap button closure.Suspender compatible.Durable reinforced seat stands up to long days in the saddle, and is perforated for enhanced breathability.High quality YKK Aquaguard Vislon water-resistant zippers used throughout.Thigh vents prevent overheating.Thigh pocket is accessible while riding.Articulated knees for riding comfort.Ankle zips for easy on and off over shoes.Integrated cinch straps keep pants legs away from chain.Extensive reflective detailing for excellent visibility.As of 2020 Showers Pass is Climate Neutral certified, meaning they fully offset their carbon emissions. Climate Neutral certified is a consumer label that's carried by brands who take responsibility for greenhouse gas emissions generated in production, operation and shipping of  their goods and services.", "product_code": "6003-646", "tech_specs": {"Ideal for": ["Cycle commuting", "Cycle touring"], "Type": ["Waterproof-breathable"], "Construction": ["3-layer"], "Waterproofness\n\nWaterproof garments use waterproof-breathable technologies and are fully seam-taped. Water-resistant garments use waterproof-breathable technologies but their seams are not taped. Water-resistant garments repel water and protect against wind but are not made of waterproof fabric.": ["Waterproof with fully taped seams"], "Pockets": ["1 thigh"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["Windproof"], "Venting": ["Thigh vents"], "Additional feature(s)": ["Reflective details", "Ankle zips"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9128836726814/6003646-GRA00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9128830140446/6003646-GRA00-ALT-FLAT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9128836825118/6003646-GRA00-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9128836726814/6003646-GRA00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9128830140446/6003646-GRA00-ALT-FLAT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9128836825118/6003646-GRA00-ALT-BACK.jpg"]}