{"name": "Brooks Adrenaline GTS 20 Road Running Shoes - Men's", "categories": ["Home", "All", "Run and fitness", "Running and training footwear", "Running shoes", "Road running shoes", "Adrenaline GTS 20 Road Running Shoes"], "description": "Soft enough for high-mileage training, yet firm enough for moderate stability. Now matter how or where you run, the gel-like midsoles respond to your running needs. The springy midsole foam stays flexible under low impacts, but stiffens under higher impacts to provide support.Microfibre uppers include 3D Fit Print overlays to form integral foot support structures.Engineered mesh and linings provide moisture management.Internal support saddles offer a precise, secure fit.Full-length sockliners provide durable cushioning layers.DNA LOFT and BioMoGo foam disperse impact and provide better rebound and durability than conventional EVA.GuideRails motion-control system creates a smoother transition and limits joint impact.Segmented full-length Crash Pads cushion and stabilize each step for smooth transitions.HPR Plus outsoles offer long-wearing durability.Deep multi-directional V-grooves promote toe-off transitions for a longer, smoother stride.", "product_code": "6003-408", "tech_specs": {"Ideal for": ["Road running"], "Feel\n\n'Minimal and natural' shoes offer low drop, lots of flex, and minimal cushioning. Most running shoes are 'Light and responsive' with medium cushioning and good energy return. 'Cushioned and floaty' shoes have maximum cushioning.": ["Light and responsive"], "Stability\n\nSome shoes include added motion control or stability features to help minimize over pronation, where the foot tends to roll inward in a biomechanically imbalanced running position.": ["Moderate stability"], "Upper material": ["Synthetic"], "Closure": ["Lace-up"], "Heel-to-toe cushioning\n\nThe approximate thickness of the midsole cushioning under the heel and the forefoot. A thicker heel and greater difference between heel and toe height tends to suit heel-strike runners, while forefoot and midfoot strikers may prefer a minimal drop between heel and toe cushioning.": ["30-18mm"], "Drop\n\nThe drop is the difference in height between the heel and the forefoot midsole cushioning. Traditional running shoes tend to have a 10mm drop or higher while minimalist style shoes are on the lower end of the spectrum.": ["12mm"], "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": ["No"], "Removable insole": ["Yes"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9057764966430/6003408-BEK00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9057770962974/6003408-BEK00-ALT-SIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9057770995742/6003408-BEK00-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9057771159582/6003408-BEK00-ALT-TOP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9057764966430/6003408-BEK00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9057770962974/6003408-BEK00-ALT-SIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9057770995742/6003408-BEK00-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9057771159582/6003408-BEK00-ALT-TOP.jpg"]}