{"name": "Showers Pass Refuge Jacket - Men's", "categories": ["Home", "All", "Cycling", "Cycling clothing", "Cycling tops", "Cycling jackets", "Refuge Jacket"], "description": "Showers Pass designed this waterproof-breathable jacket for the most demanding cycle tourers and commuters. Reflective from all angles, with high quality zippers, extra-long vents and hidden drop tail that protects against road spray, the Refuge will keep you dry on stormy city streets and windswept passes alike.Durable 3-layer waterproof breathable construction, with sealed seams.Adjustable hood fits over a helmet and can be removed and stashed in inside pocket.Loop on back for a blinker light.Brushed facing on chinguard wicks moisture and is soft against your skin.Full front zip is backed by a storm flap.Extra long vents let you thermoregulate.Zippered inner chest pocket with audio port.Handwarmer pockets feature water resistant zips for secure storage.Hoop and loop cuff closures.Adjustable drop hem provides extended coverage in the riding position, and can be cinched to keep out drafts.Magnetic drop-down tail protects from road spray and wet stadium seats.Extensive reflective detailing enhances visibility from all angles.As of 2020 Showers Pass is Climate Neutral certified, meaning they fully offset their carbon emissions. Climate Neutral certified is a consumer label that's carried by brands who take responsibility for greenhouse gas emissions generated in production, operation and shipping of  their goods and services.", "product_code": "6003-645", "tech_specs": {"Weight": ["538g (Golden Rod Medium)"], "Ideal for": ["Cycle commuting", "Cycle touring"], "Type": ["Waterproof-breathable"], "Technology": ["Elite"], "Construction": ["3-layer"], "Waterproofness\n\nWaterproof garments use waterproof-breathable technologies and are fully seam-taped. Water-resistant garments use waterproof-breathable technologies but their seams are not taped. Water-resistant garments repel water and protect against wind but are not made of waterproof fabric.": ["Waterproof with fully taped seams"], "Pockets": ["2 handwarmer", "1 internal zippered with cord port"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["Windproof"], "Length": ["Hip-length"], "Hood": ["Helmet-compatible", "Adjustable", "Stowable", "Removable"], "Durable water repellency\n\nUsually referred to as DWR. A treatment made to fabrics that causes water to bead and run off instead of soaking through.": ["Yes"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9052296708126/6003645-GOO00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9100673024030/6003645-GOO00-ALT-FRONTMODEL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9167545434142/6003645-ALP10.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9052296708126/6003645-GOO00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9100673024030/6003645-GOO00-ALT-FRONTMODEL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9167545434142/6003645-ALP10.jpg"]}