{"name": "Happy Yak Mandarin Beef and Rice", "categories": ["Home", "All", "Camping and hiking", "Camping kitchen and hydration", "Food and drink", "Camping meals", "Mandarin Beef and Rice"], "description": "The bright sweetness of orange finishes every bite of this satisfying meal. Loaded with pieces of tender beef, vegetables and toasted, slivered almonds, one bite of Happy Yak’s Mandarin Beef and Rice and you will understand why this is one their signature dishes.Ingredients: rice, freeze-dried beef (beef, onion, spices), orange sauce [glucose solids, hydrolysed corn protein, potato starch, sugar, corn starch, tapioca starch, caramel (sulphites), yeast extract, brown sugar, onion powder, garlic powder, salt, tomato powder, spices, citric acid, dried orange zest, sodium citrate, artificial flavour, Arabic gum, colour], dried mandarin oranges, toasted slivered almonds, freeze-dried vegetables (green bean, corn, red bell pepper, pea, broccoli, carrot, water chestnut, mushroom), dried onion flakes.May contain: peanuts, sesame, egg, milk, fish, sea food, soy, wheat and mustard.", "product_code": "6004-909", "tech_specs": {"Weight": ["170g"], "Ideal for": ["Backpacking", "Winter and expedition camping", "Emergency preparedness"], "Serving size": ["1 package"], "Servings": ["1"], "Calories per serving": ["680Cal"], "Carbohydrates": ["108g"], "Sugar": ["18g"], "Sodium": ["620mg"], "Protein": ["34g"], "Dietary fibre": ["3g"], "Total fat": ["12g"], "Cholesterol": ["60mg"], "Saturated fat": ["3g"], "Cook in package\n\nThe food can be cooked simply by adding hot water into the sealable package.": ["No"], "Gluten free\n\nMade with gluten-free ingredients, but not necessarily in a guaranteed gluten-free environment.": ["No"], "Dairy free": ["No"], "Vegetarian\n\nDoes not contain animal products but may contain dairy or egg products.": ["No"], "Nut free\n\nThis product is nut free and is produced in a nut free environment.": ["No"], "Soy free": ["No"], "Vegan\n\nThis product does not contain animal products or by-products.": ["No"], "Made in": ["Canada"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9042319212574/6004909-NOC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035443994654/6004909-NOC02-ALT-PREPARED.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9042319212574/6004909-NOC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035443994654/6004909-NOC02-ALT-PREPARED.jpg"]}