{"name": "Momentum Smokejumper 44 Watch", "categories": ["Home", "All", "Camping and hiking", "Electronics", "Watches", "Sport watches", "Analogue sport watches", "Smokejumper 44 Watch"], "description": "With a nod to vintage field watches, this special edition of the popular Atlas watch is light, tough and ready for adventure. Machined from solid titanium the Smokejumper’s 44mm case deceptively lightweight and feels great on the wrist.Light and strong solid titanium case treated with a matte black PVD (physical vapor deposition) super-strong finish.Handsome domed sapphire crystal is virtually scratch proof.Day and date display.12 and 24-hour Arabic numerals.Superluminous indices and hands are easy to read in low light.Rubber wrist band performs well in all environments.Screw-down crown helps seal your watch from the elements.5-year battery life.", "product_code": "6005-096", "tech_specs": {"Ideal for": ["Everyday use"], "Date display": ["Yes"], "Face material\n\nPolycarbonate is inexpensive and light, with good clarity and wear-resistance. Mineral crystal glass offers greater clarity and significantly greater wear-resistance. Sapphire crystal is better still for clarity and wear-resistance.": ["Sapphire crystal"], "Wrist strap material": ["Rubber"], "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": ["IP X8"], "Daily alarms": ["0"], "Sunrise/set time": ["No"], "Countdown timer": ["No"], "Stopwatch": ["No"], "Water-resistant": ["100m"], "12/24 hour format": ["Yes"], "Lug width": ["22mm"], "Case diameter": ["44mm"], "Replaceable wrist strap": ["Yes"], "Illumination": ["Luminous hands"], "Made in": ["Canada"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9056008011806/6005096-BK000.jpg"]}