{"name": "Gregory Amber 65 Backpack - Women's", "categories": ["Home", "All", "Camping and hiking", "Packs", "Backpacking packs", "Multi-day packs (55 - 75l)", "Amber 65 Backpack"], "description": "Sometimes the journey and the destination both count. This extra roomy trekking pack is designed for wilderness seeking souls who aren't in a hurry to get back to city life. Adjustable and breathable, the carrying system is engineered for females. Its spacious internal compartments can handle your base camp essentials (and even a few luxuries) for longer backcountry forays. Trail-access side pockets let you access snacks without taking your pack off. When the mountains brew up a storm, the integrated rain cover lets you shield your supplies from precipitation.VersaFit suspension is light, adjustable and breathable in a female-specific fit.Adjustable shoulder harness lets you customize the pack to your torso length.Sternum strap slides up or down with an integrated whistle in the buckle.Access from top and bottom makes packing and unpacking quick and easy.Floating lid and spindrift collar accommodates different size loads.Stretch mesh expanding shove-it pocket fits a shell jacket and secures with single buckle.Each side has a trail access stretch pocket and 2 compression straps.2 zippered hipbelt pockets keep small personal items handy.Bottom compression straps reduce volume or hold extra gear.Shock cord and tool loops let you attached poles or tools.Integrated rain cover is removable and stows in a zippered pocket.Interior Nano connect toggles let you attach a Nano 14 daypack (sold separately).Maximum recommended load: 23kg.", "product_code": "6005-810", "tech_specs": {"Weight": ["1.56kg"], "Ideal for": ["Backpacking", "Travel"], "Main fabric": ["210-denier ripstop polyester"], "Secondary fabric": ["600-denier polyester"], "Access\n\nThe location of all access points into the main compartment of the pack.": ["Top", "Bottom"], "Hipbelt": ["Padded"], "Lid type\n\nSome pack lids can be adjusted to compensate for overloaded packs, or even removed, and some removeable lids have tuck-away hipbelts that allow youto use them as a waistpack.": ["Adjustable"], "Volume": ["65L"], "Length": ["76cm"], "Width": ["33cm"], "Depth": ["31cm"], "Hipbelt circumference": ["56-122cm"], "Ventilated back panel": ["Yes"], "Adjustable shoulder harness\n\nAn adjustable harness lets you change the height of the shoulder straps to fit your specific back length.": ["Yes"], "Dynamic suspension\n\nThe hipbelt and/or shoulder straps of the pack are designed to move, pivot or flex to follow your body’s movements.  Each brand uses their own technology.": ["No"], "Carry-on sized\n\nSize restrictions vary among airlines. Just to be sure, check with your carrier for their specific restrictions.": ["No"], "Additional feature(s)": ["Compression straps", "Rain cover included", "Hipbelt pocket(s)", "Hydration compatible (reservoir sold separately)", "Ice axe/pole attachment", "Expandable collar", "Sleeping bag compartment"], "Made in": ["Vietnam"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9073747623966/6005810-ARC99.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9073760141342/6005810-NOCLR-ALT-ONMODEL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9073760108574/6005810-ARC99-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9073747623966/6005810-ARC99.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9073760141342/6005810-NOCLR-ALT-ONMODEL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9073760108574/6005810-ARC99-ALT-BACK.jpg"]}