{"name": "Arc'teryx Zeta SL Gore-Tex Pants - Men's", "categories": ["Home", "All", "Clothing", "Bottoms", "Pants", "Rain pants", "Zeta SL Gore-Tex Pants"], "description": "Keep your legs dry in stormy weather. These light waterproof pants are a worthy addition to your backcountry wardrobe. Hike through the storm in the alpine, perfect your J-stroke in a canoe, or walk through a rain-soaked meadow. They pack down nicely into your backpack and  keep you comfortable no matter what adventure you're on.40 denier nylon ripstop face fabric is light and packable, but strong.GORE-TEX® Paclite Plus technology ensures you stay dry and out of the wind.3/4 length polyurethane coated YKK® RC zippers open from thigh to ankle.Articulated fit through the knees improves comfort when you're moving.Waist closes with a zippered fly, snap closure and adjustable webbing.Reinforced insteps increase durability at the cuffs.Trim fit.", "product_code": "6005-749", "tech_specs": {"Weight": ["245g (Medium)"], "Ideal for": ["Camping and hiking", "Canoeing"], "Type": ["Waterproof-breathable"], "Technology": ["GORE-TEX Paclite Plus"], "Construction": ["2.5-layer"], "Face fabric": ["40-denier ripstop nylon"], "Waterproofness\n\nWaterproof garments use waterproof-breathable technologies and are fully seam-taped. Water-resistant garments use waterproof-breathable technologies but their seams are not taped. Water-resistant garments repel water and protect against wind but are not made of waterproof fabric.": ["Waterproof with fully taped seams"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["Windproof"], "Venting": ["¾-length waterproof leg zips"], "Durable water repellency\n\nUsually referred to as DWR. A treatment made to fabrics that causes water to bead and run off instead of soaking through.": ["Yes"], "Additional feature(s)": ["Waterproof"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9079662575646/6005749-BK000.jpg"]}