{"name": "Saucony Peregrine 10 Invisible Fit Gore-Tex Trail Running Shoes - Men's", "categories": ["Home", "All", "Run and fitness", "Running and training footwear", "Running shoes", "Trail running shoes", "Peregrine 10 Invisible Fit Gore-Tex Trail Run"], "description": "Explore off-road with confidence. The Peregrine 10 has a GORE-TEX® upper for reliable waterproof breathable performance. Its improved midsole delivers a super soft ride, while locking your foot in place. The rugged sole gives you the traction you need to tackle aggressive trails or muddy conditions.Waterproof-breathable GORE-TEX® upper.FORMFIT uppers are lightweight and lock your feet in place.PWRRUN midsole offers continuous cushioning with great energy return.Rockplate protects your feet from rough section in the trail.PWRTRAC outsole is durable and ultra grippy across all types of terrain.", "product_code": "6005-769", "tech_specs": {"Ideal for": ["Trail running"], "Feel\n\n'Minimal and natural' shoes offer low drop, lots of flex, and minimal cushioning. Most running shoes are 'Light and responsive' with medium cushioning and good energy return. 'Cushioned and floaty' shoes have maximum cushioning.": ["Light and responsive"], "Stability\n\nSome shoes include added motion control or stability features to help minimize over pronation, where the foot tends to roll inward in a biomechanically imbalanced running position.": ["Neutral"], "Upper material": ["Synthetic", "TPU"], "Closure": ["Lace-up"], "Heel-to-toe cushioning\n\nThe approximate thickness of the midsole cushioning under the heel and the forefoot. A thicker heel and greater difference between heel and toe height tends to suit heel-strike runners, while forefoot and midfoot strikers may prefer a minimal drop between heel and toe cushioning.": ["27-23mm"], "Drop\n\nThe drop is the difference in height between the heel and the forefoot midsole cushioning. Traditional running shoes tend to have a 10mm drop or higher while minimalist style shoes are on the lower end of the spectrum.": ["4mm"], "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": ["Yes"], "Removable insole": ["Yes"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9081695109150/6005769-GRY07.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9081687474206/6005769-GRY07-ALT-MEDIAL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9081687506974/6005769-GRY07-ALT-PAIR.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9081687539742/6005769-GRY07-ALT-SOLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9081687703582/6005769-GRY07-ALT-TOP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9081695109150/6005769-GRY07.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9081687474206/6005769-GRY07-ALT-MEDIAL.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9081687506974/6005769-GRY07-ALT-PAIR.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9081687539742/6005769-GRY07-ALT-SOLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9081687703582/6005769-GRY07-ALT-TOP.jpg"]}