{"name": "Garmin Forerunner 945 Smartwatch", "categories": ["Home", "All", "Camping and hiking", "Electronics", "Watches", "Altimeter barometer watches", "Forerunner 945 Smartwatch"], "description": "For race days, training days and all the days between. Garmin’s newest Forerunner combines smartwatch functionality with advanced training tools. In a Forerunner first, the 945 looks at more than how you train but also where you train. Environmental details like elevation and temperature are now factored into your performance data. Speed, distance, pace and more come care of a new, more efficient GPS, along with other internal sensors. Using the latest generation Elevate heart rate monitor lets the 945 read your pulse straight off your wrist, no need for a chest strap. When you need more information, or even a little motivation, you can download training plans through the free Garmin Connect app. When paired with a smartphone running Garmin Connect your 945 goes from a training tool, to an everyday tool. Garmin Connect lets you review activities, receive texts, social media alerts, emails, etc., keep an eye on the weather and more. The 945 can even give your training a soundtrack, with the ability to connect to multiple music services and storage for up to 1000 songs. With tunes and podcasts on your wrist, you can cut weight by leaving your phone at home. Loaded with detailed internal maps, the 945 can help you get where you need to go. And, for those times you know how far you want to go, but don't have a course in mind, the 945 can help. Enter your desired distance and the 945 will use its maps and tracks from other Garmin users to calculate multiple course options that start and stop right were you are.Built-in modes for biking, running, swimming (indoor and outdoor), multisport – transition between activities within a single workout at the press of a button, gym focused activities (strength training – with rep counter, cardio and elliptical training, stair stepping, indoor rowing and yoga) and more.Includes North American map data with room to add more maps.Point of interest navigation lets you search for places you may want to go, e.g restaurants, attractions, accommodation, etc.Round-trip mapping: choose your distance and the 945 plots course options that start and stop in the same spot.Trendline™ routing uses Garmin Connect’s database of routes and finds the most popular way to get you where you are going.Stream music through a paired smartphone using Spotify, iHeartRadio, Pandora or Deezer. Or, download playlists and podcasts via your favourite music service, e.g. Spotify (premium account required), you can even drag and drop MP3s from your computer – holds up to 1,000 songs (depending on sound quality).Playlists synced from streaming services can be updated when in range of Wi-Fi.Power alerts and lap data can come through to your paired Bluetooth™ headphones.ClimbPro™ mode breaks down the climbs in your activity, letting you know the grade, the total ascent, how much more you have to go and displays an elevation profile, so you know how to pace yourself.Garmin Pay™ contact-less payment; by linking credit cards to your Garmin account, you can make payments with your watch (if supported by your bank).Strava Segment integration – both preloaded and on-the-fly (through your phone) – lets you know when your starred segment is about to begin and shows instantaneous data, how it compares to your PR and the current KOM or QOM, and then provides results once the segment is complete (requires Strava premium).Connects to 3 different satellite constellations (GPS, GLONASS and Galileo) and caches satellite positions, giving you a fast connection and a strong GPS signal anywhere.Internet Live Tracking during activities (through a connected smartphone) allows you to share your location and fitness data.GroupTrack™ displays the location and telemetry of up to 50 others using compatible Garmin devices.Pre-set messaging between compatible Garmin units, when combined with Live Tracking, means real-time location and messaging.UltraTrac™ mode reduces the GPS recording rate in order to conserve battery, providing up to 60 hours of GPS use.Equipped with Garmin’s V3 low-profile Elevate™ optical heart rate monitor which provides more reliable constant heart rate data. Elevate V3 includes a red LED to provide Pulse Ox measurements.Physiological metrics includes VO2 max – which now takes ambient temperature and altitude into consideration, a race predictor, recovery advisor and performance indicator.Training load uses data from your past 7-days of workouts to let you know if you are overtraining, under-training, or on the right path.Compatible with running dynamics sensors (sold separately) for cadence, ground contact time, stride length, vertical oscillation and vertical ratio.Incident detection uses the internal sensors to detect if an accident has occurred.  In the case of an accident the unit will send a signal through your paired smartphone to your emergency contacts, letting them know where you are and that you need help.24/7 activity tracking, learning your activity level and guiding you towards a more active lifestyle.On board sleep tracking mode monitors your rest, letting you see your total sleep hours as well as periods of movement and restful sleep in Connect.Free Garmin Connect app lets you review activities, receive texts, social media alerts, emails, etc., download training plans, keep an eye on the weather and more, all via Bluetooth connection to your phone.Connect IQ support allows you to download apps, templates, data fields, watch faces, and other features.Internal memory stores up to 200 hours of activities. Garmin Connect stores all of your activity data.Rechargeable lithium-ion battery lasts up to 36 hours in GPS mode or 10 hours in GPS and music mode, 60 hours in UltraTrac mode and up to 7 days in smartwatch mode.In the box: Forerunner 945, charging cable and documentation.", "product_code": "6005-209", "tech_specs": {"Weight": ["50g"], "Ideal for": ["Triathlon", "Running", "Road cycling", "Casual wear"], "Face material\n\nPolycarbonate is inexpensive and light, with good clarity and wear-resistance. Mineral crystal glass offers greater clarity and significantly greater wear-resistance. Sapphire crystal is better still for clarity and wear-resistance.": ["Mineral crystal glass"], "Wrist strap material": ["Silicone"], "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": ["IP X8"], "Built-in memory": ["14.5GB"], "Dimensions": ["4.7 x 4.7 x 1.4cm"], "Snooze": ["No"], "Countdown timer": ["Yes"], "Stopwatch": ["Yes"], "Electronic compass\n\nAn electronic compass allows the user to view their heading in situations where they are either standing still or moving too slowly for the GPS to detect.": ["Yes"], "12/24 hour format": ["Yes"], "Interface": ["USB", "Wireless"], "Lug width": ["22mm"], "Low battery warning": ["Yes"], "Calorie consumption\n\nCalculated based on data from a heart rate monitor.": ["Yes"], "App compatibility\n\nAn online community where members upload, analyze and share activity data.": ["Garmin Connect", "Third party apps"], "Add maps capability\n\nThese units allow you to add maps, so you can mark and name waypoints and create routes on your PC, and then upload the map of your choice to your GPS.": ["Yes"], "Programmable workouts\n\nWant an easy jog? A fast-paced ride? A workout with lots of variety to keep you on your toes? With programmable workouts you can tailor your training to match whatever you are looking for on a particular day.": ["Advanced"], "New lap auto start\n\nAutomatically triggers a new lap after reaching a specified difference.": ["Yes"], "Heart rate monitor": ["Yes"], "Distance/time alarm": ["Yes"], "Interval training": ["Yes"], "Bluetooth": ["Yes"], "Auto pause\n\nAutomatically pauses timer when you stop or go below a specified pace.": ["Yes"], "Heart rate in real time\n\nDisplays beats per minute during activity.": ["Yes"], "Calories in real time\n\nDisplays calorie expenditure during activity, based on heart rate monitor data.": ["Yes"], "Speed/cadence sensor\n\nMonitors pedalling cadence and measures pedalling strokes per minute.": ["Sold separately"], "Battery life": ["10-336 h"], "Chest strap": ["Sold separately"], "Custom POI\n\nA POI (point of interest) is a specific location that someone may find interesting (i.e., favourite viewpoint, best coffee stop before the trailhead). The custom POI feature allows the user to load only the POI's that interest them onto their GPS unit.": ["Yes"], "Metric/imperial units format": ["Yes"], "Power meter\n\nDisplays output in watts as you ride.": ["Sold separately"], "Unit to unit transfer\n\nShares data wirelessly between compatible units.": ["Yes"], "Basemap\n\nA basic set of map data that is included with the GPS. Basemap detail may vary from unit to unit.": ["Yes"], "Area calculation": ["No"], "Tide tables": ["No"], "Battery power indicator": ["Yes"], "Data card": ["Not accepted"], "Foot pod\n\nAttaches to your shoe, captures your running data (i.e., pace, distance), and transmits it to your heart rate monitor or GPS.": ["Sold separately"], "Touch screen": ["No"], "Heart rate target zones\n\nDisplays heart rate zones during activity.": ["Yes"], "Barometric altimeter\n\nBarometer function helps forecast weather trends. An altimeter can provide one line of position for location on a topo map, useful if the GPS isn't working.": ["Yes"], "Coded signal\n\nA coded instrument ensures no interference between your chest strap and your watch, necessary if you are training in busy gyms or trails where other signals may be encountered.": ["Yes"], "Workout history": ["Yes"], "Wireless sync": ["Yes"], "WiFi": ["Yes"], "Button lock": ["Yes"], "Batteries": ["Lithium-ion (included)"], "Haptic feedback": ["Yes"], "Case diameter": ["47mm"], "Virtual partner\n\nAllows user to monitor training goals with either a virtual partner or alarms.": ["Yes"], "Pause timer\n\nPauses the timer when slowing or stopping, and automatically resumes when moving again.": ["Yes"], "Replaceable wrist strap": ["Yes"], "Pace alarm\n\nAn alarm that notifies you if you vary from a pre-set pace.": ["Yes"], "ANT+ compatible\n\nEnsures seamless digital wireless communication between ANT+ devices. For example, data from an ultra-low power wireless sensor can be displayed on a bike computer or smartphone, then downloaded to a PC, etc.": ["Yes"], "Made in": ["Taiwan"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035839701022/6005209-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035847467038/6005209-BK000-ALT-ACTIVITIES.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035847532574/6005209-BK000-ALT-LEFT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035847991326/6005209-BK000-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035848056862/6005209-BK000-ALT-LIFESTYLE3.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035848155166/6005209-BK000-ALT-PAYTAP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035848253470/6005209-BK000-ALT-LIFESTYLE2.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035848286238/6005209-BK000-ALT-LIFESTYLE1.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035848581150/6005209-BK000-ALT-RIGHT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035848712222/6005209-BK000-ALT-TRAINING4.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035849007134/6005209-BK000-ALT-TRAINING3.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035849039902/6005209-BK000-ALT-TRAINING.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035849072670/6005209-BK000-ALT-TIME.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035849334814/6005209-BK000-ALT-TRAINING2.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035839701022/6005209-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035847467038/6005209-BK000-ALT-ACTIVITIES.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035847532574/6005209-BK000-ALT-LEFT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035847991326/6005209-BK000-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035848056862/6005209-BK000-ALT-LIFESTYLE3.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035848155166/6005209-BK000-ALT-PAYTAP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035848253470/6005209-BK000-ALT-LIFESTYLE2.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035848286238/6005209-BK000-ALT-LIFESTYLE1.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035848581150/6005209-BK000-ALT-RIGHT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035848712222/6005209-BK000-ALT-TRAINING4.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035849007134/6005209-BK000-ALT-TRAINING3.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035849039902/6005209-BK000-ALT-TRAINING.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035849072670/6005209-BK000-ALT-TIME.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035849334814/6005209-BK000-ALT-TRAINING2.jpg"]}