{"name": "Garmin Forerunner 45", "categories": ["Home", "All", "Camping and hiking", "Electronics", "GPS Navigation", "GPS watches", "Forerunner 45"], "description": "The Forerunner 45 personalizes how you train. Learn how your body responds to: exercise, rest and sleep. The Elevate optical heart rate monitor takes your pulse straight off your wrist, no need for a chest strap. Running metrics like speed and distance are handled by the onboard GPS and internal accelerometers. These sensors turn your movement into data, making sure you get credit for all you do, in the gym and trails. Paired with your phone via Garmin Connect, you can review activities, receive notifications, download training plans, keep an eye on the weather, and control phone apps; like music players. Not just an app, Garmin Connect’s online community lets you join challenges, share milestones and get encouragement.Built-in activity modes for biking (outdoor), running (outdoor) and walking, with more activities unlockable through free the Connect app, like elliptical training, biking (indoor), running (indoor) stair stepping, yoga and more.A powerful, internal antenna connects to 3 different satellite constellations, GPS, GLONASS and Galileo. Multiple networks, combined with satellite position caching, give you a fast connection and a strong GPS signal wherever you are.Internet Live Tracking during activities.V3 low-profile Elevate™ optical heart rate monitor provides reliable constant heart rate data and allows you to train without a chest strap.Broadcast of your HR over ANT+.VO2 max data lets you see how efficiently your body uses oxygen.Incident detection: in case of accident, the unit sends a signal through your phone to your emergency contacts.Assistance mode sends out a predefined message (through your phone), to you emergency contacts so they can keep an eye on you.Body Battery™ mode monitors what drains your energy (exercise) and recharges your energy (rest, food, etc.), you get a better idea of how, and when to train.Garmin Coach provides free, personalized training plans through Garmin Connect.Stress level score monitors heart rate variability while inactive to produce a stress score, and helps guide you to reduce stress.Move bar reminds you to move after being stationary for too long.On board sleep tracking mode monitors total sleep hours and restful sleep.Smart notifications (emails, texts, alerts and more) come in via Bluetooth connection to your smartphone.Automatically sync your data to a paired smartphone running the free Garmin Connect app.Connects with ANT+ and Bluetooth Smart, from foot pods, to speed and cadence pods (not power meters or Varia lights).Connect IQ support allows you to download custom watch faces.Intuitive 5-button interface works with and without gloves and in all weather conditions.Always-on, colour display is bright and clear in any conditions.Internal memory stores up to 200 hours of activities. Garmin Connect will store all of your activity data.Battery lasts up to 13 hours in GPS mode or up to 7 days in watch mode.Fits wrists of 129-197mm.In the box: Forerunner 45, charging cable and documentation.", "product_code": "6005-023", "tech_specs": {"Weight": ["36g"], "Ideal for": ["Running, fitness and training", "Cycling", "Casual wear"], "Face material\n\nPolycarbonate is inexpensive and light, with good clarity and wear-resistance. Mineral crystal glass offers greater clarity and significantly greater wear-resistance. Sapphire crystal is better still for clarity and wear-resistance.": ["Mineral crystal glass"], "Wrist strap material": ["Silicone"], "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": ["IP X8"], "Dimensions": ["4.2 x 1.2cm"], "Snooze": ["No"], "Countdown timer": ["Yes"], "Stopwatch": ["Yes"], "Electronic compass\n\nAn electronic compass allows the user to view their heading in situations where they are either standing still or moving too slowly for the GPS to detect.": ["No"], "12/24 hour format": ["Yes"], "Interface": ["USB", "Wireless"], "Low battery warning": ["Yes"], "Calorie consumption\n\nCalculated based on data from a heart rate monitor.": ["Yes"], "App compatibility\n\nAn online community where members upload, analyze and share activity data.": ["Garmin Connect"], "Add maps capability\n\nThese units allow you to add maps, so you can mark and name waypoints and create routes on your PC, and then upload the map of your choice to your GPS.": ["No"], "Programmable workouts\n\nWant an easy jog? A fast-paced ride? A workout with lots of variety to keep you on your toes? With programmable workouts you can tailor your training to match whatever you are looking for on a particular day.": ["Advanced"], "New lap auto start\n\nAutomatically triggers a new lap after reaching a specified difference.": ["Yes"], "Heart rate monitor": ["Yes"], "Distance/time alarm": ["Yes"], "Interval training": ["Yes"], "Bluetooth": ["Yes"], "Auto pause\n\nAutomatically pauses timer when you stop or go below a specified pace.": ["Yes"], "Heart rate in real time\n\nDisplays beats per minute during activity.": ["Yes"], "Calories in real time\n\nDisplays calorie expenditure during activity, based on heart rate monitor data.": ["Yes"], "Speed/cadence sensor\n\nMonitors pedalling cadence and measures pedalling strokes per minute.": ["Sold separately"], "Battery life": ["13-168 h"], "Chest strap": ["Sold separately"], "Custom POI\n\nA POI (point of interest) is a specific location that someone may find interesting (i.e., favourite viewpoint, best coffee stop before the trailhead). The custom POI feature allows the user to load only the POI's that interest them onto their GPS unit.": ["Yes"], "Metric/imperial units format": ["Yes"], "Power meter\n\nDisplays output in watts as you ride.": ["Not compatible"], "Unit to unit transfer\n\nShares data wirelessly between compatible units.": ["No"], "Basemap\n\nA basic set of map data that is included with the GPS. Basemap detail may vary from unit to unit.": ["No"], "Area calculation": ["No"], "Tide tables": ["No"], "Battery power indicator": ["Yes"], "Data card": ["Not accepted"], "Foot pod\n\nAttaches to your shoe, captures your running data (i.e., pace, distance), and transmits it to your heart rate monitor or GPS.": ["Sold separately"], "Touch screen": ["No"], "Heart rate target zones\n\nDisplays heart rate zones during activity.": ["Yes"], "Barometric altimeter\n\nBarometer function helps forecast weather trends. An altimeter can provide one line of position for location on a topo map, useful if the GPS isn't working.": ["No"], "Coded signal\n\nA coded instrument ensures no interference between your chest strap and your watch, necessary if you are training in busy gyms or trails where other signals may be encountered.": ["Yes"], "Workout history": ["Yes"], "Wireless sync": ["Yes"], "WiFi": ["No"], "Button lock": ["Yes"], "Batteries": ["Lithium-ion (included)"], "Haptic feedback": ["Yes"], "Case diameter": ["42mm"], "Virtual partner\n\nAllows user to monitor training goals with either a virtual partner or alarms.": ["Yes"], "Pause timer\n\nPauses the timer when slowing or stopping, and automatically resumes when moving again.": ["Yes"], "Replaceable wrist strap": ["Yes"], "Pace alarm\n\nAn alarm that notifies you if you vary from a pre-set pace.": ["Yes"], "ANT+ compatible\n\nEnsures seamless digital wireless communication between ANT+ devices. For example, data from an ultra-low power wireless sensor can be displayed on a bike computer or smartphone, then downloaded to a PC, etc.": ["Yes"], "Made in": ["Taiwan"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035289821214/6005023-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035835506718/6005023-BK000-ALT-LEFT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035835965470/6005023-BK000-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035836096542/6005023-BK000-ALT-ASSISTANCE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035836194846/6005023-BK000-ALT-TRAINING.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035836227614/6005023-BK000-ALT-LIFESTYLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035836391454/6005023-BK000-ALT-RIGHT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035836686366/6005023-BK000-ALT-STATS.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035289821214/6005023-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035835506718/6005023-BK000-ALT-LEFT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035835965470/6005023-BK000-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035836096542/6005023-BK000-ALT-ASSISTANCE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035836194846/6005023-BK000-ALT-TRAINING.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035836227614/6005023-BK000-ALT-LIFESTYLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035836391454/6005023-BK000-ALT-RIGHT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9035836686366/6005023-BK000-ALT-STATS.jpg"]}