{"name": "Nuun Hydration Immunity Tablets Orange Citrus", "categories": ["Home", "All", "Camping and hiking", "Camping kitchen and hydration", "Food and drink", "Drinks", "Energy and recovery drinks", "Hydration Immunity Tablets Orange Citrus"], "description": "Give your immune system a boost with this tasty blend of botanicals, vitamins and electrolytes. Each sip has the bright zing of citrus that can be so comforting when you're feeling less than yourself. Nuun has developed their immunity line for those times you aren’t feeling yourself. Whether you're stressed, over-tired, finishing a grueling training session or coming down with something, these effervescent tablets help give you a lift.Ingredients: dextrose, citric acid, natural flavors, stevia leaf extract, avocado oil and rice concentrate.Each tablet contains 125 mg of Nuun’s proprietary herbal blend that boosts your immune system and reduces inflammation - blend contains: elderberry extract, organic ginger powder, organic turmeric, echinacea purpurea.Dissolve one tablet in 500ml of water.Contains 10 tablets.", "product_code": "6006-151", "tech_specs": {"Weight": ["54g"], "Ideal for": ["Everyday use", "Travel"], "Best consumed": ["Recovery"], "Serving size": ["1 tablet (makes 500-650 ml)"], "Servings": ["10"], "Calories per serving": ["15Cal"], "Carbohydrates": ["4g"], "Sugar": ["2g"], "Sodium": ["100mg"], "Potassium": ["150mg"], "Magnesium": ["15mg"], "Protein": ["0g"], "Gluten free\n\nMade with gluten-free ingredients, but not necessarily in a guaranteed gluten-free environment.": ["Yes"], "Dairy free": ["Yes"], "Vegetarian\n\nDoes not contain animal products but may contain dairy or egg products.": ["Yes"], "Nut free\n\nThis product is nut free and is produced in a nut free environment.": ["Yes"], "Soy free": ["Yes"], "Vegan\n\nThis product does not contain animal products or by-products.": ["Yes"], "Made in": ["USA"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9054709284894/6006151-NOC02.jpg"]}