{"name": "New Balance 890v8 Road Running Shoes - Men's", "categories": ["Home", "All", "Run and fitness", "Running and training footwear", "Running shoes", "Road running shoes", "890v8 Road Running Shoes"], "description": "Feed your need for speed. These shoes have a pleasantly light ride and feel as snappy as they look. With sleek seamless uppers and FuelCell foam through the midsoles, they offer superb running comfort and an energizing ride.Breathable mesh upper with a gusseted tongue for a locked-in fit.FuelCell foam midsole provides high-rebound and energy return.Ground Contact Revlite outsole with blown rubber zones for grip combined with lightweight cushioning.", "product_code": "6006-621", "tech_specs": {"Weight": ["476g (9.0D)"], "Ideal for": ["Road running"], "Feel\n\n'Minimal and natural' shoes offer low drop, lots of flex, and minimal cushioning. Most running shoes are 'Light and responsive' with medium cushioning and good energy return. 'Cushioned and floaty' shoes have maximum cushioning.": ["Light and responsive"], "Stability\n\nSome shoes include added motion control or stability features to help minimize over pronation, where the foot tends to roll inward in a biomechanically imbalanced running position.": ["Neutral"], "Upper material": ["Synthetic"], "Closure": ["Lace-up"], "Heel-to-toe cushioning\n\nThe approximate thickness of the midsole cushioning under the heel and the forefoot. A thicker heel and greater difference between heel and toe height tends to suit heel-strike runners, while forefoot and midfoot strikers may prefer a minimal drop between heel and toe cushioning.": ["25-19mm"], "Drop\n\nThe drop is the difference in height between the heel and the forefoot midsole cushioning. Traditional running shoes tend to have a 10mm drop or higher while minimalist style shoes are on the lower end of the spectrum.": ["6mm"], "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": ["No"], "Removable insole": ["Yes"], "Made in": ["Vietnam"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9127960477726/6006621-BMT06.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9127959265310/6006621-BMT06-ALT-LEFT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9127959298078/6006621-BMT06-ALT-SOLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9127959461918/6006621-BMT06-ALT-TOP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9127960477726/6006621-BMT06.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9127959265310/6006621-BMT06-ALT-LEFT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9127959298078/6006621-BMT06-ALT-SOLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9127959461918/6006621-BMT06-ALT-TOP.jpg"]}