{"name": "Knog Plus Rear Light - Unisex", "categories": ["Home", "All", "Cycling", "Bike accessories", "Bike lights", "Rear bike lights", "Plus Rear Light"], "description": "This bright rear light lets you add a lot of visibility without adding a lot of weight. With easy USB charging and 5 different modes the Plus rear light is a worthwhile addition to your kit. Knog has developed a clever magnetic mount that lets you swap your Plus light from your bike to you, or just off your bike with a click. There is also an integrated clip makes it easy to attach this lightweight light to you clothing or your 4-legged friend on low-light outings.  Weighing in at a paltry 12 grams a piece this little light won’t slow you down or tug at your kit.Magnetic mount lets you attach your light to the bike mount base with little more than a magnetic click. Mount base includes multiple different sized o-rings for mounting to bars, posts, stays or even your helmet vents.Integrated clip lets you attach the light to you, your pack, your pooch, really anything you want easily seen.5 different modes: steady, strobe, pulse, fancy flash and eco flash.Waterproof design means that if you are willing to ride in it, the Plus will keep shining.Simple 1-button interface lets you cycle through modes with a short press or lock the light (so it won’t turn on in your bag) with a long press.Integrated USB plug (type-A) means you don’t need to tote around a cable to charge your light.Easy USB charging means there are no longer any reasons to have dim light.In the box: Plus Rear light, 2x interchangeable straps for bars/seat posts 22-27mm / 28-32mm+ and a magnetic mount base.", "product_code": "6006-133", "tech_specs": {"Weight": ["12g"], "Ideal for": ["Sport road cycling", "Cycle commuting"], "Included mounts": ["Horizontal mount", "Seat post mount"], "Type\n\nMost Canadian municipalities require a white front light and a red rear light.": ["Rear"], "Light modes\n\nThe number of lighting levels/modes the light has (i.e., low, med, high, flash).": ["5 modes"], "Boost mode\n\nBriefly increases the light output to maximum brightness and distance.": ["No"], "Light source": ["LED"], "Burn time - flash": ["40-8.5 h"], "Burn Time - steady": ["2 h"], "Max light output\n\nThe total quantity of light emitted in every direction from a source of light; measured in lumens.": ["20 lumens"], "Charge time\n\nThe amount of time it takes to fully charge the battery. Applies to lithium and NiMH type batteries. Does not apply to rechargeable or non-rechargeable AA or AAA batteries.": ["4 h"], "Rechargeability\n\nRechargeable lights give you hassle-free recharging with almost any power source. Replaceable batteries provide instant power, but you’ll need to bring extra batteries, recycle used ones and buy new ones.": ["Rechargeable"], "Helmet attachment\n\nIncludes a bracket or mounting system that attaches to most bike helmets.": ["Yes"], "Red light mode": ["Yes"], "Regulated output\n\nOn regulated lights brightness is consistent, and does not decrease gradually as the batteries are drained.": ["No"], "Batteries": ["Li-polymer (included)"], "Flash mode": ["Yes"], "Product sustainability": ["Rechargeable batteries"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9044929773598/6006133-BK000.jpg"]}