{"name": "Arc'teryx Alpha FL 40 Backpack - Unisex", "categories": ["Home", "All", "Camping and hiking", "Packs", "Backpacking packs", "Overnight packs (35 - 55l)", "Alpha FL 40 Backpack"], "description": "Stripped back to the basics, the Alpha FL 40 is built for fast and light climbers on technical routes. It uses Arc'teryx's signature attention to detail and craftmanship to create a carefully considered feature set. Instead of a bulky traditional lid, there's a combination drawstring and roll-top closure to cinch down the pack for small loads or expand it to carry larger ones. Lots of lash points, a rope strap, dual ice axe loops, and crampon bungees let you customize the pack to carry the gear you need for each lightweight mission.N400-AC² main fabric with fully sealed seams and Advanced Composition Construction coating is totally waterproof and resistant to abrasion.White interior makes it easier to find items inside the pack.Watertight external zippers keep moisture from sneaking in.Padded foam back panel provides structure and support without excess weight.Thermoformed shoulder straps use an air permeable fabric for comfort next to skin.Wide webbing waistbelt minimizes sway on technical routes.Roll-top closure seals out weather and eliminates the traditional bulky top lid.Expandable drawstring collar for times when you need to carry more gear.Dual-haul loops double as carry handles and let you use the pack as a haul bag or clip it off to an anchor.Dual ice axe loops.6 front lash points and a front bungee system for attaching extra gear.Top compression straps holds a rope.", "product_code": "6009-967", "tech_specs": {"Weight": ["715g"], "Ideal for": ["Rock climbing", "Alpine climbing and mountaineering", "Backpacking"], "Main fabric": ["400-denier ripstop nylon"], "Secondary fabric": ["70-denier ripstop nylon"], "Access\n\nThe location of all access points into the main compartment of the pack.": ["Top"], "Hipbelt": ["Waistbelt"], "Volume": ["40L"], "Length": ["63cm"], "Width": ["30cm"], "Depth": ["25cm"], "Additional feature(s)": ["Expandable collar", "Ice axe/pole attachment"], "Made in": ["Philippines"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9153615495198/6009967-DYN99.jpg"]}