{"name": "Garmin Vivomove Style", "categories": ["Home", "All", "Camping and hiking", "Electronics", "Watches", "Activity & fitness trackers", "Vivomove Style"], "description": "Timeless style that can be dressed up or dressed down. With its classic timepiece aesthetic, the vívomove Style doesn’t look like your average smartwatch. But, below its analogue hands lies a sophisticated touchscreen and all the tech you’d expect from Garmin. Equipped with the latest generation Elevate optical heart rate monitor, pulse information comes straight off your wrist.  Heart rate information is used for tracking calories, stress level, fitness age, and more. Internal accelerometers take cues from your movements, from waking the display as you raise your arm, to tracking your waking and resting. Paired with a smartphone running Garmin Connect, you can get smart notifications, weather data, review your calendar and control phone apps like music players. Connect used the power of your phone’s GPS to tell you more about how you train. Share with Garmin’s online community, join challenges, mark milestones, and get encouragement. Keep an eye on your stress levels by monitoring your heart rate variability. Seeing spikes helps you find ways to remove stress triggers. When stress levels are high, a relaxation timer helps you bring more calm to your day.Light and strong anodised aluminum case and tough domed Corning® Gorilla® crystal.Textured nylon or sleek silicone straps travel well and can be dressed up, or down.Classic analogue hands automatically move out of the way when using the touchscreen.Discreet colour touchscreen AMOLED display is only visible when needed, reverting to stylish analogue timepiece when not in use.Move IQ intelligently detects an tracks activity, your Garmin Connect timeline ensures you get credit for all of your daily exercise.Preloaded with strength training, elliptical training, stair stepping, yoga, and cardio training activity profiles.Equipped with Garmin’s V3 Elevate™ optical heart rate monitor. Elevate V3 has a red LED to provide Pulse Ox measurements.Broadcast of your HR over ANT+ (so other devices can pick it up).VO2 max data gives you a peak behind the curtain, helping you better understand your fitness level by looking at how efficiently your body uses oxygen.Body Battery™ tracks your daily energy levels, monitoring what drains your energy (exercise) and recharges your energy (rest, food, etc.), you get a better idea of how and when to train.Garmin Pay™ contact-less payment; by linking credit cards to your Garmin account, you can make payments with your watch (if supported by your bank).Stress level score monitors heart rate variability while inactive to produce a stress score from 0-100, the lower the score, the lower your stress.  When stress levels are high, the vívomove’s relaxation timer takes you through steps to lower your levels.24/7 activity tracking learns your activity level and guides you towards a more active lifestyle.On board sleep tracking mode monitors your rest, breathing patterns, total sleep hours as well as periods of movement and restful sleep in your Garmin Connect profile.Counts flights of stairs with internal barometer data that’s combined with your step data.Weekly intensity minutes are displayed against the ideal of 150 needed to maintain a healthy life.Move bar reminds you to move after being stationary for too long.Connected GPS features leverage your phone’s GPS to track your training, offering speed, distance and pace for running and cycling.Automatically syncs your data to your phone running the free Garmin Connect app.Free Garmin Connect app lets you review activities, receive texts, social media alerts, emails, etc., download training plans, track the weather and more, all via Bluetooth to your phone.Internal memory stores up to 7 timed activities and 2 weeks worth of daily activity. Garmin Connect will store all of your activity data.Rechargeable lithium-ion battery lasts up to 5 days as an activity tracking smartwatch, or 2 weeks in watch only mode.20mm lug width and quick-release straps, makes strap customization easy.Fits wrist sizes 125-190mm.In the box: vívomove Style, charging cable, documentation.", "product_code": "6009-108", "tech_specs": {"Weight": ["42g"], "Ideal for": ["Everyday use"], "Date display": ["Yes"], "Face material\n\nPolycarbonate is inexpensive and light, with good clarity and wear-resistance. Mineral crystal glass offers greater clarity and significantly greater wear-resistance. Sapphire crystal is better still for clarity and wear-resistance.": ["Mineral crystal glass"], "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": ["IP X8"], "Daily alarms": ["8"], "Snooze": ["No"], "Countdown timer": ["Yes"], "Stopwatch": ["Yes"], "Replaceable batteries": ["No"], "Water-resistant": ["50m"], "12/24 hour format": ["Yes"], "Metric/imperial units format": ["Yes"], "Interface": ["USB", "Wireless"], "Low battery warning": ["Yes"], "Calorie consumption\n\nCalculated based on data from a heart rate monitor.": ["Yes"], "Foot pod\n\nAttaches to your shoe, captures your running data (i.e., pace, distance), and transmits it to your heart rate monitor or GPS.": ["Not compatible"], "App compatibility\n\nAn online community where members upload, analyze and share activity data.": ["Garmin Connect", "Third party apps"], "Programmable workouts\n\nWant an easy jog? A fast-paced ride? A workout with lots of variety to keep you on your toes? With programmable workouts you can tailor your training to match whatever you are looking for on a particular day.": ["Basic"], "Heart rate monitor": ["Yes"], "Touch screen": ["Yes"], "Heart rate target zones\n\nDisplays heart rate zones during activity.": ["Yes"], "Coded signal\n\nA coded instrument ensures no interference between your chest strap and your watch, necessary if you are training in busy gyms or trails where other signals may be encountered.": ["Yes"], "Workout history": ["Yes"], "Wireless sync": ["Yes"], "Interval training": ["Yes"], "WiFi": ["No"], "Button lock": ["No"], "Bluetooth": ["Yes"], "Batteries": ["Rechargeable battery pack (non-removable)"], "Haptic feedback": ["Yes"], "Virtual partner\n\nAllows user to monitor training goals with either a virtual partner or alarms.": ["No"], "Heart rate in real time\n\nDisplays beats per minute during activity.": ["Yes"], "Replaceable wrist strap": ["Yes"], "Calories in real time\n\nDisplays calorie expenditure during activity, based on heart rate monitor data.": ["Yes"], "Speed/cadence sensor\n\nMonitors pedalling cadence and measures pedalling strokes per minute.": ["Not compatible"], "ANT+ compatible\n\nEnsures seamless digital wireless communication between ANT+ devices. For example, data from an ultra-low power wireless sensor can be displayed on a bike computer or smartphone, then downloaded to a PC, etc.": ["Yes"], "Battery life": ["120-336 h"], "Chest strap": ["Not compatible"], "Made in": ["Taiwan"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9065470918686/6009108-LGB07.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066002382878/6009108-LGB07-ALT-FRONTANALOGUE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066002612254/6009108-LGB07-ALT-FRONTSTEPS.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066002645022/6009108-LGB07-ALT-FRONTTIMER.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066002677790/6009108-LGB07-ALT-MESSAGES.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066002710558/6009108-LGB07-ALT-SIDEBACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066002808862/6009108-LGB07-ALT-SIDELEFT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066002907166/6009108-LGB07-ALT-SIDERIGHT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066001956894/6009108-GBP07-ALT-FRONTANALOGUE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066001989662/6009108-GBP07-ALT-FRONTSTEPS.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066002022430/6009108-GBP07-ALT-FRONTTIMER.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066002120734/6009108-GBP07-ALT-MESSAGES.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066002153502/6009108-GBP07-ALT-SIDEBACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066002251806/6009108-GBP07-ALT-SIDELEFT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066002350110/6009108-GBP07-ALT-SIDERIGHT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9065470623774/6009108-GBP07.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9065470918686/6009108-LGB07.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066002382878/6009108-LGB07-ALT-FRONTANALOGUE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066002612254/6009108-LGB07-ALT-FRONTSTEPS.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066002645022/6009108-LGB07-ALT-FRONTTIMER.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066002677790/6009108-LGB07-ALT-MESSAGES.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066002710558/6009108-LGB07-ALT-SIDEBACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066002808862/6009108-LGB07-ALT-SIDELEFT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066002907166/6009108-LGB07-ALT-SIDERIGHT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066001956894/6009108-GBP07-ALT-FRONTANALOGUE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066001989662/6009108-GBP07-ALT-FRONTSTEPS.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066002022430/6009108-GBP07-ALT-FRONTTIMER.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066002120734/6009108-GBP07-ALT-MESSAGES.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066002153502/6009108-GBP07-ALT-SIDEBACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066002251806/6009108-GBP07-ALT-SIDELEFT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066002350110/6009108-GBP07-ALT-SIDERIGHT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9065470623774/6009108-GBP07.jpg"]}