{"name": "Garmin Vivoactive 4", "categories": ["Home", "All", "Camping and hiking", "Electronics", "Watches", "Activity & fitness trackers", "Vivoactive 4"], "description": "Listen to music, track steps, monitor stress and get animated workouts. An Elevate optical heart-rate monitor reads your pulse straight off your wrist. GPS and an internal accelerometer track speed and distance to credit all your work in the gym and on the trails. When you need a little personal time, follow mindful breathing exercise, or an animated yoga class. Pairing it with the free Garmin Connect app on your phone to receive notifications, track  weather and control apps like Spotify .Activity animations for 40 structured workouts: strength training, cardio, Pilates and yoga,Create customized workouts too.Built-in activity modes for biking, running, walking, swimming (indoor only), strength training (with rep counter), yoga, Pilates and more.Stress level score monitors heart rate variability.Breathwork mode guides you through mindful breathing exercises.Respiration tracking counts breaths per minute both while asleep and awake, providing nightly, daily and weekly averages.Garmin Coach provides free, personalized training plans that you can download through Garmin Connect. Train for your first 5k, improve on your next 10k, or just learn to train more efficiently.Move IQ intelligently detects your activity and tracks it; these activities appear in your Connect timeline, so you get credit for all your daily exercise, from taking the stairs at work, to catching that evening spin class.Stream music to Bluetooth® headphones using Spotify or Amazon Music. Download via Spotify (premium account required) or MP3s from your computer.Synced playlists can update when in range of Wi-Fi.Holds up to 500 songs.Body Battery™ tracks daily energy levels, monitoring what drains your energy (exercise) and recharges your energy (rest, food, etc.), you get a better idea of how and when to train.Garmin Pay™ contact-less payment (if supported by your bank).LiveTrack during activities (through a connected phone) shares your location and fitness data.Incident detection + assistance mode sends out a LiveTrack link.Connects to 3 different satellite constellations (GPS, GLONASS and Galileo) and caches positions.V3 Elevate™ optical heart rate monitor.Broadcast of your HR over ANT+.Menstrual tracking logs physical and emotional symptoms, plus training and nutrition during each phase of your cycle.24/7 activity tracking learns your activity level and guides you towards a more active lifestyle.Sleep tracking mode.Counts flights of stairs with internal barometer data that’s combined with your step data.Weekly intensity minutes are displayed against the ideal of 150 needed to maintain a healthy life.Automatically sync to phone running Connect app.Connects with ANT+ and Bluetooth Smart sensors, from foot pods, to speed and cadence pods (no power meters).Connect IQ support allows you to download apps, templates, data fields, watch faces, and other features.Basic waypoint navigation care of the internal GPS and compass.Back to start feature directs you (as the crow flies) to where you started your activity.Internal memory stores up to 7 timed activities and 2 weeks worth of daily activity. Garmin Connect will store all of your activity data.User-friendly strap changes, thanks to quick-release pins.In the box: vívoactive 4, charging/data clip, documentation.", "product_code": "6009-112", "tech_specs": {"Weight": ["51g"], "Ideal for": ["Everyday use", "Running, fitness and training"], "Date display": ["Yes"], "Face material\n\nPolycarbonate is inexpensive and light, with good clarity and wear-resistance. Mineral crystal glass offers greater clarity and significantly greater wear-resistance. Sapphire crystal is better still for clarity and wear-resistance.": ["Mineral crystal glass"], "Wrist strap material": ["Silicone"], "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": ["IP X8"], "Daily alarms": ["1"], "Snooze": ["No"], "Countdown timer": ["Yes"], "Stopwatch": ["Yes"], "Replaceable batteries": ["No"], "Water-resistant": ["50m"], "12/24 hour format": ["Yes"], "Metric/imperial units format": ["Yes"], "Interface": ["USB", "Wireless"], "Low battery warning": ["Yes"], "Calorie consumption\n\nCalculated based on data from a heart rate monitor.": ["Yes"], "Foot pod\n\nAttaches to your shoe, captures your running data (i.e., pace, distance), and transmits it to your heart rate monitor or GPS.": ["Sold separately"], "App compatibility\n\nAn online community where members upload, analyze and share activity data.": ["Garmin Connect", "Third party apps"], "Programmable workouts\n\nWant an easy jog? A fast-paced ride? A workout with lots of variety to keep you on your toes? With programmable workouts you can tailor your training to match whatever you are looking for on a particular day.": ["Advanced"], "Heart rate monitor": ["Yes"], "Touch screen": ["Yes"], "Heart rate target zones\n\nDisplays heart rate zones during activity.": ["Yes"], "Coded signal\n\nA coded instrument ensures no interference between your chest strap and your watch, necessary if you are training in busy gyms or trails where other signals may be encountered.": ["Yes"], "Workout history": ["Yes"], "Wireless sync": ["Yes"], "Interval training": ["Yes"], "WiFi": ["Yes"], "Button lock": ["Yes"], "Bluetooth": ["Yes"], "Batteries": ["Rechargeable battery pack (non-removable)"], "Haptic feedback": ["Yes"], "Virtual partner\n\nAllows user to monitor training goals with either a virtual partner or alarms.": ["Yes"], "Heart rate in real time\n\nDisplays beats per minute during activity.": ["Yes"], "Replaceable wrist strap": ["Yes"], "Calories in real time\n\nDisplays calorie expenditure during activity, based on heart rate monitor data.": ["Yes"], "Speed/cadence sensor\n\nMonitors pedalling cadence and measures pedalling strokes per minute.": ["Sold separately"], "ANT+ compatible\n\nEnsures seamless digital wireless communication between ANT+ devices. For example, data from an ultra-low power wireless sensor can be displayed on a bike computer or smartphone, then downloaded to a PC, etc.": ["Yes"], "Battery life": ["8-192 h"], "Chest strap": ["Sold separately"], "Made in": ["Taiwan"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9065471770654/6009112-BK095.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066004611102/6009112-BK095-ALT-FRONTACTIVITIES.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066004643870/6009112-BK095-ALT-FRONTREPS.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066004742174/6009112-BK095-ALT-FRONTSTATS.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066004906014/6009112-BK095-ALT-MESSAGES.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066004938782/6009112-BK095-ALT-SIDEBACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066004971550/6009112-BK095-ALT-SIDELEFT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066005004318/6009112-BK095-ALT-SIDERIGHT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9065471770654/6009112-BK095.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066004611102/6009112-BK095-ALT-FRONTACTIVITIES.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066004643870/6009112-BK095-ALT-FRONTREPS.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066004742174/6009112-BK095-ALT-FRONTSTATS.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066004906014/6009112-BK095-ALT-MESSAGES.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066004938782/6009112-BK095-ALT-SIDEBACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066004971550/6009112-BK095-ALT-SIDELEFT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9066005004318/6009112-BK095-ALT-SIDERIGHT.jpg"]}