{"name": "MSR MiniWorks EX Purifier System", "categories": ["Home", "All", "Camping and hiking", "Camping kitchen and hydration", "Water bottles and water treatment", "Water filters, treatment and tablets", "Water filters", "Pump filters", "MiniWorks EX Purifier System"], "description": "The classic MSR Miniworks EX water filter now with Aquatabs water purification tablets, for reliable water from questionable sources. The Miniworks EX has a side-mounted lever for easy pumping, and a carbon-cored ceramic element to remove bacteria, protozoa and particulate down to 0.2 microns. The threaded base screws securely onto Nalgene® wide-mouth water bottles and MSR Dromedary™ bags. The included Aquatabs tablets are effective against giardia, bacteria, and viruses, and are safe for adults (including pregnant women) and children to use.Filters at 1L per minute flow rate using AirSpring™ air bubble technology.Filter is effective against protozoa, and 0.2 micron or larger bacteria.Reduces concentrations of some chemicals (including iodine and chlorine), odours and tastes.Includes 50 Aquatab tablets. In normal use with clear water, each tablet treats 2 litres.Requires 30 minute contact time with water.Contains sodium dichloroisocyanurate (source of chlorine), certified to NSF / ANSI Standard 60.Approved and used by international aid agencies including: NATO, WHO, Unicef, International Red Cross, Medecins Sans Frontieres, and Oxfam.Aquatabs have not been proven effective against the cyst cryptosporidium when in the oocyst stage of its life cycle.", "product_code": "6010-900", "tech_specs": {"Weight": ["456g"], "Ideal for": ["Camping and hiking"], "Filter type\n\nWater can be treated using various types of filters, chemicals or non-chemical purification methods, or a combination. Filters on their own will not remove viruses as they are too small.": ["Ceramic filter w/carbon core"], "Output": ["1L/min"], "Dimensions": ["19 x 7cm"], "Cartridge life\n\nThe life of the filter cartridge is based on the quantity of water you can treat before the cartridge is no longer effective. This does not apply to battery operated or chemical filter systems.": ["2000L"], "Filter size\n\nA 0.5 micron or smaller filters protozoa and some large bacteria; 0.2 micron or smaller filters smaller bacteria such as campylobacter.": ["0.2microns"], "Effective against protozoa\n\nProtozoa are larger than one micron and include cryptosporidium and giardia.": ["Yes"], "Effective against viruses\n\nMost viruses are in the 0.1 micron size range, but they can be as small as 0.002 microns.": ["Yes"], "Effective against particulate\n\nParticulate consists of very small bits and pieces such as dirt or bugs.": ["Yes"], "Effective against bacteria\n\nBacteria can cause illnesses such as diarrhea and dysentery and are about 1.0 micron in size, although some can be as small as 0.2 microns.": ["Yes"], "Made in": ["USA"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9082894549022/6010900-NOC02.jpg"]}