{"name": "Salomon Stance 102 Skis - Unisex", "categories": ["Home", "All", "Ski and snowboard gear", "Downhill skiing gear", "Downhill skis", "Stance 102 Skis"], "description": "Built for inbounds crushers who rip the whole mountain. The Stance 102 has an all-terrain rocker profile that floats through powder without sacrificing stability and power for the groomers. Light in the tip and tail for easy steering and agility, these skis adapts to handle whatever the resort throws at them.Full poplar wood core offers great stability and ski-to-snow contact.Titanal inserts above and below core help with power transfer and edging on hard snow.Layer of carbon and flax laminate keeps the weight low while increasing the ski's dampness.All-terrain rocker offers a mix of precision and manoeuvrability.Sandwich construction features ABS sidewall all around the ski for increase durability and strength.Progressive frontside sidecut improves steering in mixed snow and makes for a quick and agile ski.Glossy topsheet looks sharp and won't hold snow.", "product_code": "6010-938", "tech_specs": {"Weight": ["4.24kg (183cm)"], "Ideal for": ["Downhill skiing", "Freeride and freeskiing"], "Snow conditions": ["Mixed"], "Terrain": ["On-Piste", "Off-Piste"], "Ability\n\nBeginner: new or getting back into skiing.  Intermediate: confident with turning and stopping.  Advanced: highly confident carver. Expert: steeps, drops, park, double blacks -- bring it on.": ["Advanced", "Expert"], "Construction\n\nSandwich and combination construction is generally used for big freeride-style skis while the lighter structural cap type of construction is more commonly found on cross-country skis.": ["Sandwich"], "Core": ["Wood"], "Rocker/camber profile": ["Rocker tip", "Full camber", "Rocker tail"], "Dimension": ["132-102-120mm (176cm)", "134-102-121mm (183cm)", "134-102-101mm (190cm)"], "Turning radius": ["23m (176cm)", "23m (183cm)", "24m (190cm)"], "Bindings included": ["No"], "Made in": ["Austria"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9132494684190/6010938-BK031.jpg"]}