{"name": "Suunto 7 Watch - Unisex", "categories": ["Home", "All", "Cycling", "Training and electronics", "Bike computers", "Heart rate monitor watches", "7 Watch"], "description": "With more than 70 activity profiles and Google’s powerful Wear™ OS, this GPS smartwatch is ready to hit the ground running. An internal GPS and optical heart rate monitor let you take your training to the next level. Pair it with your phone to get calls, texts and reminders sent right to your watch. Your Suunto 7 can access your Google account for calendar updates, email, Google assistant, Google Maps and more. Use the free Suunto smartphone app to connect with other fitness platforms to share activities, plan routes or use heatmaps to find popular runs, rides, trails, or swims wherever Suunto users play. You can also download free offline outdoor maps directly to your 7. Or download music and podcasts from your Google Play account, synch your Bluetooth™ headphones to your 7 and hit play, no phone needed. Activity tracking outside of training sessions is handled by Google Fit™. Track your activity levels and receive coaching to help guide you towards a happier and healthier lifestyle.70 different sport modes and metrics (running, swimming, cycling, etc).Equipped with an optical heart rate monitor to train without a chest strap.Powered by Wear OS by Google, pairs with Gmail™, Google Maps, Google Play™ Music, Google assistant and more.Stream music or video audio (Google Play, Spotify, Pandora, YouTube and more) through a smartphone and control it right on your watch. Or, download playlists and podcasts via your Google Play Music account and enjoy your tunes phone-free. Holds 1000s of songs (depending on quality).Use Google Pay™ contact-less payment with your watch (if supported by your bank).Free offline maps let you synch and store maps. Select maps, and the 7 automatically downloads a 40-50km range when charging and connected to Wi-Fi.Heatmaps for 15 activities display popular routes.Breadcrumb style navigation tracks your route, you can overlay the track in a variety of map apps.Connects to GPS and GLONASS and Galileo or Beidou satellite constellations for fast, strong signals nearly anywhere.FusedSpeed™ combines GPS and accelerometer data to provide a very stable running pace.Google Fit tracks steps, calories, Heart Points and Move Minutes, developed with the World Health Organization (WHO) to show the impact on health and overall mental well being.Wi-Fi functionality.Connect your wireless speakers and headphones with Bluetooth.Bluetooth 5.0 offers increased range and improved power efficiency.Free Suunto app lets you connect and sync training apps, like Strava™ and TrainingPeaks™.Included Suunto Value Pack gives you premium access to popular apps, including: 60-day Strava Summit trial, 30-day Training Peaks premium membership, 3-months of Relive club, and a 90-day SportTracks membership.Google Play store gives you access to Google’s app library, to change your watch face, add dynamic weather, 5000+ different apps.Up to 12 hours in GPS tracking mode and up to 48 hours in smartwatch mode. Note: the more your Suunto 7 is doing for you, the shorter the battery life will be.Automatic software updates (over Wi-Fi) keep your watch up to date.Smart notifications (emails, texts, alerts and more) come in via Bluetooth connection to your phone.8GB internal memory, with 4.5GB of useable space leaves lots of room for apps, maps and more.Touchscreen and buttons work in any weather, with or without gloves.Bright, clear AMOLED touchscreen.Tough, non-reflective Gorilla Glass© crystal.In the box: Suunto 7, USB cable, quick guide, documentation and a Suunto sticker.", "product_code": "6010-604", "tech_specs": {"Weight": ["70g"], "Ideal for": ["Running, fitness and training", "Casual wear", "Day hiking", "Trail riding"], "Face material\n\nPolycarbonate is inexpensive and light, with good clarity and wear-resistance. Mineral crystal glass offers greater clarity and significantly greater wear-resistance. Sapphire crystal is better still for clarity and wear-resistance.": ["Mineral crystal glass"], "Wrist strap material": ["Silicone"], "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": ["IP X8"], "Built-in memory": ["8GB"], "Dimensions": ["5 x 1.6cm"], "Snooze": ["Yes"], "Countdown timer": ["Yes"], "Stopwatch": ["Yes"], "Electronic compass\n\nAn electronic compass allows the user to view their heading in situations where they are either standing still or moving too slowly for the GPS to detect.": ["Yes"], "12/24 hour format": ["Yes"], "Interface": ["USB", "Wireless"], "Low battery warning": ["Yes"], "Calorie consumption\n\nCalculated based on data from a heart rate monitor.": ["Yes"], "App compatibility\n\nAn online community where members upload, analyze and share activity data.": ["Suunto", "Third party apps"], "Add maps capability\n\nThese units allow you to add maps, so you can mark and name waypoints and create routes on your PC, and then upload the map of your choice to your GPS.": ["Yes"], "Programmable workouts\n\nWant an easy jog? A fast-paced ride? A workout with lots of variety to keep you on your toes? With programmable workouts you can tailor your training to match whatever you are looking for on a particular day.": ["No"], "New lap auto start\n\nAutomatically triggers a new lap after reaching a specified difference.": ["Yes"], "Heart rate monitor": ["Yes"], "Distance/time alarm": ["Yes"], "Interval training": ["No"], "Bluetooth": ["Yes"], "Auto pause\n\nAutomatically pauses timer when you stop or go below a specified pace.": ["No"], "Heart rate in real time\n\nDisplays beats per minute during activity.": ["Yes"], "Calories in real time\n\nDisplays calorie expenditure during activity, based on heart rate monitor data.": ["Yes"], "Speed/cadence sensor\n\nMonitors pedalling cadence and measures pedalling strokes per minute.": ["Not compatible"], "Battery life": ["7-960 h"], "Chest strap": ["Not compatible"], "Custom POI\n\nA POI (point of interest) is a specific location that someone may find interesting (i.e., favourite viewpoint, best coffee stop before the trailhead). The custom POI feature allows the user to load only the POI's that interest them onto their GPS unit.": ["Yes"], "Metric/imperial units format": ["Yes"], "Power meter\n\nDisplays output in watts as you ride.": ["Not compatible"], "Unit to unit transfer\n\nShares data wirelessly between compatible units.": ["No"], "Basemap\n\nA basic set of map data that is included with the GPS. Basemap detail may vary from unit to unit.": ["No"], "Tide tables": ["No"], "Battery power indicator": ["Yes"], "Data card": ["Not accepted"], "Foot pod\n\nAttaches to your shoe, captures your running data (i.e., pace, distance), and transmits it to your heart rate monitor or GPS.": ["Not compatible"], "Touch screen": ["Yes"], "Heart rate target zones\n\nDisplays heart rate zones during activity.": ["Yes"], "Barometric altimeter\n\nBarometer function helps forecast weather trends. An altimeter can provide one line of position for location on a topo map, useful if the GPS isn't working.": ["Yes"], "Coded signal\n\nA coded instrument ensures no interference between your chest strap and your watch, necessary if you are training in busy gyms or trails where other signals may be encountered.": ["Yes"], "Workout history": ["Yes"], "Wireless sync": ["Yes"], "WiFi": ["Yes"], "Button lock": ["Yes"], "Batteries": ["Lithium-polymer 450mAh (included)"], "Routes": ["Yes"], "Haptic feedback": ["Yes"], "Case diameter": ["50mm"], "Virtual partner\n\nAllows user to monitor training goals with either a virtual partner or alarms.": ["No"], "Pause timer\n\nPauses the timer when slowing or stopping, and automatically resumes when moving again.": ["Yes"], "Replaceable wrist strap": ["Yes"], "Pace alarm\n\nAn alarm that notifies you if you vary from a pre-set pace.": ["Yes"], "ANT+ compatible\n\nEnsures seamless digital wireless communication between ANT+ devices. For example, data from an ultra-low power wireless sensor can be displayed on a bike computer or smartphone, then downloaded to a PC, etc.": ["No"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9079313596446/6010604-BLM79.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9079349674014/6010604-BLM79-ALT-ANGLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9079349837854/6010604-BLM79-ALT-FRONT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9079349936158/6010604-BLM79-ALT-LIFESTYLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9079350624286/6010604-WBG17-ALT-ANGLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9079350722590/6010604-WBG17-ALT-LIFESTYLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9079351279646/6010604-WBG17-ALT-LIFESTYLE2.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9079350755358/6010604-WBG17-ALT-TOP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9079349182494/6010604-BK000-ALT-ANGLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9079349411870/6010604-BK000-ALT-FRONT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9079349641246/6010604-BK000-ALT-LIFESTYLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9079314251806/6010604-WBG17.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9079313530910/6010604-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9079313596446/6010604-BLM79.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9079349674014/6010604-BLM79-ALT-ANGLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9079349837854/6010604-BLM79-ALT-FRONT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9079349936158/6010604-BLM79-ALT-LIFESTYLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9079350624286/6010604-WBG17-ALT-ANGLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9079350722590/6010604-WBG17-ALT-LIFESTYLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9079351279646/6010604-WBG17-ALT-LIFESTYLE2.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9079350755358/6010604-WBG17-ALT-TOP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9079349182494/6010604-BK000-ALT-ANGLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9079349411870/6010604-BK000-ALT-FRONT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9079349641246/6010604-BK000-ALT-LIFESTYLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9079314251806/6010604-WBG17.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9079313530910/6010604-BK000.jpg"]}