{"name": "Backpacker's Pantry Kung Pao Chicken with Rice", "categories": ["Home", "All", "Camping and hiking", "Camping kitchen and hydration", "Food and drink", "Camping meals", "Kung Pao Chicken with Rice"], "description": "Delivery range isn’t an issue with this carry-out classic. Backpacker’s Pantry’s Kung Pao Chicken is loaded with moist all-white chicken, parboiled long grain rice and diced vegetables, all smothered in a spicy Sichuan sauce.Ingredients: precooked parboiled long grain brown rice, sauce (organic textured soy protein, gluten-free tamari sauce (tamari sauce (soybeans, salt), maltodextrin, salt), corn starch, onion, pure cane sugar, sea salt, garlic powder, garlic minced toasted, balsamic vinegar (maltodextrin, balsamic vinegar (contains sulfites), food starch-modified, natural flavor (contains malted barley extract), molasses and caramel color), savory soup base (maltodextrin, salt, autolyzed yeast extract, yeast extract, onion powder, silicon dioxide, turmeric extract (color), sunflower oil), white pepper, dextrose, crushed red chili pepper, citric acid, maltodextrin, fructose), dry roasted peanuts, freeze-dried cooked white meat chicken, carrots, onion, celery, parsley, green bell pepper, red bell pepper, crushed red chili pepper.Allergens: peanuts, gluten and soy.Note - Rehydration time doubles every 5,000 feet of elevation gain.  Backpacker’s Pantry estimated their rehydration times based on a 5,000 foot altitude.", "product_code": "6011-660", "tech_specs": {"Weight": ["184g"], "Ideal for": ["Backpacking", "Winter and expedition camping", "Emergency preparedness"], "Serving size": ["1/2 package"], "Servings": ["2"], "Calories per serving": ["360Cal"], "Carbohydrates": ["51g"], "Sugar": ["5g"], "Sodium": ["800mg"], "Protein": ["21g"], "Dietary fibre": ["5g"], "Total fat": ["9g"], "Cholesterol": ["20mg"], "Saturated fat": ["1.5g"], "Cook in package\n\nThe food can be cooked simply by adding hot water into the sealable package.": ["Yes"], "Gluten free\n\nMade with gluten-free ingredients, but not necessarily in a guaranteed gluten-free environment.": ["No"], "Dairy free": ["Yes"], "Vegetarian\n\nDoes not contain animal products but may contain dairy or egg products.": ["No"], "Nut free\n\nThis product is nut free and is produced in a nut free environment.": ["No"], "Soy free": ["No"], "Vegan\n\nThis product does not contain animal products or by-products.": ["No"], "Made in": ["USA"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9125064441886/6011660-NOC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9125067685918/6011660-NOC02-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9125064441886/6011660-NOC02.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9125067685918/6011660-NOC02-ALT-BACK.jpg"]}