{"name": "Smith Mainline MIPS Cycling Helmet - Unisex", "categories": ["Home", "All", "Cycling", "Bike helmets and body armour", "Bike helmets", "Mainline MIPS Cycling Helmet"], "description": "Confidence inspiring protection for going big and fast. The Mainline MIPS is Smith's first full-face helmet, providing the comfort of a half shell with extra coverage. A combination of Koroyd and MIPS dispurse impacts effectively in the case of a crash and tons of vents keep you cool while climbing. Instead of a rotational dial, interchangeable pads of varied thicknesses allow you to get a proper fit, and can be washed after hot and sweaty rides.MIPS technology reduces rotational forces to the head in the event of a fall, lessening the potential damage to the brain.Koroyd and EPS provide consistent energy absorption to disperse impacts in the case of an accident.AirEvac ventilation system pulls warm air from in front of your face to reduce fog build-up on glasses.21 vents provides breathability to keep your head cool.Adjustable visor for shading and goggle storage.Multiple sized pads can be swapped out for the perfect fit.", "product_code": "6012-471", "tech_specs": {"Weight": ["770g (Medium)"], "Ideal for": ["Enduro", "Freeride and downhill riding"], "Construction\n\nMicroshell helmets are made of a thin polymer sheet over a foam liner; Hardshell helmets have a hard polymer outer shell and a foam liner; when the liner is being bonded to the outer shell during the manufacturing process, it is Molded in the shell.": ["Molded in the shell"], "Shell material": ["Polycarbonate"], "Fit system": ["Interchangeable foam pads"], "Inner material": ["EPS (expanded polystyrene)", "Co-polymer"], "Circumference\n\nThe internal circumference determines the size head that the helmet will fit.": ["51-55cm (Small)", "55-59cm (Medium)", "59-62cm (Large)"], "Vents": ["Yes"], "Approved for\n\nMost helmets are tested and certified for a specific sport. Some helmets are approved for multi-sports, but only after passing the safety tests for both sports (i.e., snowsports and cycling).": ["Cycling"], "Safety rating\n\nCetification is established by a variety of governing bodies who set impact standards. Most helmets are certified or approved for a specific sport, except in the case of multi-sport helmets (i.e., a snowsports helmet might also be approved for cycling if it meets the cycling safety standards).": ["CPSC", "EN 1078", "ASTM F1952"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9161593454622/6012471-RME00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146495205406/6012471-MAT00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9161593454622/6012471-RME00.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146495205406/6012471-MAT00.jpg"]}