{"name": "Hoka One One Carbon X 2 Road Running Shoes - Women's", "categories": ["Home", "All", "Run and fitness", "Running and training footwear", "Running shoes", "Road running shoes", "Carbon X 2 Road Running Shoes"], "description": "Add some excitement to your daily run or on race day. Built with a combination of lightweight and rubberized foam, the Carbon X 2 balances responsiveness with ample cushion for long-range distances. The carbon fibre plate is lower than on the last iteration, so it continues to provide a smooth transition through the gait without sacrificing the soft feel.Engineered mesh upper is breathable and provides a comfortable fit.Gusseted tongue, padded collar and heel counter hold your feet securely in place.High stack-height foam with early-stage Meta-Rocker for a responsive ride.PROFly dual-density EVA midsole delivers a super soft ride with responsive energy return.Carbon fibre plate helps propel you through your stride.Rubberized EVA outsole provides lightweight and durable traction.", "product_code": "6013-129", "tech_specs": {"Weight": ["396g (7)"], "Ideal for": ["Road running"], "Feel\n\n'Minimal and natural' shoes offer low drop, lots of flex, and minimal cushioning. Most running shoes are 'Light and responsive' with medium cushioning and good energy return. 'Cushioned and floaty' shoes have maximum cushioning.": ["Light and responsive"], "Stability\n\nSome shoes include added motion control or stability features to help minimize over pronation, where the foot tends to roll inward in a biomechanically imbalanced running position.": ["Neutral"], "Upper material": ["Synthetic"], "Closure": ["Lace-up"], "Heel-to-toe cushioning\n\nThe approximate thickness of the midsole cushioning under the heel and the forefoot. A thicker heel and greater difference between heel and toe height tends to suit heel-strike runners, while forefoot and midfoot strikers may prefer a minimal drop between heel and toe cushioning.": ["30-25mm"], "Drop\n\nThe drop is the difference in height between the heel and the forefoot midsole cushioning. Traditional running shoes tend to have a 10mm drop or higher while minimalist style shoes are on the lower end of the spectrum.": ["5mm"], "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": ["No"], "Removable insole": ["Yes"], "Made in": ["Vietnam"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9156283072542/6013129-DBC10.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9156267737118/6013129-DBC10-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9156267835422/6013129-DBC10-ALT-BOTTOM.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9156267868190/6013129-DBC10-ALT-TOP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9156267900958/6013129-DBC10-ALT-UP-LEFT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9156268130334/6013129-DBC10-ALT-UP-RIGHT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9156283072542/6013129-DBC10.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9156267737118/6013129-DBC10-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9156267835422/6013129-DBC10-ALT-BOTTOM.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9156267868190/6013129-DBC10-ALT-TOP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9156267900958/6013129-DBC10-ALT-UP-LEFT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9156268130334/6013129-DBC10-ALT-UP-RIGHT.jpg"]}