{"name": "Honey Stinger Peanut Butter Dark Chocolate Protein Cracker Bar", "categories": ["Home", "All", "Run and fitness", "Training food and drinks", "Energy and protein bars", "Peanut Butter Dark Chocolate Protein Cracker"], "description": "Now packed with 10 grams of plant-based protein! Creamy organic peanut butter and honey sandwiched in hearty multigrain crackers and covered in a smooth dark chocolate for a hit of energy that isn’t just another bar. As a bonus the chocolate coating helps prevent cracker breakage and excessive crumbs, functional chocolate, what a concept!Ingredients: organic dark chocolate (organic cane sugar, organic chocolate liquor, organic cocoa butter, organic soy lecithin added as an emulsifier and organic vanilla), organic multi-grain cracker with sea salt (organic wheat flour, organic canola oil, organic cracked wheat, organic spelt, organic rye, organic barley, organic triticale, organic oats, organic flax, organic sesame seeds, organic sugar, sea salt and organic yeast), organic peanut butter (organic peanuts and organic palm oil, salt), organic pea protein, organic honey.Allergens – contains: soy, wheat and peanuts.Made in a facility that processes: peanuts, egg, coconut, milk and other tree nuts.\nAdded \"Now packed with 10 grams of plant-based protein!\" and changed the ingredients list.\n\n        Sustainability\n\n\n\n\n\n\n.cls-1{fill:none;}.cls-2{fill:none;}\n\nOrganic\n\n\n\n\n\n\n\n\n                      Organically grown content", "product_code": "6013-719", "tech_specs": {"Weight": ["55g"], "Ideal for": ["Camping and hiking", "Cycling", "Running", "Fitness and training"], "Best consumed": ["Before exercise", "During exercise"], "Serving size": ["1 bar"], "Servings": ["1"], "Calories per serving": ["280Cal"], "Carbohydrates": ["27g"], "Sugar": ["11g"], "Sodium": ["210mg"], "Potassium": ["170mg"], "Protein": ["10g"], "Dietary fibre": ["3g"], "Total fat": ["16g"], "Cholesterol": ["0mg"], "Saturated fat": ["6g"], "Gluten free\n\nMade with gluten-free ingredients, but not necessarily in a guaranteed gluten-free environment.": ["No"], "Organic": ["Yes"], "Dairy free": ["No"], "Vegetarian\n\nDoes not contain animal products but may contain dairy or egg products.": ["Yes"], "Nut free\n\nThis product is nut free and is produced in a nut free environment.": ["No"], "Soy free": ["No"], "Vegan\n\nThis product does not contain animal products or by-products.": ["No"], "Product sustainability": ["Organically grown content"], "Made in": ["USA"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9179616247838/6013719-NOC02.jpg"]}