{"name": "Mavic Ksyrium SL Rim Brake HG11 Wheelset", "categories": ["Home", "All", "Cycling", "Bike components", "Tires, tubes, wheels and hubs", "Bike wheels", "Wheelsets", "Ksyrium SL Rim Brake HG11 Wheelset"], "description": "Svelte, stiff and tubeless-ready Ksyrium SL wheels are an excellent everyday choice for committed riders and racers. Lighter than the old Ksyrium Elite, by 100g, despite being a wider rim.  The wide internal rim lets you use high-volume tires and lower PSIs, for a smooth-rolling, comfortable ride. The machined aluminum braking surface prevents grabby performance and is tough enough for your gravel bike or CX steed. Buttery cartridge bearings won't let you down after hard training sessions in the rain and are about as easy to adjust as it gets.Maxtal aluminum alloy rims have a higher strength to weight ration than conventional 6106 alloy.Updated design no longer requires rim tape, saving at least another 30g per wheel.Inter spoke milling reduces weight without sacrificing strength, and less weight means less inertia for quicker acceleration and better handling.UB control braking surface.Internal rim width is 19mm and optimized for 25-32mm wide tires.Straight-pull elliptical double-butted steel spokes.Spoke count is 24 front and rear.Instant Drive 360 freewheel is light and fast to engage, with only 9º of rotation.Aluminum hubs with steel axles.QRM cartridge bearings are easy to adjust and smooth.ASTM CATEGORY 2 : road and off-road with jumps less than 15cm.Includes BR601 quick releases, UST valves and documentation.Front wheel weighs 645g, rear 865g. Weighed without tires.Note – To ensure longevity of the wheel, Mavic recommends that the total weight supported by the wheels doesn’t exceed 120kg, bike included.", "product_code": "6013-983", "tech_specs": {"Weight": ["1.48kg"], "Ideal for": ["Road cycling", "Gravel riding"], "Material": ["Aluminum"], "Size": ["700C"], "Recommended tire width": ["25-32mm"], "Tire type": ["Clincher", "Tubeless"], "Retention device": ["Quick-release"], "Brake compatibility": ["Rim brakes"], "Valve compatibility\n\nThe type of tube valve the rim will accommodate. Most Schrader wheels can be retrofitted to fit Presta valves.": ["Presta"], "Front hub width\n\nThe hub width must fit the inside distance between the two fork ends (dropouts).": ["100mm"], "Rear hub width": ["130mm"], "Hub (front)": ["Mavic Infinity"], "Hub (rear)\n\nThe hub affects a bike’s rolling efficiency. Internally geared hubs require significantly less maintenance.": ["Mavic Infinity"], "Spoke count": ["24"], "Spokes": ["Stainless"], "Rims": ["Mavic Ksyrium SL"], "Made in": ["Romania"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9164043354142/6013983-BK000.jpg"]}