{"name": "Petzl Picchu Helmet", "categories": ["Home", "All", "Climbing", "Rock climbing", "Climbing helmets", "Picchu Helmet"], "description": "Kids will be happy to wear this skate-inspired helmet for both climbing and cycling. It’s light and comfortable so it won’t get in the way of a good time, but it’s safe and durable to satisfy parents.Shell is lightweight and durable, injection-moulded ABS.Expanded polystyrene inner liner absorbs impacts.Narrower webbing is more comfortable, and the chin strap buckle is placed off-centre to further increase comfort.Foam lining is removable and washable.Includes three sets of stickers, one is a reflective set.CE and UIAA certified for climbing. Meets CE EN 1078/CSPC safety standard for five-year-olds and older, and CSPC US safety standard.", "product_code": "6013-863", "tech_specs": {"Weight": ["330g"], "Ideal for": ["Urban cycling", "Snow and ice climbing", "Rock climbing"], "Construction\n\nMicroshell helmets are made of a thin polymer sheet over a foam liner; Hardshell helmets have a hard polymer outer shell and a foam liner; when the liner is being bonded to the outer shell during the manufacturing process, it is Molded in the shell.": ["Hardshell"], "Shell material": ["ABS"], "Fit system": ["Adjustable suspension system"], "Inner material": ["EPS (expanded polystyrene)"], "Circumference\n\nThe internal circumference determines the size head that the helmet will fit.": ["48-54cm"], "Vents": ["Yes"], "Headlamp compatible": ["Yes"], "Approved for\n\nMost helmets are tested and certified for a specific sport. Some helmets are approved for multi-sports, but only after passing the safety tests for both sports (i.e., snowsports and cycling).": ["Climbing", "Cycling"], "Safety rating\n\nCetification is established by a variety of governing bodies who set impact standards. Most helmets are certified or approved for a specific sport, except in the case of multi-sport helmets (i.e., a snowsports helmet might also be approved for cycling if it meets the cycling safety standards).": ["EN 1078", "CPSC (5yrs+)", "UIAA 106", "EN 12492"], "Made in": ["Portugal"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9168972840990/6013863-VLT00.jpg"]}