{"name": "Spot Spot X 2-Way Satellite Messenger", "categories": ["Home", "All", "Camping and hiking", "Electronics", "GPS Navigation", "Handheld GPS", "Spot X 2-Way Satellite Messenger"], "description": "Send texts and emails to anyone, anywhere, regardless of how many bars your phone has. The SPOT X allows 2-way messaging when you are off the grid. . With a dedicated SOS button, you can quickly and easily call for help and local first responders will be dispatched to your location. Requires a pay subscription service and a clear view of the sky to work.2-way texting and emailing from nearly anywhere on earth.Direct communication between SPOT X devices.SOS messaging sends rescuers your exact GPS location.Confirmation from rescue centre lets you know help is on the way and allows texting with rescue personnel.SOS messages are received by GEOS, a worldwide emergency response center with 24/7/365 staffing.SOS button with hard-plastic cover prevents accidental activation.Satellite coverage works around the world, including continental US, Canada and Mexico, (for coverage see SPOT’s website).Store up to 14 predefined messages.Check-in feature send pre-programmed message and GPS location via email or SMS to up to 10 pre-determined contacts.Track progress with location updates on cloud-based mapping, at  5, 10, 30 or 60 minutes to maximize battery life. Extreme tracking sends updates every 2½ minutes.2 subscription plans for year-round use, or flex plans for seasonal/month-to-month use.Free SPOT X mobile app allows pairs via Bluetooth.Electronic compass and programable waypoints.Rechargeable internal battery pack delivers up to 240 hours with 10-minute logging.Illuminated keyboard.High contrast screen is backlit and easy to read in all conditions.IPX7 waterproofing protects from downpours.In the box: Spot X, carabiner and strap, USB cable, SOS sticker, kickstand and documentation.", "product_code": "6013-433", "tech_specs": {"Weight": ["198g"], "Ideal for": ["Emergency preparedness", "Backpacking", "Winter and expedition camping"], "Satellite network used": ["Globalstar"], "Operating temperature": ["-20 to 60°C"], "Battery life (operating)": ["240 h"], "Storage temperature": ["-20 to 60°C"], "Operating altitude": ["-100 to 6,500m"], "Dimensions": ["16.6 x 7.4 x 2.4cm"], "IPX rating\n\nIndicates the degree of protection against liquid. IP X1: Dripping water while in normal operating orientation; IP X4: Splashing water; IP X5: Water jets; IP X6: Powerful water jets; IP X7: Immersion up to 1m ≤ 30 minutes; IP X8: Suitable for submersion as specified by manufacturer.": ["IP X7"], "Replaceable batteries": ["No"], "Rechargeability\n\nRechargeable lights give you hassle-free recharging with almost any power source. Replaceable batteries provide instant power, but you’ll need to bring extra batteries, recycle used ones and buy new ones.": ["Rechargeable"], "Electronic compass\n\nAn electronic compass allows the user to view their heading in situations where they are either standing still or moving too slowly for the GPS to detect.": ["Yes"], "Batteries": ["Lithium-ion (included)"], "Ability to test\n\nAllows you to test the unit.": ["No"], "Basemap\n\nA basic set of map data that is included with the GPS. Basemap detail may vary from unit to unit.": ["No"], "Barometric altimeter\n\nBarometer function helps forecast weather trends. An altimeter can provide one line of position for location on a topo map, useful if the GPS isn't working.": ["No"], "GPS data sent in SOS\n\nGPS coordinates are sent in each SOS message.": ["Yes"], "Check-in feature\n\nAllows you to send a 'check-in' message to let people know you are safe.": ["Yes"], "Floats": ["No"], "Delivery confirmation\n\nLets you know that your message was received.": ["Yes"], "Lanyard attachment": ["Yes"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146524336158/6013433-BK064.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146528301086/6013433-BK064-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146528366622/6013433-BK064-ALT-SIDE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146524336158/6013433-BK064.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146528301086/6013433-BK064-ALT-BACK.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9146528366622/6013433-BK064-ALT-SIDE.jpg"]}