{"name": "Altra Timp 3 Trail Running Shoes - Men's", "categories": ["Home", "All", "Run and fitness", "Running and training footwear", "Running shoes", "Trail running shoes", "Timp 3 Trail Running Shoes"], "description": "Float over challenging terrain and tackle long distances. The ample toe box allows your toes to spread and splay naturally during your foot strike and zero drop promotes a natural stride. A high-friction rubber sole and multi-directional lugs grip loose and uneven trails. Great for ultra or trail runners with high-volume feet.Engineered mesh upper is reinforced with overlays for added protection.4-point gaiter trap helps to secure a range of trail running gaiters.Lightweight Quantic™ EVA midsole cushions feet on long runs.MaxTrac™ outsole for traction in any terrain.Unique directional lugs under the metatarsals that are designed to engage as you push off.", "product_code": "6013-493", "tech_specs": {"Weight": ["622g (10.5)"], "Ideal for": ["Trail running"], "Feel\n\n'Minimal and natural' shoes offer low drop, lots of flex, and minimal cushioning. Most running shoes are 'Light and responsive' with medium cushioning and good energy return. 'Cushioned and floaty' shoes have maximum cushioning.": ["Cushioned and floaty"], "Stability\n\nSome shoes include added motion control or stability features to help minimize over pronation, where the foot tends to roll inward in a biomechanically imbalanced running position.": ["Neutral"], "Upper material": ["Synthetic"], "Closure": ["Lace-up"], "Heel-to-toe cushioning\n\nThe approximate thickness of the midsole cushioning under the heel and the forefoot. A thicker heel and greater difference between heel and toe height tends to suit heel-strike runners, while forefoot and midfoot strikers may prefer a minimal drop between heel and toe cushioning.": ["29-29mm"], "Drop\n\nThe drop is the difference in height between the heel and the forefoot midsole cushioning. Traditional running shoes tend to have a 10mm drop or higher while minimalist style shoes are on the lower end of the spectrum.": ["0mm"], "Waterproof\n\nWaterproof shoes and boots feature a waterproof-breathable membrane and a gusseted tongue to help keep your feet dry in wet conditions.": ["No"], "Removable insole": ["Yes"], "Made in": ["China"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9165140721694/6013493-DBL20.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9165133217822/6013493-DBL20-ALT-LEFT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9165133381662/6013493-DBL20-ALT-SOLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9165133545502/6013493-DBL20-ALT-TOP.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9165140721694/6013493-DBL20.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9165133217822/6013493-DBL20-ALT-LEFT.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9165133381662/6013493-DBL20-ALT-SOLE.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9165133545502/6013493-DBL20-ALT-TOP.jpg"]}