{"name": "Showers Pass IMBA DWR Shorts - Men's", "categories": ["Home", "All", "Cycling", "Cycling clothing", "Cycling bottoms", "Cycling shorts", "IMBA DWR Shorts"], "description": "Shake off puddle splashes and light rain in these DWR treated shorts. Made from a rugged nylon blend, the IMBA shorts wear well and feel great on the trail, and on the post-ride patio.Nylon and spandex blend balances durability with stretch.DWR finish sheds water easily, keeps your shorts looking better longer and makes them dry even quicker.Rear panel improves breathability.Adjustable tabs at the waist for the perfect fit.Silicone grip on the waistband keeps the shorts right where you want them.2 snap and hook and bar, for a secure closure.Body mapped construction lets the shorts move with you.Reflective details help keep you seen.2 zippered pockets for keys and other necessities.2 zippered thigh vents and mesh lined pockets improve ventilation.5% of net proceeds benefit the International Mountain Bicycling Association.As of 2020 Showers Pass is Climate Neutral certified, meaning they fully offset their carbon emissions. Climate Neutral certified is a consumer label that's carried by brands who take responsibility for greenhouse gas emissions generated in production, operation and shipping of  their goods and services.", "product_code": "6016-411", "tech_specs": {"Ideal for": ["Freeride and downhill riding", "Trail riding", "Enduro"], "Pockets": ["1 front zippered", "1 back zippered"], "Windproofness\n\nA windproof garment does not allow any air to permeate the fabric.  A garment with windproof panels has panels of fabric that are totally windproof, but the rest of the garment may not be windproof.  A wind-resistant garment resists some wind, but not as much as a garment that is windproof.": ["Wind-resistant"], "Finished inseam\n\nThe finished inseam measurement of the garment.": ["12in. (34)"], "Gripper elastic\n\nGripper elastics prevent the cycling shorts from riding up and leg and arm warmers from sliding down.": ["Yes"], "Chamois": ["No"], "Additional feature(s)": ["Reflective details", "DWR-treated shell fabric"], "Made in": ["Taiwan"]}, "img_urls": ["https://cdn.mec.ca/medias/sys_master/high-res/high-res/9199325806622/6016411-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9198893531166/6016411-BK000-ALT-A.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9198893498398/6016411-BK000-ALT-B.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9198893563934/6016411-BK000-ALT-C.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9199325806622/6016411-BK000.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9198893531166/6016411-BK000-ALT-A.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9198893498398/6016411-BK000-ALT-B.jpg", "https://cdn.mec.ca/medias/sys_master/high-res/high-res/9198893563934/6016411-BK000-ALT-C.jpg"]}